{
    "version": "1.0",
    "lastUpdated": "2025-03-19",
    "recipe": {
        "title": "Salmon Confit with Lemongrass Sauce",
        "readyInMinutes": 45,
        "servings": 2,
        "image": "https:\/\/img.spoonacular.com\/recipes\/659060-556x370.jpg",
        "sourceUrl": "https:\/\/www.foodista.com\/recipe\/DKLPSG8W\/salmon-confit-with-lemon-grass-sauce",
        "instructions": "<ol><li>Begin by preheating the oven to 120C. An efficient oven is important for this dish. If the oven is too cold, the fish will not get cooked. If the oven tends to get too hot, the fish will be roasted and overcooked. If you are uncertain, then think about whether your cookies\/cakes are usually overdone or underdone when you follow a recipe exactly. If they are always overdone, then you can turn down the temperature to 110C.<\/li><li>Get the freshest salmon fillets you can get your hands on. The thick ones are the nicest for this dish.<\/li><li>Add 2 tablespoons of extra virgin olive oil to the salmon fillets and rub it all over the fish.<\/li><li>Season generously with salt and pepper. About 1\/2 teaspoon each of salt and pepper. I usually use Masterfoods Garlic Pepper for each time that I need salt and pepper. Rub the seasonings all over the fish.<\/li><li>Slice two lemons into thick slices, discarding the ends. Lay the slices of lemons on a baking tray lined with baking paper.<\/li><li>Place the salmon fillets on top of the lemon slices. If you have left the skin on for the fillets, then make sure its skin side down.<\/li><li>Place the salmon fillets in the oven and cook for 25 mins. If the salmon fillets are very thick, cook a little longer for another 3 to 5 mins.<\/li><li>While the fish is cooking, prepare the vegetable medley and sauce.<\/li><li>Peel a large carrot and diagonally slice into thin slices.<\/li><li>Wash and pluck the leaves of a bunch of spinach. I used about 150g of baby spinach.<\/li><li>Heat a deep saucepan and add 1 tablespoon of cooking oil. Keep the heat at medium heat.<\/li><li>When the oil is hot, add 1 tablespoon of butter.<\/li><li>When the butter has melted, add the carrots and stir fry for a minute to cook and soften the carrots. I like them slightly crunchy so I dont cook them for too long here. Keep the heat at medium.<\/li><li>Remove the cooked carrot slices and set aside in a warm place.<\/li><li>In the same pan, add 1 tablespoon of minced garlic. Stir fry for 20 seconds.<\/li><li>Add the spinach leaves. Stir fry at medium heat.<\/li><li>Add salt and pepper to taste. About 1\/2 teaspoon each of salt and pepper. I used Masterfoods Garlic Pepper seasonings instead again.<\/li><li>Stir fry the spinach till its soft and wilted. Careful not to overcook as they would lose their natural pretty green colour.<\/li><li>Dish up the cooked spinach and set aside in a warm place.<\/li><li>Now make the sauce.<\/li><li>Peel off the hard outer layer of 2 stalks of lemon grass. Slice into 2 inch long pieces and using the back of your knife, bash the lemongrass and bruise the slightly for the fragrance and flavours to emit.<\/li><li>Add 1 tablespoon of butter to a small saucepan.<\/li><li>When the butter has melted and is bubbling slightly, add the lemongrass. Cook at medium heat for 30 seconds.<\/li><li>Add 150ml of fresh liquid cream. Let the mixture come to a gentle rolling boil.<\/li><li>Add 1 teaspoon of liquid chicken stock concentrate. Or you can use 1\/2 cube of chicken stock bouillon. Stir it in well, and do a taste check. If its not salty enough, add more chicken stock.<\/li><li>Whisk the sauce as it boils and thickens.<\/li><li>After a couple of minutes, the sauce would have thickened. Remove the lemongrass.<\/li><li>Add 1 tablespoon of lemon juice. I usually use a strainer and squeeze a lemon directly over the sauce. Do a taste check. Add more lemon juice if necessary. Whisk well to combine.<\/li><li>The salmon should be done by now. Remove them from the oven.<\/li><li>Plate your dish but placing some spinach and carrots at the bottom of a plate or shallow dish.<\/li><li>Gently place the salmon fillet on top. Drizzle a generous amount of sauce around the fish. Garnish with chives.<\/li><\/ol>",
        "summary": "Salmon Confit with Lemongrass Sauce is a main course that serves 2. Watching your figure? This gluten free, pescatarian, and ketogenic recipe has <b>865 calories<\/b>, <b>46g of protein<\/b>, and <b>68g of fat<\/b> per serving. For <b>$8.86 per serving<\/b>, this recipe <b>covers 55%<\/b> of your daily requirements of vitamins and minerals. 4 people were impressed by this recipe. This recipe from Foodista requires garlic, lemon juice, liquid chicken stock, and salt and pepper. From preparation to the plate, this recipe takes roughly <b>45 minutes<\/b>. Taking all factors into account, this recipe <b>earns a spoonacular score of 90%<\/b>, which is amazing. If you like this recipe, you might also like recipes such as <a href=\"https:\/\/spoonacular.com\/recipes\/salmon-confit-with-lemongrass-sauce-1243401\">Salmon Confit with Lemongrass Sauce<\/a>, <a href=\"https:\/\/spoonacular.com\/recipes\/salmon-confit-with-lemongrass-sauce-1404277\">Salmon Confit with Lemongrass Sauce<\/a>, and <a href=\"https:\/\/spoonacular.com\/recipes\/poached-salmon-with-artichoke-confit-1248849\">Poached Salmon with Artichoke Confit<\/a>.",
        "cuisines": [],
        "dishTypes": [
            "lunch",
            "main course",
            "main dish",
            "dinner"
        ],
        "ingredients": [
            "1 tablespoon butter",
            "1 large carrot",
            "1 teaspoon liquid chicken stock (or 1\/2 cube of chicken stock cubes)",
            "Chives to garnish",
            "1 tablespoon cooking oil",
            "150ml fresh cream",
            "2 tablespoons extra virgin olive oil",
            "1 tablespoon minced garlic",
            "2 stalks of lemon grass (ends only, outer leaves removed)",
            "1 tablespoon lemon juice",
            "2 large lemons",
            "400g – 450g salmon fillets (preferably skinless)",
            "Salt and pepper to taste",
            "150g – 200g spinach leaves (I used baby spinach leaves)"
        ]
    }
}