{
    "version": "1.0",
    "lastUpdated": "2025-03-17",
    "recipe": {
        "title": "The Blarney Burger",
        "readyInMinutes": 45,
        "servings": 4,
        "image": "https:\/\/img.spoonacular.com\/recipes\/663252-556x370.jpg",
        "sourceUrl": "https:\/\/www.foodista.com\/recipe\/6W7QVCWV\/the-blarney-burger",
        "instructions": "Irish Mustard Sauce: 1 tbsp cornstarch, 2 tsp sugar, 1 tsp dry mustard, 1\/2 tsp salt, 1 cup water, 1 tbsp butter, 1\/4 cup vinegar, 1 tsp horseradish, 2 egg yolks, beaten. Put all ingredients in a sauce pan over medium heat. Continue whisking until smooth and thickened to consistency of pudding.\nGorgonzola Butter-Wash: In a microwave safe bowl, add remaining tablespoon of Gorgonzola crumbles and 2 tablespoons of butter and melt.\nWhisk together to create a Gorgonzola butter-wash.\nBrush Gorgonzola butter-wash on the inside of the top & bottom buns and toast on the upper or outer edges of grill. Once rolls are lightly toasted, remove.\nMeat: Mix first 7 ingredients together thoroughly then add salt & pepper. Form patties and pat together well.\nCook meat over medium heat - be sure to coat grill with non-stick spray.\nCook about 8-10 minutes on each side.\nSet meat on bottom bun and spoon Irish mustard sauce on top of meat patty.\nAdd shredded cabbage and fold top and bottom together.",
        "summary": "The recipe The Blarney Burger can be made <b>in around 45 minutes<\/b>. This recipe makes 4 servings with <b>777 calories<\/b>, <b>51g of protein<\/b>, and <b>47g of fat<\/b> each. For <b>$5.46 per serving<\/b>, this recipe <b>covers 32%<\/b> of your daily requirements of vitamins and minerals. 2 people were impressed by this recipe. A mixture of ground sirloin, salt, egg, and a handful of other ingredients are all it takes to make this recipe so flavorful. It works well as a pricey main course. This recipe is typical of American cuisine. It is brought to you by Foodista. Taking all factors into account, this recipe <b>earns a spoonacular score of 63%<\/b>, which is pretty good. If you like this recipe, take a look at these similar recipes: <a href=\"https:\/\/spoonacular.com\/recipes\/blarney-balls-530965\">Blarney Balls<\/a>, <a href=\"https:\/\/spoonacular.com\/recipes\/blarney-stones-445810\">Blarney Stones<\/a>, and <a href=\"https:\/\/spoonacular.com\/recipes\/blarney-stone-204867\">Blarney Stone<\/a>.",
        "cuisines": [
            "American"
        ],
        "dishTypes": [
            "lunch",
            "main course",
            "main dish",
            "dinner"
        ],
        "ingredients": [
            "2 pounds ground sirloin",
            "1\/4 cup Irish whiskey",
            "1 egg",
            "1\/2 cup sweet onion – diced",
            "1 tablespoon fresh garlic",
            "1\/2 cup Piccante Gorgonzola crumbles (set aside 1 tablespoon)",
            "1\/2 teaspoon salt",
            "1\/2 teaspoon pepper",
            "2 tablespoons butter",
            "1 cup shredded purple cabbage",
            "4 potato bread baker's rolls or hamburger buns",
            "2 tablespoons Worchester",
            "2 tablespoons Worchester"
        ]
    }
}