{
    "version": "1.0",
    "lastUpdated": "2026-01-28",
    "recipe": {
        "title": "Wintery Vegetable Beef Soup",
        "readyInMinutes": 45,
        "servings": 8,
        "image": "https:\/\/img.spoonacular.com\/recipes\/665398-556x370.jpg",
        "sourceUrl": "https:\/\/www.foodista.com\/recipe\/FXJ6B2L6\/wintery-vegetable-beef-soup",
        "instructions": "Begin by melting the butter with the oil in a large Dutch oven.  Brown your beef well on all sides.\nOnce all sides are browned, drain off any excess fat in pan (more than a tsp.) and add 1 qt. of stock to pot.  Bring to boil, then reduce to simmer.  Cover pan and simmer gently for until meat is fork tender, ~2 1\/2 hours.\nWhen beef is finished, transfer it to a large bowl with any juices and let cool until able to handle, then shred it.\nIn the same pot you cooked the beef in, add the bacon and cook just done.  Remove bacon, but leave fat in pan.\nAdd veggies and cook until just beginning to soften.\nAdd shredded beef and reserved bacon back to pot along with herbs.\nAdd 2 qts. stock (or more to just cover) and simmer over medium-low heat until vegetables are tender, ~10 minutes or so.\nI let it sit, covered for at least an hour to allow the flavors to come together.  Remove herb stems and bay leaves.  Season with freshly cracked black pepper (and salt if needed, depends on the saltiness of the liquid you used, so taste first).\nTo serve, drizzle with a glug of balsamic vinegar and grate some fresh parmesan over the top.  Sprinkle with fresh, chopped herbs and more black pepper, if desired.",
        "summary": "Wintery Vegetable Beef Soup is a main course that serves 8. Watching your figure? This gluten free recipe has <b>400 calories<\/b>, <b>26g of protein<\/b>, and <b>19g of fat<\/b> per serving. For <b>$1.88 per serving<\/b>, this recipe <b>covers 30%<\/b> of your daily requirements of vitamins and minerals. From preparation to the plate, this recipe takes around <b>45 minutes<\/b>. This recipe is liked by 2 foodies and cooks. It will be a hit at your <b>Autumn<\/b> event. A mixture of butter, parsley, beef chuck, and a handful of other ingredients are all it takes to make this recipe so flavorful. It is brought to you by Foodista. Overall, this recipe earns a <b>good spoonacular score of 66%<\/b>. If you like this recipe, take a look at these similar recipes: <a href=\"https:\/\/spoonacular.com\/recipes\/wintery-vegetable-beef-soup-1409233\">Wintery Vegetable Beef Soup<\/a>, <a href=\"https:\/\/spoonacular.com\/recipes\/beef-soup-series-part-3-hearty-beef-vegetable-soup-1341857\">Beef Soup Series – Part 3: Hearty Beef Vegetable Soup<\/a>, and <a href=\"https:\/\/spoonacular.com\/recipes\/beef-soup-series-part-3-hearty-beef-vegetable-soup-1655557\">Beef Soup Series – Part 3: Hearty Beef Vegetable Soup<\/a>.",
        "cuisines": [],
        "dishTypes": [
            "lunch",
            "soup",
            "main course",
            "main dish",
            "dinner"
        ],
        "ingredients": [
            "1\/2 tablespoon butter",
            "1\/2 tablespoon oil",
            "2 pounds beef chuck (or any tougher, stew-worthy cut)",
            "1 quart stock\/broth\/water",
            "4 slices thick-cut, peppered bacon",
            "2 larges sweet potatoes, peel & dice",
            "2 larges parsnips, diced",
            "2 larges carrots, diced",
            "2 larges sticks celery, diced",
            "1 large onion, diced",
            "5 cloves garlic, peel & smash",
            "1\/4 of a red cabbage, sliced thin",
            "1\/4 of a green cabbage, sliced thin",
            "sprigs thyme",
            "sprigs parsley",
            "2 eachs bay leaves",
            "2 quarts stock\/broth\/water",
            "black pepper"
        ]
    }
}