{
    "version": "1.0",
    "lastUpdated": "2025-05-21",
    "recipe": {
        "title": "Apple Roasted Pork Loin",
        "readyInMinutes": 45,
        "servings": 6,
        "image": "https:\/\/img.spoonacular.com\/recipes\/632590-556x370.jpg",
        "sourceUrl": "https:\/\/www.foodista.com\/recipe\/BVKG5VJM\/apple-roasted-pork-loin",
        "instructions": "<p>Apple Roasted Pork Loin<\/p><p>Apples and pork is a pretty traditional combination and I couldn't count the number of ways I've put the two together in the past but this one is a little different. The Granny Smith apples are diced quite small and then cooked in a reduction of honey, apple cider vinegar and spices. Granny Smiths are good to use because they won't break down into apple sauce during the cooking. The cooked apples are then used as a top crust and glaze for the roast pork. Some garlic roast potatoes and steamed veggies completed a wonderful family meal. Here's your Sunday supper!<\/p><p>Lb pork loin or rib roast<\/p><p>Season the pork with salt and pepper and open roast on a rack in a roasting pan at 375 degrees F for about a half hour.<\/p><p>Meanwhile dice very small, (about a 1\/4 inch dice)<\/p><p>Large Granny Smith apples, peeled and cored<\/p><p>In a large saute pan over medium heat add:<\/p><p>Tbsp olive oil<\/p><p>Cloves minced garlic<\/p><p>Cook for a minute or two to soften but not brown the garlic. Add:<\/p><p>Cup honey<\/p><p>Cup apple cider vinegar<\/p><p>Tsp pepper<\/p><p>Tsp sea salt<\/p><p>Teaspoon Chinese five spice powder<\/p><p>Tsp freshly grated nutmeg<\/p><p>Bring the mixture to a boil and simmer until the volume is reduced by about half. Increase the heat to mediun-high. Add the diced apple and cook, stirring occasionally until most of the liquid has reduced off.<\/p><p>After half an hour in the oven, take the roast out and spoon the apples all over the top. Return the roast to the oven, reduce the heat to 350 degrees F and cook uncovered until the internal temperature reaches 170 degrees F on a meat thermomether inserted into the center of the roast. Allow the pork to rest for about 15 minutes before carving and serving.<\/p>",
        "summary": "If you have around <b>45 minutes<\/b> to spend in the kitchen, Apple Roasted Pork Loin might be an outstanding <b>gluten free, dairy free, paleolithic, and primal<\/b> recipe to try. For <b>$3.54 per serving<\/b>, you get a main course that serves 6. One portion of this dish contains around <b>51g of protein<\/b>, <b>17g of fat<\/b>, and a total of <b>512 calories<\/b>. If you have pepper, sea salt, five spice powder, and a few other ingredients on hand, you can make it. Only a few people made this recipe, and 7 would say it hit the spot. It is brought to you by Foodista. Overall, this recipe earns an <b>outstanding spoonacular score of 87%<\/b>. Similar recipes are <a href=\"https:\/\/spoonacular.com\/recipes\/apple-roasted-pork-loin-1626265\">Apple Roasted Pork Loin<\/a>, <a href=\"https:\/\/spoonacular.com\/recipes\/roasted-pork-loin-with-apple-onion-dried-plum-stuffing-45905\">Roasted Pork Loin With Apple, Onion & Dried Plum Stuffing<\/a>, and <a href=\"https:\/\/spoonacular.com\/recipes\/roasted-pork-loin-with-roasted-garlic-vinaigrette-293351\">Roasted Pork Loin with Roasted Garlic Vinaigrette<\/a>.",
        "cuisines": [],
        "dishTypes": [
            "lunch",
            "main course",
            "main dish",
            "dinner"
        ],
        "ingredients": [
            "3 pounds pork loin",
            "3 large Granny Smith apples, peeled and cored",
            "3 tablespoons olive oil",
            "2 cloves minced garlic",
            "1\/2 cup honey",
            "1\/4 cup apple cider vinegar",
            "1\/2 teaspoon pepper",
            "1\/4 teaspoon sea salt",
            "1 teaspoon Chinese five spice powder",
            "1\/2 teaspoon freshly grated nutmeg"
        ]
    }
}