{
    "version": "1.0",
    "lastUpdated": "2025-04-19",
    "recipe": {
        "title": "Beef, Poblano & Cheese Tamales",
        "readyInMinutes": 45,
        "servings": 4,
        "image": "https:\/\/img.spoonacular.com\/recipes\/634727-556x370.jpg",
        "sourceUrl": "https:\/\/www.foodista.com\/recipe\/7QPQK5M4\/beef-poblano-cheese-tamales",
        "instructions": "In a large bowl, allow corn husks to soak in hot water. In a large saucepan, bring 4 cups of water to a boil. Remove any string-like particles from the chili pods. Add them to the boiling water along with half of a packet of Goya seasoning. Cover and let boil for about 20 minutes.\nAfterwards, place chili pods with 2 cups of the stock in a blender to coalesce. Drain the saucepan of the remaining stock and place back on the stove top. Return the heat to medium, and add olive oil once the remaining stock evaporates.\nAdd onion and beef, and immediately begin to break apart the beef. Add 1 packet of Goya seasoning and chili powder, and allow to cook for 5 minutes. Add the chili sauce and cook an additional 5 minutes. Add garlic and 2 teaspoon salt. I added the poblano pepper at this point, but I should have added it with the beef and onion.\nReduce heat to medium-low, and cook for one hour. For the last twenty minutes, partially cover the pan in order to slightly reduce. Most of the liquid should be reduced and thickened.\nIn a large bowl, add instant corn masa mix, water, baking powder, salt, and olive oil to create corn masa mix. The mixture should be spongy.\nWhats surprisingly tricky is assembling the tamales. The best technique Ive found is to thinly spread the tamale masa mix starting from the right-hand side of the corn husks, and leaving about 2 inches on the left-hand side of the husk. When rolling the tamale together, take the right-hand side and fold it onto the rest of the corn husk covered with tamale masa mix. The 1-2 inches left over should roll perfectly over the actual tamale. Dont overstuff the tamales! Id say 2 tablespoon of meat mixture and just a sparse amount of cheese.\nO cook, you should have a double boiler. If you dont, like me, then use a metal colander and place it in a large pot. Place the tamales in the colander (or double boiler) where they are not squished, nor are they loose enough to unravel themselves. While doing this, boil 2 cups of water in the pot or what equates to 1 inch in height of the water.\nOnce water comes to a boil, reduce heat and add the tamales. Place a towel between the colander and lid, and cook for 30 minutes.",
        "summary": "You can never have too many Mexican recipes, so give Beef, Poblano & Cheese Tamales a try. This recipe serves 4 and costs $1.49 per serving. Watching your figure? This gluten free and ketogenic recipe has <b>372 calories<\/b>, <b>21g of protein<\/b>, and <b>30g of fat<\/b> per serving. It works well as a rather inexpensive main course. This recipe from Foodista has 5 fans. Head to the store and pick up poblano pepper, california chili pods, ground beef, and a few other things to make it today. From preparation to the plate, this recipe takes roughly <b>45 minutes<\/b>. Taking all factors into account, this recipe <b>earns a spoonacular score of 53%<\/b>, which is good. <a href=\"https:\/\/spoonacular.com\/recipes\/beef-poblano-cheese-tamales-1443305\">Beef, Poblano & Cheese Tamales<\/a>, <a href=\"https:\/\/spoonacular.com\/recipes\/roasted-poblano-and-cheese-tamales-611384\">Roasted Poblano and Cheese Tamales<\/a>, and <a href=\"https:\/\/spoonacular.com\/recipes\/roasted-poblano-tamales-276566\">Roasted Poblano Tamales<\/a> are very similar to this recipe.",
        "cuisines": [
            "Mexican"
        ],
        "dishTypes": [
            "lunch",
            "main course",
            "main dish",
            "dinner"
        ],
        "ingredients": [
            "20 dried corn husks",
            "6 dried California chili pods, seeded with the ends cut off",
            "1 1\/2 cups ground beef",
            "1 cup mozzarella cheese, shredded",
            "1\/2 1 poblano pepper, diced",
            "4 cloves garlic, minced",
            "2 tablespoons olive oil",
            "1 1\/2 packets Goya seasoning with onion and garlic",
            "2 teaspoons salt",
            "1 teaspoon chili powder"
        ]
    }
}