{
    "version": "1.0",
    "lastUpdated": "2025-11-08",
    "recipe": {
        "title": "How to Make the Best Chicken Jambalaya",
        "readyInMinutes": 55,
        "servings": 8,
        "image": "https:\/\/img.spoonacular.com\/recipes\/715545-556x370.jpg",
        "sourceUrl": "https:\/\/www.pinkwhen.com\/chicken-and-sausage-jambalaya\/",
        "instructions": "Instructions\n\nCombine the creole seasoning ingredients in a small bowl and set aside.\n\nMelt butter in a large dutch oven over medium-high heat.\n\nAdd the sausage until it starts to brown, about 3 minutes.\n\nAdd the chicken and continue to cook until brown, about 3-5 minutes. Stir frequently.\n\nTurn the stove top down to medium heat.\n\nPreheat your oven to 350 degrees.\n\nStir in the seasoning mix of cajun spices and 1\/2 of the chopped onion, celery, green bell pepper, and garlic. Cook until vegetables get tender, about 3-5 minutes. Stir frequently and scrape the bottom of the pot frequently.\n\nStir in the tomato sauce and cook for about one minute.\n\nStir in the remaining onion, celery, bell pepper, garlic, and the diced tomatoes then remove from heat.\n\nStir in the rice and chicken stock, mix the ingredients well.\n\nBake uncovered in the oven at 350 degrees for one hour or until the rice is tender but still has a little crunch.\n\nRemove from the oven, add the bay leaves and stir well.\n\nAllow the dish to cool for five minutes before serving. OPTIONAL: Top with green onions before serving.",
        "summary": "You can never have too many Cajun recipes, so give How to Make the Best Chicken Jambalayan a try. This main course has <b>450 calories<\/b>, <b>26g of protein<\/b>, and <b>21g of fat<\/b> per serving. This recipe serves 8. For <b>$1.86 per serving<\/b>, this recipe <b>covers 20%<\/b> of your daily requirements of vitamins and minerals. This recipe from Pink When requires ▢ butter, ▢ tomatoes, ▢ tomato sauce, and ▢ onion. It is a good option if you're following a <b>gluten free<\/b> diet. Plenty of people made this recipe, and 2169 would say it hit the spot. From preparation to the plate, this recipe takes around <b>55 minutes<\/b>. All things considered, we decided this recipe <b>deserves a spoonacular score of 76%<\/b>. This score is good. If you like this recipe, take a look at these similar recipes: <a href=\"https:\/\/spoonacular.com\/recipes\/how-to-make-the-best-chicken-jambalaya-1695727\">How to Make the Best Chicken Jambalaya<\/a>, <a href=\"https:\/\/spoonacular.com\/recipes\/chicken-jambalaya-1300201\">Chicken Jambalaya<\/a>, and <a href=\"https:\/\/spoonacular.com\/recipes\/chicken-jambalaya-ii-328195\">Chicken Jambalayan II<\/a>.",
        "cuisines": [
            "Cajun",
            "Creole"
        ],
        "dishTypes": [
            "lunch",
            "main course",
            "main dish",
            "dinner"
        ],
        "ingredients": [
            "▢ 2 tbsp unsalted butter",
            "▢ 1 lb sliced sausage",
            "▢ 1 lb boneless skinless chicken breasts cut into bite sized pieces",
            "▢ 1 cup yellow onion chopped",
            "▢ 1 cup celery chopped",
            "▢ 1\/2 cup bell pepper chopped",
            "▢ 1 tbsp minced garlic",
            "▢ 1 cup tomato sauce",
            "▢ 14.5 oz diced tomatoes",
            "▢ 2 1\/2 cups chicken stock",
            "▢ 1 1\/2 cups rice uncooked and rinsed",
            "▢ 2 bay leaves whole",
            "▢ 2 tsp ground black pepper",
            "▢ 1 tsp salt",
            "▢ 1 tsp white pepper",
            "▢ 1 tsp thyme dried",
            "▢ 1 tsp red pepper flakes",
            "▢ 1\/2 tsp sage"
        ]
    }
}