{
    "version": "1.0",
    "lastUpdated": "2025-12-08",
    "recipe": {
        "title": "Chicken Cordon Bleu",
        "readyInMinutes": 45,
        "servings": 6,
        "image": "https:\/\/img.spoonacular.com\/recipes\/638035-556x370.jpg",
        "sourceUrl": "https:\/\/www.foodista.com\/recipe\/KFDCB2XH\/chicken-cordon-bleu",
        "instructions": "<ol><li>Preheat oven to 350 degrees F.<\/li><li>Butterfly the chicken breasts by slicing half lengthwise but not cutting all the way through. Lay the halved breasts between 2 pieces of plastic wrap. Using the flat side of a meat mallet, gently pound the chicken to 1\/4-inch thickness, taking care to not tear or create holes in the meat.<\/li><li>Lay 2 slices of cheese on each breast, followed by 2 slices of ham, and 2 more of cheese; leaving a 1\/2-inch margin on all sides to help seal the roll. Tuck in the sides of the breast and roll up tight like a jellyroll. Squeeze the log gently to seal.<\/li><li>Season the flour with salt and pepper; spread out on waxed paper or in a flat dish. Mix the breadcrumbs with thyme, kosher salt, pepper, and oil. The oil will help the crust brown. Beat together the eggs and water, the mixture should be fluid. Lightly dust the chicken with flour, then dip in the egg mixture. Gently coat in the bread crumbs.<\/li><li>Carefully transfer the roulades to a baking pan and bake for 20 minutes until browned and cooked through.<\/li><li>Serve whole or cut into pinwheels.<\/li><\/ol>",
        "summary": "Chicken Cordon Bleu might be a good recipe to expand your main course repertoire. For <b>$1.81 per serving<\/b>, this recipe <b>covers 24%<\/b> of your daily requirements of vitamins and minerals. This recipe makes 6 servings with <b>417 calories<\/b>, <b>43g of protein<\/b>, and <b>21g of fat<\/b> each. 162 people found this recipe to be delicious and satisfying. This recipe from Foodista requires kosher salt and pepper, eggs, flour, and swiss cheese. From preparation to the plate, this recipe takes approximately <b>45 minutes<\/b>. Overall, this recipe earns an <b>outstanding spoonacular score of 83%<\/b>. If you like this recipe, take a look at these similar recipes: <a href=\"https:\/\/spoonacular.com\/recipes\/chicken-cordon-bleu-38785\">Chicken Cordon Bleu<\/a>, <a href=\"https:\/\/spoonacular.com\/recipes\/chicken-cordon-bleu-355114\">Chicken Cordon Bleu<\/a>, and <a href=\"https:\/\/spoonacular.com\/recipes\/chicken-cordon-bleu-558701\">Chicken Cordon Bleu<\/a>.",
        "cuisines": [],
        "dishTypes": [
            "lunch",
            "main course",
            "main dish",
            "dinner"
        ],
        "ingredients": [
            "6 slices deli ham",
            "2 eggs",
            "1\/4 cup flour",
            "2 teaspoons fresh thyme leaves",
            "kosher salt and freshly ground black pepper",
            "1 teaspoon olive oil",
            "1 cup panko bread crumbs",
            "6 boneless, skinless chicken breasts",
            "12 slices Gruyere or Swiss cheese",
            "2 tsps water"
        ]
    }
}