{
    "version": "1.0",
    "lastUpdated": "2025-04-01",
    "recipe": {
        "title": "Grilled Ginger Miso Chicken",
        "readyInMinutes": 45,
        "servings": 4,
        "image": "https:\/\/img.spoonacular.com\/recipes\/645722-556x370.jpg",
        "sourceUrl": "http:\/\/www.foodista.com\/recipe\/ZHYSF2NB\/grilled-miso-chicken",
        "instructions": "<ol><li>Blend soy sauce, sake, mirin, miso, green onions, ginger root and garlic in a rectangular baking dish. Coat chicken with mixture. Marinate 1 hour or refrigerate overnight, turning several times.<\/li><li>Preheat a hibachi, portable tabletop grill or charcoal grill. Shake marinade off chicken; pat dry. Place skin-down on hot grill. Grill 4 to 5 minutes. Turn chicken; grill second side 4 to 5 minutes or until golden brown and done inside. When chicken is done, sprinkle with sesame seeds and spice mixture.<\/li><li>This recipe yields 4 servings.<\/li><li>Comments: Miso marinade adds a rich flavor to this country-style grilled chicken. Thigh meat stays moist and tender, but boned chicken breasts are delicious, too. The chicken can be sauteed in a skillet.<\/li><\/ol>",
        "summary": "Grilled Ginger Miso Chicken is a <b>gluten free, dairy free, and ketogenic<\/b> recipe with 4 servings. This main course has <b>688 calories<\/b>, <b>50g of protein<\/b>, and <b>49g of fat<\/b> per serving. For <b>$2.12 per serving<\/b>, this recipe <b>covers 24%<\/b> of your daily requirements of vitamins and minerals. If you have green onions, sake, ginger root, and a few other ingredients on hand, you can make it. 5 people were glad they tried this recipe. It is brought to you by Foodista. It will be a hit at your <b>The Fourth Of July<\/b> event. From preparation to the plate, this recipe takes roughly <b>45 minutes<\/b>. All things considered, we decided this recipe <b>deserves a spoonacular score of 59%<\/b>. This score is solid. Users who liked this recipe also liked <a href=\"https:\/\/spoonacular.com\/recipes\/ginger-grilled-chicken-and-radishes-with-miso-scallion-dressing-1648739\">Ginger-Grilled Chicken and Radishes with Miso-Scallion Dressing<\/a>, <a href=\"https:\/\/spoonacular.com\/recipes\/ginger-miso-grilled-asparagus-1304749\">Ginger-Miso Grilled Asparagus<\/a>, and <a href=\"https:\/\/spoonacular.com\/recipes\/grilled-avocados-with-ginger-miso-743666\">Grilled Avocados with Ginger Miso<\/a>.",
        "cuisines": [],
        "dishTypes": [
            "lunch",
            "main course",
            "main dish",
            "dinner"
        ],
        "ingredients": [
            "1 tablespoon five-spice powder (optional)",
            "1 garlic clove minced",
            "1 tablespoon ginger root, minced",
            "2 sliced green onions",
            "2 tablespoons light soy sauce (usukuchi shoyu)",
            "2 tablespoons mirin",
            "2 tablespoons light miso",
            "2 tablespoons sake",
            "8 boned chicken thighs skin intact"
        ]
    }
}