{
    "version": "1.0",
    "lastUpdated": "2025-12-05",
    "recipe": {
        "title": "Lusciously Lemony Lentil Soup",
        "readyInMinutes": 45,
        "servings": 1,
        "image": "https:\/\/img.spoonacular.com\/recipes\/650487-556x370.jpg",
        "sourceUrl": "https:\/\/www.foodista.com\/recipe\/RFKZ88M8\/lusciously-lemony-lentil-soup",
        "instructions": "Heat the olive oil over medium high heat.\nWhen the oil is hot, add your onion and garlic and cook until soft; about 5 minutes.\nStir in the tomato paste, cumin, salt, pepper, and chili powder. Cook until spices are fragrant; about 2 minutes.\nStir in the chicken broth.\nAdd in the carrots and simmer covered on medium low heat until they are soft; about 15 minutes.\nAdd in the lentils and cook until they are heated through (you can also use dried lentils. Just add in with carrots and let simmer for approximately 30 minutes instead of 15 minutes).\nOnce lentils are heated through, blend soup until smooth. This can be done with with either an emulsifier right in the pot or by putting the soup in batches into a blender.\nStir in the lemon juice and cilantro. Season with salt to taste. Enjoy!",
        "summary": "Lusciously Lemony Lentil Soup might be just the main course you are searching for. Watching your figure? This gluten free, dairy free, and ketogenic recipe has <b>971 calories<\/b>, <b>44g of protein<\/b>, and <b>76g of fat<\/b> per serving. This recipe serves 1 and costs $3.0 per serving. 3 people were glad they tried this recipe. It can be enjoyed any time, but it is especially good for <b>Autumn<\/b>. Head to the store and pick up olive oil, broth, carrots, and a few other things to make it today. It is brought to you by Foodista. From preparation to the plate, this recipe takes around <b>45 minutes<\/b>. Overall, this recipe earns a <b>solid spoonacular score of 55%<\/b>. Similar recipes include <a href=\"https:\/\/spoonacular.com\/recipes\/lusciously-lemony-lentil-soup-1403051\">Lusciously Lemony Lentil Soup<\/a>, <a href=\"https:\/\/spoonacular.com\/recipes\/lusciously-lemony-lentil-soup-34095\">Lusciously Lemony Lentil Soup<\/a>, and <a href=\"https:\/\/spoonacular.com\/recipes\/lemony-lentil-soup-992087\">Lemony Lentil Soup<\/a>.",
        "cuisines": [],
        "dishTypes": [
            "soup",
            "lunch",
            "main course",
            "main dish",
            "dinner"
        ],
        "ingredients": [
            "3 tablespoons Olive Oil",
            "1 Large Onion, Chopped",
            "2 cloves Garlic, Minced",
            "1 tablespoon Tomato Paste",
            "1 teaspoon Cumin",
            "1\/4 teaspoon Salt",
            "1\/4 teaspoon Pepper",
            "1\/8 teaspoon Chili Powder",
            "4 cups Broth (Veggie or Chicken)",
            "2 Carrots, Peeled and Chopped",
            "1 Pd Cooked Lentils",
            "2 tablespoons Lemon Juice",
            "3 tablespoons Cilantro",
            "Salt to Taste"
        ]
    }
}