{
    "version": "1.0",
    "lastUpdated": "2025-06-28",
    "recipe": {
        "title": "Beans Hawaiian",
        "readyInMinutes": 45,
        "servings": 8,
        "image": "https:\/\/img.spoonacular.com\/recipes\/634545-556x370.jpg",
        "sourceUrl": "https:\/\/www.foodista.com\/recipe\/FL3QKDTP\/beans-hawaiian",
        "instructions": "Soak dried navy beans overnight in a large pot. You want the water to be cold and about 2-3 inches above the beans. Cover and refrigerate at least 8 hours.\nDrain and rinse the beans. Place in a large pot and cover by 4-5 inches of fresh water. Bring to a boil, reduce heat and simmer for 1  1 hours until the beans are tender but not bursting.\nIn the meantime, combine teriyaki sauce, soy sauce, pineapple juice, brown sugar and ginger in a medium bowl. Whisk until brown sugar has dissolved. Set aside.\nPreheat oven to 350\nReserving 2 cups of the boiled water, drain the beans.\nIn a large Dutch oven, saut bacon for 3-4 minutes over medium high heat. With a slotted spoon remove bacon and set aside.\nAdd onions to the bacon fat and cook until translucent, about 5 minutes. Add garlic and pineapple and saut for an additional minute, until the garlic becomes fragrant.\nPlace bacon back into the dutch oven and add the cubed ham steak, beans, reserved water, and prepared sauce. Stir well to combine.\nBake in the oven covered for 10 minutes. Reduce heat to 200 and continue to cook for 6 hours, stirring halfway through.\nAfter 6 hours, remove lid, increase heat to 350 and cook for an additional 1-2 hours stirring every twenty minutes until the sauce has thickened.",
        "summary": "Beans Hawaiian requires around <b>45 minutes<\/b> from start to finish. This gluten free and dairy free recipe serves 8 and costs <b>$1.79 per serving<\/b>. One portion of this dish contains around <b>30g of protein<\/b>, <b>14g of fat<\/b>, and a total of <b>486 calories<\/b>. This recipe is liked by 6 foodies and cooks. It works well as a main course. Head to the store and pick up navy beans, pineapple, soy sauce, and a few other things to make it today. It is brought to you by Foodista. Taking all factors into account, this recipe <b>earns a spoonacular score of 65%<\/b>, which is solid. Users who liked this recipe also liked <a href=\"https:\/\/spoonacular.com\/recipes\/hawaiian-barbecue-beans-424564\">Hawaiian Barbecue Beans<\/a>, <a href=\"https:\/\/spoonacular.com\/recipes\/green-beans-with-fermented-black-beans-aka-dirty-green-beans-603179\">green beans with fermented black beans ~ aka dirty green beans<\/a>, and <a href=\"https:\/\/spoonacular.com\/recipes\/best-darn-pot-of-beans-ever-homestyle-pinto-beans-with-a-pressure-cooker-option-543037\">Best Darn Pot of Beans EVER - Homestyle Pinto Beans with a Pressure Cooker Option<\/a>.",
        "cuisines": [],
        "dishTypes": [
            "lunch",
            "main course",
            "main dish",
            "dinner"
        ],
        "ingredients": [
            "2 cups dried navy beans",
            "1 ½ cups teriyaki sauce",
            "1 Tbsp. soy sauce",
            "2\/3 cup pineapple juice",
            "½ cup brown sugar",
            "1 Tsp. fresly grated ginger",
            "6 slices thick cut bacon",
            "1 onion, finely diced",
            "1 garlic clove, minced",
            "1 cup fresh pineapple, roughly chopped",
            "16 oz ham steak, cubed"
        ]
    }
}