{
    "version": "1.0",
    "lastUpdated": "2025-06-13",
    "recipe": {
        "title": "Fettuccine With Smashed Peas",
        "readyInMinutes": 45,
        "servings": 8,
        "image": "https:\/\/img.spoonacular.com\/recipes\/642722-556x370.jpg",
        "sourceUrl": "https:\/\/www.foodista.com\/recipe\/R6STXF7C\/fettuccine-with-smashed-peas",
        "instructions": "Cook the pasta according to package directions.\nMeanwhile, pulse the thawed peas in a food processor or blender until chopped (take care not to puree). Add  cup ricotta, salt and pepper to the peas and pulse to mix everything together.\nDrain the pasta and reserve  cup of the cooking water. Put the pasta back in the pot.\nAdd the peas to the cooking water and to the pot and toss together.\nArrange the pasta in a large bowl or platter, and top with the remaining ricotta and sprinkle with the chives.\nDrizzle the olive oil over top. Serve in individual bowls, making sure to distribute the ricotta cheese topping,",
        "summary": "Fettuccine With Smashed Peas is a main course that serves 8. For <b>49 cents per serving<\/b>, this recipe <b>covers 14%<\/b> of your daily requirements of vitamins and minerals. One portion of this dish contains about <b>13g of protein<\/b>, <b>6g of fat<\/b>, and a total of <b>312 calories<\/b>. If you have fettuccine pasta, chives, ricotta cheese, and a few other ingredients on hand, you can make it. Only a few people made this recipe, and 3 would say it hit the spot. From preparation to the plate, this recipe takes approximately <b>45 minutes<\/b>. It is brought to you by Foodista. Overall, this recipe earns a <b>pretty good spoonacular score of 76%<\/b>. Similar recipes are <a href=\"https:\/\/spoonacular.com\/recipes\/pasta-with-smashed-peas-18151\">Pasta with Smashed Peas<\/a>, <a href=\"https:\/\/spoonacular.com\/recipes\/smashed-peas-and-ricotta-cheese-318639\">Smashed Peas and Ricotta Cheese<\/a>, and <a href=\"https:\/\/spoonacular.com\/recipes\/pasta-with-smashed-peas-and-ricotta-18657\">Pasta With Smashed Peas And Ricotta<\/a>.",
        "cuisines": [],
        "dishTypes": [
            "side dish",
            "lunch",
            "main course",
            "main dish",
            "dinner"
        ],
        "ingredients": [
            "1 pound fettuccine pasta",
            "1 16 ounce package frozen peas, thawed",
            "3\/4 cup ricotta cheese",
            "1 1\/4 teaspoons coarse salt",
            "1\/4 teaspoon black pepper",
            "1 tablespoon chopped fresh chives",
            "1 tablespoon extra-virgin olive oil"
        ]
    }
}