{
    "version": "1.0",
    "lastUpdated": "2025-10-05",
    "recipe": {
        "title": "Frittata with Mushrooms, Thyme, and Parmigiano Cheese",
        "readyInMinutes": 45,
        "servings": 8,
        "image": "https:\/\/img.spoonacular.com\/recipes\/643859-556x370.jpg",
        "sourceUrl": "https:\/\/www.foodista.com\/recipe\/ZPHDGMDB\/frittata-with-mushrooms-thyme-and-parmigiano-cheese",
        "instructions": "<ol><li>Pre-heat oven on to 350 degrees (later you'll change it to \"Broil\").<\/li><li>Heat an 8-inch ovenproof skillet over medium-high heat.<\/li><li>Coat pan with cooking spray or butter.<\/li><li>Add mushrooms and green onions to pan; saut 12 minutes or until mushrooms are nicely browned.<\/li><li>In a medium bowl, add the eggs and egg replacement.<\/li><li>Add the half and half.<\/li><li>Add the Parmesan cheese.<\/li><li>Add the thyme and any additional herbs that you like.<\/li><li>Add salt and pepper and whisk everything together.<\/li><li>Pour the egg\/cheese mixture into the same pan with the sauteed mushrooms and green onions.<\/li><li>Heat pan over medium heat.<\/li><li>Cook, covered, for about 6 minutes or when it is just a little bit liquid-y\/runny on the top.<\/li><li>At that point, place the pan into the oven and cook on 350 for another 5 - 10 minutes.<\/li><li>Once the frittata is completely set and cooked (not runny on top) change the oven temperature to \"Broil\".<\/li><li>Place the pan on the lowest rack of the oven and broil for about 2 minutes or until a golden brown color forms on the top.<\/li><\/ol>",
        "summary": "If you want to add more <b>gluten free<\/b> recipes to your recipe box, Frittata with Mushrooms, Thyme, and Parmigiano Cheese might be a recipe you should try. This recipe serves 8. For <b>$1.04 per serving<\/b>, this recipe <b>covers 15%<\/b> of your daily requirements of vitamins and minerals. One serving contains <b>190 calories<\/b>, <b>21g of protein<\/b>, and <b>8g of fat<\/b>. A few people made this recipe, and 59 would say it hit the spot. If you have parmigiano cheese, eggs, green onions, and a few other ingredients on hand, you can make it. It works best as a main course, and is done in about <b>45 minutes<\/b>. It is brought to you by Foodista. Overall, this recipe earns a <b>solid spoonacular score of 59%<\/b>. If you like this recipe, you might also like recipes such as <a href=\"https:\/\/spoonacular.com\/recipes\/mushrooms-parmigiano-cheese-and-courgettes-8905\">Mushrooms, Parmigiano Cheese And Courgettes<\/a>, <a href=\"https:\/\/spoonacular.com\/recipes\/asparagus-frittata-with-smoked-paprika-thyme-feta-cheese-584610\">Asparagus Frittata with Smoked Paprika, Thyme & Feta Cheese<\/a>, and <a href=\"https:\/\/spoonacular.com\/recipes\/creamy-baked-leeks-with-garlic-thyme-and-parmigiano-39090\">Creamy Baked Leeks With Garlic, Thyme, And Parmigiano<\/a>.",
        "cuisines": [],
        "dishTypes": [
            "lunch",
            "main course",
            "morning meal",
            "brunch",
            "main dish",
            "breakfast",
            "dinner"
        ],
        "ingredients": [
            "3\/4 cup egg replacement",
            "3 jumbo eggs",
            "16 ounces fresh mushrooms (of your choice), wiped clean, stems trimmed, sliced",
            "1 1\/2 tablespoons chopped, fresh thyme leaves",
            "6 green onions, sliced",
            "fresh ground black pepper to taste",
            "1\/4 cup half and half (or you can use whole milk)",
            "1\/2 cup Parmigiano cheese, fresh and finely grated",
            "salt"
        ]
    }
}