{
    "version": "1.0",
    "lastUpdated": "2025-12-16",
    "recipe": {
        "title": "Caramelized Tofu & Gala Apple Salad",
        "readyInMinutes": 45,
        "servings": 2,
        "image": "https:\/\/img.spoonacular.com\/recipes\/637067-556x370.jpg",
        "sourceUrl": "https:\/\/www.foodista.com\/recipe\/SRNHDHGT\/caramelized-tofu-gala-apple-salad",
        "instructions": "<ol><li>First thing of action: bake your tofu. Preheat the oven to 350F. Let tofu sit on a kitchen towel for 15 minutes, turning once, to absorb moisture. Cut tofu into 1 inch cubes. Brush them lightly with vegetable oil (I always use olive oil, but I am certain that this recipe would be best with a peanut oil). Place them on a baking sheet and bake for 35 minutes, turning once.<\/li><li>In a small pan, heat butter and garlic on low until the butter has just almost melted. Add the apples, tofu, and salt. Bring heat up to medium, and cook for about 4 minutes. At this point you should add the water and stir every minute for the next 6-7 additional minutes, or until there is little moisture left in the pan. Turn off the heat, and add the brown sugar. Stir to incorporate all of the sugar. Place on top of salad lettuce.<\/li><\/ol>",
        "summary": "Caramelized Tofu & Galan Apple Salad is a main course that serves 2. For <b>$2.31 per serving<\/b>, this recipe <b>covers 15%<\/b> of your daily requirements of vitamins and minerals. One serving contains <b>380 calories<\/b>, <b>20g of protein<\/b>, and <b>21g of fat<\/b>. 13 people were glad they tried this recipe. It is brought to you by Foodista. From preparation to the plate, this recipe takes around <b>45 minutes<\/b>. If you have galan apple, butter, wholes pecans, and a few other ingredients on hand, you can make it. It is a good option if you're following a <b>gluten free and lacto ovo vegetarian<\/b> diet. Overall, this recipe earns a <b>solid spoonacular score of 49%<\/b>. If you like this recipe, you might also like recipes such as <a href=\"https:\/\/spoonacular.com\/recipes\/gala-apple-cider-47795\">Galan Apple Cider<\/a>, <a href=\"https:\/\/spoonacular.com\/recipes\/roasted-pumpkin-gala-apple-garam-masala-soup-556663\">Roasted Pumpkin, Galan Apple & Garam Masala Soup<\/a>, and <a href=\"https:\/\/spoonacular.com\/recipes\/gala-crab-salad-403702\">Gala Crab Salad<\/a>.",
        "cuisines": [],
        "dishTypes": [
            "side dish",
            "lunch",
            "main course",
            "salad",
            "main dish",
            "dinner"
        ],
        "ingredients": [
            "2 tablespoons brown sugar",
            "1 tablespoon butter",
            "14 ounces extra-firm tofu, baked",
            "1 gala apple, peeled and diced",
            "2 cloves garlic, minced",
            "3 cups green leaf lettuce (I am using baby",
            "12 wholes raw pecans",
            "1\/4 cup water"
        ]
    }
}