{
    "version": "1.0",
    "lastUpdated": "2025-08-06",
    "recipe": {
        "title": "Spinach and Gorgonzola Stuffed Flank Steak",
        "readyInMinutes": 45,
        "servings": 4,
        "image": "https:\/\/img.spoonacular.com\/recipes\/661259-556x370.jpg",
        "sourceUrl": "https:\/\/www.foodista.com\/recipe\/SWTFLZXM\/spinach-and-gorgonzola-stuffed-flank-steak",
        "instructions": "Preheat oven to 375.\nButterfly the steak by using a long sharp knife holding it parallel to the work surface, cut through the long side of the steak, stopping about  inch from the opposite side. If the steak is already thin, just pound it with a mallet to  inch thick.\nIn a large skillet over medium heat add 1 tablespoon olive oil and saut` the shallots until soft, 2 minutes. Add the spinach and cook until just wilted, about 2 to 3 minutes. Transfer to a colander.\nWhen cool enough to handle, squeeze out all the moisture from the spinach and transfer to a medium bowl. Stir in the bread crumbs and cheese. Season with salt and pepper.\nPlace the steak on a sheet of plastic wrap. Smear the spinach mixture evenly over the steak, leaving about 1 inch border along the side edge. Beginning with the side near you and using the plastic wrap as an aid, rollup the steak, gently pressing on the filling.\nTie the rolled steak with twine at 2-3 inch interval.\nSeason the outside with salt and pepper.\nHeat the remaining 2 tablespoons olive oil in a large ovenproof skillet over medium high heat. Sear the roast on all sided, about 2 minutes per side.\nPlace in the oven and roast for 20 to 25 minutes.\nTransfer to a cutting board, tend with aluminum foil and allow resting for 10 minutes.\nTo serve, remove the twine from the roast and cut into  inch to 1 inch thick slices.",
        "summary": "Spinach and Gorgonzola Stuffed Flank Steak might be just the main course you are searching for. For <b>$4.27 per serving<\/b>, this recipe <b>covers 39%<\/b> of your daily requirements of vitamins and minerals. One portion of this dish contains approximately <b>47g of protein<\/b>, <b>28g of fat<\/b>, and a total of <b>523 calories<\/b>. This recipe serves 4. 9 people found this recipe to be tasty and satisfying. It is perfect for <b>valentin day<\/b>. If you have gorgonzola, olive oil, shallot, and a few other ingredients on hand, you can make it. From preparation to the plate, this recipe takes roughly <b>45 minutes<\/b>. It is brought to you by Foodista. Taking all factors into account, this recipe <b>earns a spoonacular score of 95%<\/b>, which is super. If you like this recipe, you might also like recipes such as <a href=\"https:\/\/spoonacular.com\/recipes\/bruce-aidells-spinach-and-gorgonzola-stuffed-flank-steak-202812\">Bruce Aidells' Spinach and Gorgonzola-Stuffed Flank Steak<\/a>, <a href=\"https:\/\/spoonacular.com\/recipes\/spinach-stuffed-flank-steak-19875\">Spinach-stuffed Flank Steak<\/a>, and <a href=\"https:\/\/spoonacular.com\/recipes\/spinach-and-carrot-stuffed-flank-steak-156209\">Spinach and Carrot Stuffed Flank Steak<\/a>.",
        "cuisines": [],
        "dishTypes": [
            "lunch",
            "main course",
            "main dish",
            "dinner"
        ],
        "ingredients": [
            "1 1 ½ to 2 pounds flank steak trimmed",
            "3 tablespoon olive oil",
            "1 shallot finely chopped",
            "½ pound spinach, washed, stemmed and chopped",
            "¾ cup fresh bread crumbs",
            "¼ pound Gorgonzola or other blue cheese, crumbled",
            "Salt and pepper"
        ]
    }
}