{
    "version": "1.0",
    "lastUpdated": "2025-03-27",
    "recipe": {
        "title": "No Fuss Sunday Slow-Cooker Balsamic Pot Roast",
        "readyInMinutes": 45,
        "servings": 4,
        "image": "https:\/\/img.spoonacular.com\/recipes\/653162-556x370.jpg",
        "sourceUrl": "https:\/\/www.foodista.com\/recipe\/PRVZVFHW\/no-fuss-sunday-slow-cooker-balsamic-pot-roast",
        "instructions": "Place onions in slow cooker. (I used half of a red onion and half of white because I had them and they needed to be used)\nPlace roast on top of onions.\nSeason meat with salt and pepper.\nIn a small bowl whisk together broth, vinegar, tomato paste, tapioca, garlic and Italian seasoning.\nPour mixture over meat.\nSet cooker on low and cook for 8-10 hours. If youre short on time set cooker to high and cook 4-5 hours.\nLet cook without disturbing or checking on it; Every time you open the lid it lets all that precious hot air out. I was bummed to come home and find that my lid somehow and fallen in and created a constant leak. But it all worked out just fine in the end.\nOnce roast is cooked and is tender to the point of falling apart transfer to serving dish.\nUse juice and onions in crockpot as gravy. Transfer liquid to a gravy boat.\nPlate it up\nENJOY!!!",
        "summary": "The recipe No Fuss Sunday Slow-Cooker Balsamic Pot Roast can be made <b>in roughly 45 minutes<\/b>. Watching your figure? This gluten free, dairy free, paleolithic, and primal recipe has <b>568 calories<\/b>, <b>56g of protein<\/b>, and <b>33g of fat<\/b> per serving. For <b>$3.29 per serving<\/b>, you get a main course that serves 4. 5 people were impressed by this recipe. A mixture of beef chuck roast, onion, salt and pepper, and a handful of other ingredients are all it takes to make this recipe so scrumptious. It is brought to you by Foodista. All things considered, we decided this recipe <b>deserves a spoonacular score of 76%<\/b>. This score is pretty good. If you like this recipe, take a look at these similar recipes: <a href=\"https:\/\/spoonacular.com\/recipes\/no-fuss-sunday-slow-cooker-balsamic-pot-roast-1399135\">No Fuss Sunday Slow-Cooker Balsamic Pot Roast<\/a>, <a href=\"https:\/\/spoonacular.com\/recipes\/sunday-slow-cooker-pot-roast-and-potatoes-1228061\">Sunday Slow Cooker: Pot Roast and Potatoes<\/a>, and <a href=\"https:\/\/spoonacular.com\/recipes\/sunday-slow-cooker-pot-roast-and-potatoes-510515\">Sunday Slow Cooker: Pot Roast and Potatoes<\/a>.",
        "cuisines": [],
        "dishTypes": [
            "lunch",
            "main course",
            "main dish",
            "dinner"
        ],
        "ingredients": [
            "1 2-2 ½ Lb. Boneless Beef Chuck Roast",
            "1 Large Onion – Roughly chopped",
            "1 cup Low Sodium Beef Broth",
            "3 Tbsp. Balsamic Vinegar",
            "2 Tbsp. Tomato Paste",
            "2 Tbsp. Quick Cooking Tapioca",
            "3 Large Garlic Cloves-Minced",
            "1 tsp. Italian Seasoning- Store bought or Homemade",
            "Salt and Pepper to taste"
        ]
    }
}