{
    "version": "1.0",
    "lastUpdated": "2025-11-25",
    "recipe": {
        "title": "Farfalle with fresh tomatoes, basil and mozzarella",
        "readyInMinutes": 15,
        "servings": 4,
        "image": "https:\/\/img.spoonacular.com\/recipes\/642585-556x370.jpg",
        "sourceUrl": "https:\/\/www.foodista.com\/recipe\/B6CC3QXM\/farfalle-with-fresh-tomatoes-basil-and-mozzarella",
        "instructions": "<ol><li>Boil a large pot of salted water and cook the pasta according to the package directions. When done drain, place back in the cooking pan and add the butter.<\/li><li>In a large skillet saut the tomatoes with the olive oil, 5 minutes. Remove from the heat and add the basil.<\/li><li>In a large bowl add the pasta, the tomatoes and mix well. Add the mozzarella and give it a last light folding.<\/li><li>Serve immediately<\/li><\/ol>",
        "summary": "Need a <b>lacto ovo vegetarian main course<\/b>? Farfalle with fresh tomatoes, basil and mozzarella could be a tremendous recipe to try. For <b>97 cents per serving<\/b>, this recipe <b>covers 19%<\/b> of your daily requirements of vitamins and minerals. This recipe serves 4. One serving contains <b>557 calories<\/b>, <b>16g of protein<\/b>, and <b>15g of fat<\/b>. 7 people were glad they tried this recipe. Head to the store and pick up butter, basil leaves, tomatoes, and a few other things to make it today. It is brought to you by Foodista. From preparation to the plate, this recipe takes approximately <b>15 minutes<\/b>. Overall, this recipe earns a <b>good spoonacular score of 70%<\/b>. Similar recipes are <a href=\"https:\/\/spoonacular.com\/recipes\/orecchiette-with-tomatoes-fresh-mozzarella-and-basil-200966\">Orecchiette with Tomatoes, Fresh Mozzarella, and Basil<\/a>, <a href=\"https:\/\/spoonacular.com\/recipes\/tomatoes-stuffed-with-fresh-mozzarella-and-basil-153809\">Tomatoes Stuffed with Fresh Mozzarellan and Basil<\/a>, and <a href=\"https:\/\/spoonacular.com\/recipes\/risotto-with-fresh-mozzarella-grape-tomatoes-and-basil-116890\">Risotto With Fresh Mozzarella, Grape Tomatoes, and Basil<\/a>.",
        "cuisines": [],
        "dishTypes": [
            "side dish",
            "lunch",
            "main course",
            "main dish",
            "dinner"
        ],
        "ingredients": [
            "1 pound of Farfalle pasta by Barilla",
            "24 medium fresh basil leaves",
            "2 large mozzarella, diced",
            "2 tbsp olive oil",
            "Salt and pepper",
            "4 tomatoes, halved, seeded and cut in small pieces ½ inch dice (3 cups)",
            "2 tablespoons unsalted butter"
        ]
    }
}