{
    "version": "1.0",
    "lastUpdated": "2025-03-25",
    "recipe": {
        "title": "Vegetarian Tostadas With Spicy Black Beans (+gluten free)",
        "readyInMinutes": 45,
        "servings": 4,
        "image": "https:\/\/img.spoonacular.com\/recipes\/664726-556x370.jpg",
        "sourceUrl": "https:\/\/www.foodista.com\/recipe\/4BFBKDRM\/vegetarian-tostadas-gluten-free",
        "instructions": "Heat a large saute pan on medium high heat. Saute your onions and garlic in olive oil for 2-3 minutes.\nPlace your balck beans (BB) in a microwavble safe container and add the sauted onions and garilc to the BB.\nAdd the diced chiles in adobo sauce to the BB.  Sprinkle in some dried basil and garilc sea salt. Stir and microwave for 2 minutes, using a potato masher mash the warm BB to your desired consistency and return to the microwave for 1 minute.\nMeanwhile take a paper towel and using the same saute pan wipe out any excess oil or browning from the onions. Spray with cooking oil and on high heat, toast your tortillas until crsipy anywhere from 5 to 10 minutes.\nAssemble your tostadas by placing the beans on top, sprinkle with feta, top with spinach, sliced cherry tomatoes, dollop of sour cream and sprinkle with more feta and salsa",
        "summary": "If you want to add more <b>gluten free and lacto ovo vegetarian<\/b> recipes to your recipe box, Vegetarian Tostadas With Spicy Black Beans (+gluten free) might be a recipe you should try. For <b>$1.67 per serving<\/b>, you get a hor d'oeuvre that serves 4. One portion of this dish contains about <b>14g of protein<\/b>, <b>12g of fat<\/b>, and a total of <b>296 calories<\/b>. From preparation to the plate, this recipe takes around <b>45 minutes<\/b>. 3 people were glad they tried this recipe. A mixture of chiles in adobo sauce, cherry tomatoes, feta cheese, and a handful of other ingredients are all it takes to make this recipe so tasty. It is an <b>affordable<\/b> recipe for fans of Mexican food. It is brought to you by Foodista. All things considered, we decided this recipe <b>deserves a spoonacular score of 75%<\/b>. This score is solid. Users who liked this recipe also liked <a href=\"https:\/\/spoonacular.com\/recipes\/vegetarian-tostadas-with-spicy-black-beans-gluten-free-1407645\">Vegetarian Tostadas With Spicy Black Beans (+gluten free)<\/a>, <a href=\"https:\/\/spoonacular.com\/recipes\/gluten-free-cashew-chicken-spicy-vegetarian-nut-free-soy-free-options-1101262\">Gluten Free Cashew Chicken (Spicy, Vegetarian, Nut-Free, & Soy-Free Options)<\/a>, and <a href=\"https:\/\/spoonacular.com\/recipes\/gluten-free-chicken-black-beans-and-rice-486032\">Gluten Free Chicken Black Beans and Rice<\/a>.",
        "cuisines": [
            "Mexican"
        ],
        "dishTypes": [
            "antipasti",
            "lunch",
            "main course",
            "starter",
            "snack",
            "appetizer",
            "main dish",
            "antipasto",
            "hor d'oeuvre",
            "dinner"
        ],
        "ingredients": [
            "4 White or Yellow Corn Tortillas",
            "1 15oz can of Black Beans (drained)",
            "1\/4 cup onions diced",
            "1 clove Garlic minced",
            "1\/2 tablespoon Olive Oil",
            "1-3 Chiles in Adobo Sauce (diced)",
            "1 1\/2 cup Spinach (sliced julienne style)",
            "Spinkle of dried basil and garlic sea salt (for black beans)",
            "8 Cherry Tomatoes (halved)",
            "Feta Cheese",
            "Sour Cream",
            "your favorite salsa"
        ]
    }
}