{
    "version": "1.0",
    "lastUpdated": "2026-01-29",
    "recipe": {
        "title": "Bacalhau Macau",
        "readyInMinutes": 45,
        "servings": 4,
        "image": "https:\/\/img.spoonacular.com\/recipes\/633251-556x370.jpg",
        "sourceUrl": "https:\/\/www.foodista.com\/recipe\/888LJBPK\/bacalhau-macau",
        "instructions": "<ol><li>Place cod in a bowl and cover with cold water. Soak for 6 to 8 hours, changing the water once or twice. Drain, rinse very well and pat dry. Shred fish with your fingers.<\/li><li>Pour 3 inches of water into a medium saucepan and bring to a boil. Add the diced potatoes, and cook until tender, 10 to 12 minutes. Drain the potatoes, return them to the pan briefly. (The heat from the pan will evaporate excess moisture from the potatoes.) Mash the potatoes until smooth, then whisk in the butter.<\/li><li>Stir the cod into the mashed potatoes. Stir in the green onion, cilantro, olives, egg white, sesame oil, salt, garlic, ginger and pepper.<\/li><li>In a chilled bowl, whip the cream until it holds soft peaks. Gently fold the whipped cream into cod mixture with a rubber spatula.<\/li><li>Using two large soupspoons, form about 3 tablespoons of the cod-potato mixture into an oval fish cake. Set the cod cake on a baking sheet and repeat with the remaining potato mixture.<\/li><li>Spread the breadcrumbs on a plate. Beat the egg in a wide, shallow bowl. Dip each cod cake into egg, turning it gently to coat all sides. Allow any excess egg to drip back into the bowl, then roll the cake in breadcrumbs to coat all sides. Set the coated fish cakes on a baking sheet.<\/li><li>Place a large skillet over medium heat and pour in 1\/4 inch of vegetable oil. When the oil is hot - a corner of a cod cake will give off a lively sizzle when dipped in the oil - add as many of the fish cakes to the skillet as will fit without touching each other. (You may need to do this in two batches.) Cook, turning once, until golden brown, about 5 to 7 minutes.<\/li><li>Remove the fish cakes with a slotted spoon and drain them on paper towels. If necessary, repeat with the remaining cod cakes. Serve warm.<\/li><li>This recipe yields 4 servings.<\/li><\/ol>",
        "summary": "Bacalhau Macau could be just the <b>pescatarian<\/b> recipe you've been looking for. This recipe makes 4 servings with <b>337 calories<\/b>, <b>17g of protein<\/b>, and <b>17g of fat<\/b> each. For <b>$1.69 per serving<\/b>, this recipe <b>covers 14%<\/b> of your daily requirements of vitamins and minerals. Not a lot of people made this recipe, and 9 would say it hit the spot. If you have sesame oil, butter, salt, and a few other ingredients on hand, you can make it. It works well as a main course. From preparation to the plate, this recipe takes around <b>45 minutes<\/b>. It is brought to you by Foodista. Overall, this recipe earns a <b>good spoonacular score of 76%<\/b>. <a href=\"https:\/\/spoonacular.com\/recipes\/chinese-macau-style-mung-bean-almond-cookies-1167105\">Chinese Macau-Style Mung Bean Almond Cookies<\/a>, <a href=\"https:\/\/spoonacular.com\/recipes\/lechon-kawali-stew-aka-lechon-macau-520873\">Lechon kawali stew (a.k.a. Lechon Macau)<\/a>, and <a href=\"https:\/\/spoonacular.com\/recipes\/bacalhau-a-braz-2333\">Bacalhau A Braz<\/a> are very similar to this recipe.",
        "cuisines": [],
        "dishTypes": [
            "lunch",
            "main course",
            "main dish",
            "dinner"
        ],
        "ingredients": [
            "1 cup Japanese breadcrumbs (panko)",
            "1 teaspoon melted butter",
            "1\/4 cup minced cilantro",
            "1 Egg",
            "1 egg white",
            "1 1\/2 teaspoons minced garlic",
            "1 teaspoon grated ginger",
            "1\/4 cup chopped green onion",
            "3\/4 pound russet [Idaho] potato - (abt 2) peeled, and",
            "1\/4 cup chopped pitted oil-cured olives",
            "1 tsp of salt",
            "1\/2 pound salt cod fillets",
            "2 teaspoons sesame oil",
            "1\/2 cup whipping cream",
            "1\/4 teaspoon freshly-ground white pepper"
        ]
    }
}