{
    "version": "1.0",
    "lastUpdated": "2025-11-13",
    "recipe": {
        "title": "Bulgur Pilaf With Green Lentils, Served With Caramelized Onions -Mercimekli Bulgur Pilavi",
        "readyInMinutes": 35,
        "servings": 1,
        "image": "https:\/\/img.spoonacular.com\/recipes\/636436-556x370.jpg",
        "sourceUrl": "http:\/\/www.foodista.com\/recipe\/7K4XPZ2Q\/bulgur-pilaf-with-green-lentils-served-with-caramelized-onions-mercimekli-bulgur-pilavi",
        "instructions": "<ol><li>Boil the green lentils in a heavy pan with plenty of hot water for about 15 minutes. Drain the water and set the green lentils aside.<\/li><li>Combine the half cooked green lentils and rinsed the bulgur wheat in a heavy pan. Pour in the hot water and olive oil. Season with salt and pepper to taste and stir to combine thoroughly. Bring to boil for 1-2 minutes, and then reduce the heat. Cover and simmer until all the liquid has been completely absorbed (about 15 minutes).<\/li><li>While the pilaf is cooking, heat the olive oil in a pan and stir in the onion slices. Over a medium heat, cook the onion slices for about 10-15 minutes until they start to get caramelized, stir occasionally. Season with salt and pepper to taste.<\/li><li>Serve the bulgur and green lentils pilaf with the caramelized onion slices over the top. Spicy pickled peppers or a green salad with a sharp lemon juice and olive oil dressing would go really well with the pilaf.<\/li><li>Afiyet Olsun!<\/li><\/ol>",
        "summary": "Bulgur Pilaf With Green Lentils, Served With Caramelized Onions -Mercimekli Bulgur Pilavi might be just the main course you are searching for. Watching your figure? This dairy free, lacto ovo vegetarian, and vegan recipe has <b>18932 calories<\/b>, <b>94g of protein<\/b>, and <b>1932g of fat<\/b> per serving. For <b>$25.0 per serving<\/b>, this recipe <b>covers 71%<\/b> of your daily requirements of vitamins and minerals. This recipe serves 1. A mixture of onion, preparation time: minutes cooking time: minutes, gr\/8oz\/ green lentils, and a handful of other ingredients are all it takes to make this recipe so flavorful. From preparation to the plate, this recipe takes roughly <b>35 minutes<\/b>. This recipe from Foodista has 3 fans. Overall, this recipe earns a <b>great spoonacular score of 86%<\/b>. Similar recipes include <a href=\"https:\/\/spoonacular.com\/recipes\/lentils-and-bulgur-wheat-with-caramelized-onions-482485\">Lentils and Bulgur Wheat with Caramelized Onions<\/a>, <a href=\"https:\/\/spoonacular.com\/recipes\/lentils-and-bulgur-wheat-with-caramelized-onions-1535631\">Lentils and Bulgur Wheat with Caramelized Onions<\/a>, and <a href=\"https:\/\/spoonacular.com\/recipes\/bulgur-wheat-pilaf-with-green-lentils-1081576\">Bulgur Wheat Pilaf with Green Lentils<\/a>.",
        "cuisines": [],
        "dishTypes": [
            "side dish",
            "lunch",
            "main course",
            "main dish",
            "dinner"
        ],
        "ingredients": [
            "350 bulgur wheat, rinsed",
            "Preparation time: minutes Cooking time: 35 minutes",
            "1 cup 225 gr\/8oz\/ green lentils",
            "Salt and ground black pepper to taste",
            "45 3 tablespoons mild olive oil",
            "1 small onion",
            "Pickled green and red peppers"
        ]
    }
}