{
    "version": "1.0",
    "lastUpdated": "2025-09-11",
    "recipe": {
        "title": "Classic French Mussels",
        "readyInMinutes": 45,
        "servings": 2,
        "image": "https:\/\/img.spoonacular.com\/recipes\/639599-556x370.jpg",
        "sourceUrl": "https:\/\/www.foodista.com\/recipe\/X2W746Q6\/classic-french-mussels-done-light",
        "instructions": "<ol><li>Scrub mussels with a stiff brush, discard any that are open and stay that way even when you close the shell. Discard any with broken shells.<\/li><li>Soak them in cool clean water for at least an hour. Mussels are alive and breathing and have taken in sand over time. This allows them to expel the sand.<\/li><li>Mussels have a small fibrous \"beard\" that should be removed. Pull it out toward the hinge of the shell to keep from injuring the mussel.<\/li><li>Heat the olive oil in a large pot over medium-high heat. Add the shallots and garlic and cook until soft, about 5 minutes. Add the mussels, wine, buttermilk, butter, and parsley and season well with the kosher salt. Give it a good stir, cover the pot, and cook until mussels open and are cooked through, 10 to 15 minutes. Divide the mussels and the juices between 2 bowls and serve with a crusty whole-grain bread to sop up that wonderful sauce.<\/li><\/ol>",
        "summary": "You can never have too many hor d'oeuvre recipes, so give Classic French Mussels a try. This recipe serves 2 and costs $2.93 per serving. Watching your figure? This gluten free, primal, and pescatarian recipe has <b>501 calories<\/b>, <b>32g of protein<\/b>, and <b>28g of fat<\/b> per serving. From preparation to the plate, this recipe takes about <b>45 minutes<\/b>. 2 people have made this recipe and would make it again. It is brought to you by Foodista. It is a <b>reasonably priced<\/b> recipe for fans of Mediterranean food. If you have buttermilk, parsley, butter, and a few other ingredients on hand, you can make it. All things considered, we decided this recipe <b>deserves a spoonacular score of 72%<\/b>. This score is solid. Similar recipes include <a href=\"https:\/\/spoonacular.com\/recipes\/classic-french-mussels-738888\">Classic French Mussels<\/a>, <a href=\"https:\/\/spoonacular.com\/recipes\/french-country-mussels-138579\">French Country Mussels<\/a>, and <a href=\"https:\/\/spoonacular.com\/recipes\/french-steamed-mussels-1180539\">French Steamed Mussels<\/a>.",
        "cuisines": [
            "Mediterranean",
            "French",
            "European"
        ],
        "dishTypes": [
            "antipasti",
            "lunch",
            "main course",
            "starter",
            "snack",
            "appetizer",
            "main dish",
            "antipasto",
            "hor d'oeuvre",
            "dinner"
        ],
        "ingredients": [
            "1\/2 cup dry white wine",
            "3 sprigs fresh parsley",
            "4 garlic cloves, finely chopped",
            "Kosher salt",
            "1\/2 cup low-fat buttermilk",
            "2 pounds mussels, cleaned",
            "1 Tbs olive oil",
            "2 shallots, finely chopped",
            "4 tablespoons unsalted light butter, cut into pieces"
        ]
    }
}