{
    "version": "1.0",
    "lastUpdated": "2025-04-18",
    "recipe": {
        "title": "Steak With Blue Cheese Sherry Sauce",
        "readyInMinutes": 45,
        "servings": 2,
        "image": "https:\/\/img.spoonacular.com\/recipes\/661522-556x370.jpg",
        "sourceUrl": "https:\/\/www.foodista.com\/recipe\/J8RVH7KB\/steak-with-blue-cheese-sherry-sauce",
        "instructions": "<ol><li>Prepare the Steaks:<\/li><li>Cut steak in half. With a meat tenderizer or textured mallet pound steaks to about 1\/4-inch thick. Set aside and make the sauce before grilling.<\/li><li>Prepare the Sauce:<\/li><li>Combine Sherry and oil in a small sauce pan. Bring to a boil and cook until the alcohol has burned off.<\/li><li>Reduce heat to a low simmer and add the blue cheese; whisk until creamy. Remove from heat and grill steaks.<\/li><li>Grill Steaks:<\/li><li>Brush steaks with olive oil and grill 1 minute - 90 seconds on each side.<\/li><li>Warm up sauce and add chopped parsley. Pour sauce over steaks and serve.<\/li><\/ol>",
        "summary": "Steak With Blue Cheese Sherry Sauce is a <b>gluten free<\/b> main course. This recipe makes 2 servings with <b>368 calories<\/b>, <b>37g of protein<\/b>, and <b>22g of fat<\/b> each. For <b>$1.76 per serving<\/b>, this recipe <b>covers 20%<\/b> of your daily requirements of vitamins and minerals. <b>valentin day<\/b> will be even more special with this recipe. A mixture of top round, sherry, parsley, and a handful of other ingredients are all it takes to make this recipe so scrumptious. 2 people were impressed by this recipe. From preparation to the plate, this recipe takes approximately <b>45 minutes<\/b>. It is brought to you by Foodista. Overall, this recipe earns a <b>super spoonacular score of 80%<\/b>. Similar recipes are <a href=\"https:\/\/spoonacular.com\/recipes\/steak-with-brandied-blue-cheese-sauce-271193\">Steak with Brandied Blue Cheese Sauce<\/a>, <a href=\"https:\/\/spoonacular.com\/recipes\/marinated-flank-steak-with-blue-cheese-sauce-300485\">Marinated Flank Steak with Blue Cheese Sauce<\/a>, and <a href=\"https:\/\/spoonacular.com\/recipes\/grilled-steak-and-mushroom-kabobs-with-blue-cheese-sauce-906389\">Grilled Steak and Mushroom Kabobs with Blue Cheese Sauce<\/a>.",
        "cuisines": [],
        "dishTypes": [
            "lunch",
            "main course",
            "main dish",
            "dinner"
        ],
        "ingredients": [
            "3 tablespoons blue cheese crumbles",
            "2 tablespoons Olive Oil, plus extra for brushing steaks",
            "2 teaspoons parsley, finely chopped",
            "2 tablespoons Sherry (inexpensive cooking Sherry is okay!)",
            "2\/3 pound top round"
        ]
    }
}