{
    "version": "1.0",
    "lastUpdated": "2025-04-10",
    "recipe": {
        "title": "Bacon-Wrapped Meatloaf",
        "readyInMinutes": 90,
        "servings": 6,
        "image": "https:\/\/img.spoonacular.com\/recipes\/633372-556x370.jpg",
        "sourceUrl": "https:\/\/www.foodista.com\/recipe\/NJNVL828\/bacon-wrapped-meatloaf",
        "instructions": "<ol><li>Preheat the oven to 350 F.<\/li><li>Melt the butter in a small skillet over medium-low heat; cook the onion until soft but not brown, about 5 minutes.  Add the garlic and cook for another minute.  Remove from heat and set aside.<\/li><li>Place a rack on or in a large, glass baking dish.  Alternating slightly, lay the strips of bacon across the rack, one end in the middle and allowing the other end to hang over the side of the dish.  Set aside.<\/li><li>In a small bowl, mix 3 tablespoons of the tomato paste with the water, apple cider vinegar, honey, prepared mustard and 1\/2 teaspoon of salt.  Set aside.<\/li><li>In a large mixing bowl, combine the remaining ingredients with the onion\/garlic mixture and the remaining tomato paste and gently but thoroughly mix with your hands.  Form into a loaf directly on top of the bacon, leaving enough of the bacon uncovered to wrap the top of the meatloaf.  Spoon the glaze over the top of the meatloaf and spread down the sides, covering it completely.  Lift the ends of the bacon hanging down the sides and place over the top of the meatloaf.<\/li><li>Bake for an hour, or until the meatloaf is cooked through and the bacon is brown and crisp.  Allow to rest for 10 minutes before serving.<\/li><\/ol>",
        "summary": "Bacon-Wrapped Meatloaf might be just the main course you are searching for. One serving contains <b>701 calories<\/b>, <b>35g of protein<\/b>, and <b>55g of fat<\/b>. For <b>$2.2 per serving<\/b>, this recipe <b>covers 23%<\/b> of your daily requirements of vitamins and minerals. This recipe serves 6. 29 people were impressed by this recipe. If you have salt, garlic cloves, honey, and a few other ingredients on hand, you can make it. It is brought to you by Foodista. It is a good option if you're following a <b>gluten free, primal, and ketogenic<\/b> diet. From preparation to the plate, this recipe takes about <b>1 hour and 30 minutes<\/b>. Overall, this recipe earns a <b>solid spoonacular score of 65%<\/b>. Try <a href=\"https:\/\/spoonacular.com\/recipes\/bacon-wrapped-meatloaf-1035206\">Bacon Wrapped Meatloaf<\/a>, <a href=\"https:\/\/spoonacular.com\/recipes\/bacon-wrapped-meatloaf-1460791\">Bacon Wrapped Meatloaf<\/a>, and <a href=\"https:\/\/spoonacular.com\/recipes\/bacon-wrapped-meatloaf-1520455\">Bacon Wrapped Meatloaf<\/a> for similar recipes.",
        "cuisines": [],
        "dishTypes": [
            "lunch",
            "main course",
            "main dish",
            "dinner"
        ],
        "ingredients": [
            "3 tablespoons apple cider vinegar",
            "1 tablespoon butter",
            "2 teaspoons dry mustard",
            "2 large eggs",
            "1 tablespoon fresh thyme, finely chopped",
            "2 garlic cloves, minced",
            "1\/2 teaspoon ground black pepper",
            "2 pounds pounds ground chuck or a mixture of 1 pound ground chuck and 1 ground pork or veal",
            "3 tablespoons honey",
            "1\/4 cup milk",
            "1 teaspoon prepared mustard",
            "1 medium onion, chopped",
            "1\/2 teaspoon salt",
            "1 teaspoon salt",
            "8 slices thick-cut bacon",
            "6 oz. can tomato paste, divided",
            "3 tablespoons water"
        ]
    }
}