{
    "version": "1.0",
    "lastUpdated": "2025-04-09",
    "recipe": {
        "title": "Egg Souffle With Bacon and Asparagus",
        "readyInMinutes": 60,
        "servings": 2,
        "image": "https:\/\/img.spoonacular.com\/recipes\/642230-556x370.jpg",
        "sourceUrl": "https:\/\/www.foodista.com\/recipe\/7JDGL35Y\/egg-souffle-with-bacon-and-asparagus",
        "instructions": "<ol><li>Preheat oven to 350 degrees. Lightly grease a 16-ounce ramekin or two 8-ounce ramekins.<\/li><li>In a nonstick frying pan, cook bacon over medium-high heat until crispy. Place bacon strips on a paper towel-lined plate to drain. When bacon is cooled, cut into bite-sized pieces and set aside.<\/li><li>Drain all but 2 teaspoons of bacon fat from pan. Add minced onion and sweat for 3 to 4 minutes, until onions are almost translucent. Add asparagus and cook for about a minute more. Remove pan from heat.<\/li><li>In a small bowl, whisk together eggs, heavy cream, Parmesan, salt and pepper, until ingredients are incorporated. Stir in onions and asparagus.<\/li><li>Line bottom of ramekin(s) with bacon pieces. Pour egg mixture over bacon. Arrange reserved asparagus tips on top of the egg mixture and place ramekin on a parchment-lined baking sheet. Bake in oven for 35 to 40 minutes, until center slightly jiggles and top of souffl is somewhat browned. Serve immediately, before it falls!<\/li><\/ol>",
        "summary": "Egg Souffle With Bacon and Asparagus might be just the <b>Mediterranean<\/b> recipe you are searching for. This gluten free, primal, and ketogenic recipe serves 2 and costs <b>$2.85 per serving<\/b>. This main course has <b>796 calories<\/b>, <b>32g of protein<\/b>, and <b>70g of fat<\/b> per serving. 2 people have made this recipe and would make it again. From preparation to the plate, this recipe takes about <b>1 hour<\/b>. If you have pepper, bacon, parmesan cheese, and a few other ingredients on hand, you can make it. It is brought to you by Foodista. Overall, this recipe earns a <b>solid spoonacular score of 54%<\/b>. <a href=\"https:\/\/spoonacular.com\/recipes\/egg-souffle-with-bacon-and-asparagus-1363969\">Egg Souffle With Bacon and Asparagus<\/a>, <a href=\"https:\/\/spoonacular.com\/recipes\/bacon-pepper-asparagus-souffle-cups-603521\">Bacon Pepper Asparagus Souffle Cups<\/a>, and <a href=\"https:\/\/spoonacular.com\/recipes\/pizza-with-bacon-asparagus-and-egg-8400\">Pizza With Bacon, Asparagus And Egg<\/a> are very similar to this recipe.",
        "cuisines": [
            "Mediterranean",
            "French",
            "European"
        ],
        "dishTypes": [
            "lunch",
            "main course",
            "main dish",
            "dinner"
        ],
        "ingredients": [
            "6 asparagus stalks, tips reserved and stalks cut into coins",
            "3 strips thick cut bacon",
            "4 large eggs",
            "3\/4 cup heavy cream",
            "1\/2 cup onion, minced",
            "1\/2 cup Parmesan cheese, shredded",
            "1\/8 teaspoon pepper",
            "1\/2 teaspoon salt"
        ]
    }
}