{
    "version": "1.0",
    "lastUpdated": "2025-09-18",
    "recipe": {
        "title": "Almost Guilt Free Mac and Cheese",
        "readyInMinutes": 45,
        "servings": 8,
        "image": "https:\/\/img.spoonacular.com\/recipes\/632213-556x370.jpg",
        "sourceUrl": "https:\/\/www.foodista.com\/recipe\/PKMRS8DL\/almost-guilt-free-mac-and-cheese",
        "instructions": "Preheat oven to 425 degrees Farenheit.\nFor Roasted Cauliflower\nClean core and leaves from cauliflower (you do not have to have any precision when doing this).  Chop cauliflower into pieces.  Pieces should be roughly 1\/2\" - 3\/4\".\nPlace chopped cauliflower pieces onto a baking sheet.  Drizzle olive oil over top of cauliflower and mix to thoroughly coat pieces.\nAfter 20 minutes, toss cauliflower pieces to brown all sides.  Bake for another 20 minutes or until edges are browned.\nRemove from oven and lower temperature to 350 degrees Farenheit.\nFor Macaroni and Cheese\nIn a large pot of boiling and salted water, cook pasta until it is al dente.  Once done, drain.\nIn another large saucepan, over medium high heat, melt 3 tablespoons of butter.  Once melted, whisk in flour.  Keep whisking to ensure that there are no lumps.  After 5-7 minutes, the butter and flour mixture should be a light caramel color.\nAdd the soy milk, bay leaves, paprika, lemon juice, thyme, garlic powder and Szechuan pepper.  Stir occasionally for 10 - 15 minutes.  The mixture should thicken up.  Remove bay leaves.\nIn a medium size bowl thoroughly mix eggs.  Using a 1\/4 cup measuring cup, slowly add milk mixture to eggs (temper the eggs).  While adding the hot mixture to the eggs, make sure that you keep whisking.  Once you have roughly 2 cups of the soy milk mixture in with the eggs, dump everything into the main saucepan and stir.  Add in 3\/4 of the shredded cheeses, and all of the goat cheese, and stir to combine.\nAdd in the cooked, diced chicken and roasted cauliflower.  Once these are combined, add the cooked pasta and stir thoroughly.\nSeason with salt and pepper.\nPour into a 9\"x13\" baking pan.\nCover with remaining cheese.\nMelt 2 tablespoons of butter in a saute pan.  Add panko bread crumbs and stir to coat all of the crumbs with butter.\nTop the mac and cheese with the panko crumbs and bake for 30 minutes.\nLet rest for 15-20 minutes before serving.\nIf you really want to kick up the heat factor in this, you can add tablespoon of Sriracha hot sauce to the mix.",
        "summary": "Forget going out to eat or ordering takeout every time you crave American food. Try making Almost Guilt Free Mac and Cheese at home. For <b>$2.72 per serving<\/b>, this recipe <b>covers 31%<\/b> of your daily requirements of vitamins and minerals. One portion of this dish contains about <b>38g of protein<\/b>, <b>31g of fat<\/b>, and a total of <b>585 calories<\/b>. This recipe serves 8. This recipe is liked by 4 foodies and cooks. From preparation to the plate, this recipe takes roughly <b>45 minutes<\/b>. Only a few people really liked this main course. If you have cellantani pasta, flour, goat cheese, and a few other ingredients on hand, you can make it. It is brought to you by Foodista. With a spoonacular <b>score of 68%<\/b>, this dish is good. If you like this recipe, you might also like recipes such as <a href=\"https:\/\/spoonacular.com\/recipes\/almost-guilt-free-mac-and-cheese-1395389\">Almost Guilt Free Mac and Cheese<\/a>, <a href=\"https:\/\/spoonacular.com\/recipes\/guilt-free-mac-n-cheese-402121\">Guilt-Free Mac 'n' Cheese<\/a>, and <a href=\"https:\/\/spoonacular.com\/recipes\/guilt-free-no-bake-cheesecake-high-protein-gluten-free-1305549\">Guilt-Free No-Bake Cheesecake {high protein, gluten-free}<\/a>.",
        "cuisines": [
            "American"
        ],
        "dishTypes": [
            "side dish",
            "lunch",
            "main course",
            "main dish",
            "dinner"
        ],
        "ingredients": [
            "1\/2 pound Cellantani Pasta (elbow macaroni or small shells pasta)",
            "1 medium Head Cauliflower (chopped and roasted)",
            "1 pound Chicken Breast (sauteed and diced)",
            "2 tablespoons Olive Oil",
            "5 tablespoons Butter (divided)",
            "3 tablespoons Flour",
            "1 tablespoon Coleman's Prepared Mustard (could also use Dijon mustard)",
            "3 cups Soy Milk",
            "1 medium Yellow Onion (finely diced)",
            "2 Bay Leaves",
            "1\/2 teaspoon Paprika",
            "1\/2 Lemon (juiced)",
            "1\/4 teaspoon Thyme",
            "1\/2 teaspoon Garlic Powder",
            "1\/8 teaspoon Szechuan Peppers (ground - can use more to taste)*",
            "2 Eggs",
            "5 ounces Goat Cheese",
            "5 ounces Shredded Parmesan Cheese",
            "6 ounces Shredded Emmental Cheese (or Swiss cheese)",
            "1 cup Panko Bread Crumbs (or other bread crumbs)",
            "Kosher Salt",
            "Fresh Ground Black Pepper"
        ]
    }
}