{
    "version": "1.0",
    "lastUpdated": "2025-05-04",
    "recipe": {
        "title": "Fire-Breathing Dragon Pasta",
        "readyInMinutes": 45,
        "servings": 6,
        "image": "https:\/\/img.spoonacular.com\/recipes\/642895-556x370.jpg",
        "sourceUrl": "https:\/\/www.foodista.com\/recipe\/JSVZGQMD\/fire-breathing-dragon-pasta",
        "instructions": "Saute onion in two tablespoons Olive oil in a large, deep-sided skillet or a medium sized saucepan until tender and translucent, season with salt and pepper. Add garlic and saute until fragrant. Add the chipotles, chicken pieces, and Italian seasonings. Season with more salt and pepper. Saute over medium heat turning chicken to sear on all sides.\nAdd the tomato sauce and red pepper flakes. Bring up to a simmer and continue to simmer for ten minutes or until chicken is cooked through. In the meantime cook the pasta to al dente according to package directions and add the dried chiles to the cooking water with the spaghetti.\nStir in the shrimp and milk. Slowly add in the sour cream while stirring. Bring to a slow simmer. Simmer until shrimp begin to curl. Remove from heat.\nServe over pasta(remove the chiles when draining) with fresh Parmesan cheese.",
        "summary": "Fire-Breathing Dragon Pastan is a main course that serves 6. One serving contains <b>901 calories<\/b>, <b>48g of protein<\/b>, and <b>47g of fat<\/b>. For <b>$3.58 per serving<\/b>, this recipe <b>covers 32%<\/b> of your daily requirements of vitamins and minerals. From preparation to the plate, this recipe takes about <b>45 minutes<\/b>. Not a lot of people made this recipe, and 3 would say it hit the spot. This recipe from Foodista requires shrimp, pasta like spaghetti, heavy cream, and pepper flakes. All things considered, we decided this recipe <b>deserves a spoonacular score of 64%<\/b>. This score is good. If you like this recipe, take a look at these similar recipes: <a href=\"https:\/\/spoonacular.com\/recipes\/fire-roasted-tomato-pasta-553156\">Fire roasted tomato pasta<\/a>, <a href=\"https:\/\/spoonacular.com\/recipes\/fire-roasted-tomato-pasta-1195917\">Fire roasted tomato pasta<\/a>, and <a href=\"https:\/\/spoonacular.com\/recipes\/fire-roasted-tomato-and-basil-pasta-1379779\">Fire Roasted Tomato and Basil Pasta<\/a>.",
        "cuisines": [],
        "dishTypes": [
            "side dish",
            "lunch",
            "main course",
            "main dish",
            "dinner"
        ],
        "ingredients": [
            "1 Yellow Onion, diced",
            "Olive oil, for sauting",
            "Salt and Pepper to taste",
            "6 cloves Garlic, minced",
            "3 tablespoons Chipotles in Adobo Sauce, seeds removed, chopped + 1 of",
            "1 pound boneless, skinless, Chicken Breasts, cut into large cubes",
            "2 teaspoons Italian Seasoning",
            "3 cups good Tomato Sauce",
            "1 teaspoon Red Pepper flakes",
            "1\/2 pound medium Shrimp, cleaned with tails off",
            "1 cup Whole Milk or Heavy Cream",
            "1 cup Sour Cream",
            "1 pound Pasta like spaghetti or penne",
            "4 dried Red Chile Peppers",
            "Parmesan, fresh grated, for serving"
        ]
    }
}