{
    "version": "1.0",
    "lastUpdated": "2026-02-25",
    "recipe": {
        "title": "South Carolina Style Pulled Pork",
        "readyInMinutes": 45,
        "servings": 10,
        "image": "https:\/\/img.spoonacular.com\/recipes\/660680-556x370.jpg",
        "sourceUrl": "https:\/\/www.foodista.com\/recipe\/668T4HVK\/south-carolina-style-pulled-pork",
        "instructions": "<ol><li>Massage mustard sauce into the meat. Wrap the meat tightly in a double layer of plastic wrap and refrigerate for at least 3 hours or up to 3 days. (The sauce was really thin and liquid-y so after dumping about half on the meat and realizing massaging was just not going to happen, I threw the meat and the sauce into a ziplock bag, shook it up and made sure it was coated then threw it in the fridge for the three day marinating marathon.)<\/li><li>At least one hour prior to cooking, remove the roast from the refrigerator and unwrap, placing the meat and the marinating juices into a disposable 913 disposable aluminum pan and let it come to room temperature. (As I mentioned above, my pans were a bit flimsy so I doubled up.) Soak the wood chips in cold water to cover for 1 hour and drain.<\/li><li>Meanwhile, light a large chimney starter filled halfway with charcoal (about 3 quarts) and allow to burn until the coals are partially covered with a layer of ash. Build a modified two-level fire by arranging all the coals over half of the grill, leaving the other half empty. Open the bottom grill vents completely. Place the wood chips on the coals. Set the cooking grate in place, cover and heat the grate until hot, about 5 minutes. Use a grill brush to scrape the cooking grate clean. Sip a wad of paper towels in vegetable oil; holding the wad with tongs, oil the cooking grate.<\/li><li>Set the aluminum pan with the roast on the grate opposite the coals. Open the grill lid vents three-quarters of the way and cover, making sure the vent is above the meat to draw smoke through the grill. Cook, adding about eight briquettes every hour or so to maintain an average temperature of 275F for three hours. (When I added coals, I also basted the marinade over the roast to ensure moistness.)<\/li><li>Adjust an oven rack to the middle position and heat the oven to 325F. Wrap the pan holding the roast, being careful not to spill the marinating liquid, with heavy duty aluminum foil to cover completely. Place the pan in the oven and cook until the meat is fork-tender, about 2 hours.<\/li><li>Carefully slide the foil-wrapped pan with the roast into a brown paper bag. Crimp the end shut. Let rest for 1 hour. (I found it easiest to lay the paper bag open on its side and slide the roast in, instead of dropping it downward, then folding the opening up and taping it shut.)<\/li><li>While roast is resting, prepare barbecue sauce. If wanting true South Carolina style barbecue sauce, make the marinade above. If wanting a thicker, tangier sauce with a hot finish, I highly recommend Inas barbecue sauce below. Its a bit of an ingredient dump with 11 of 13 items being from jars and bottles, but with flavors so loud and clamoring for your taste-buds attention, you wont regret it.<\/li><li>In a large sauce pan on low heat, saute onions and garlic with the oil until the onions are translucent, about 10 to 15 minutes. Add the rest of the ingredients. Simmer uncovered on low heat for 30 minutes. Use immediately or store in fridge. Makes about 6 cups.<\/li><li>Keeping: This sauce freezes excellently. I made a big batch last fall and froze it, pulling it out for the pulled pork. I re-heated in a sauce pan on low heat until hot.<\/li><li>Once pork has rested, transfer the roast to a carving board and dispose of the marinade liquid and pan. When cool enough to handle, separate the roast into sections, removing fat if desired, and tear the meat into shreds with your fingers (forks work just as well without your fingers getting messy). Place the shredded meat in a large bowl. Toss with 1 cup of the barbecue sauce, adding more to taste. Serve, passing the remaining sauce separately.<\/li><\/ol>",
        "summary": "The recipe South Carolina Style Pulled Pork is ready <b>in roughly 45 minutes<\/b> and is definitely an amazing <b>gluten free and dairy free<\/b> option for lovers of American food. One serving contains <b>692 calories<\/b>, <b>48g of protein<\/b>, and <b>21g of fat<\/b>. This recipe serves 10. For <b>$3.19 per serving<\/b>, this recipe <b>covers 36%<\/b> of your daily requirements of vitamins and minerals. 3 people were glad they tried this recipe. Not a lot of people really liked this main course. If you have apple cider vinegar, ground cumin, garlic, and a few other ingredients on hand, you can make it. It is brought to you by Foodista. With a spoonacular <b>score of 81%<\/b>, this dish is awesome. If you like this recipe, you might also like recipes such as <a href=\"https:\/\/spoonacular.com\/recipes\/north-carolina-style-pulled-pork-458007\">North Carolina-Style Pulled Pork<\/a>, <a href=\"https:\/\/spoonacular.com\/recipes\/carolina-style-pulled-pork-sliders-1344539\">Carolina Style Pulled Pork Sliders<\/a>, and <a href=\"https:\/\/spoonacular.com\/recipes\/carolina-style-pulled-pork-sandwiches-714634\">Carolina-Style Pulled Pork Sandwiches<\/a>.",
        "cuisines": [
            "American"
        ],
        "dishTypes": [
            "lunch",
            "main course",
            "main dish",
            "dinner"
        ],
        "ingredients": [
            "1 cup apple cider vinegar",
            "2 cups barbecue sauce (see Ina's recipe below)",
            "2 tablespoons chili powder",
            "1 cup Dijon mustard",
            "Garlic crushed 1 teaspoon",
            "1 tablespoon ground cumin",
            "1 cup hoisin sauce",
            "1 cup honey",
            "2 tablespoons maple syrup",
            "8 pounds Boston butt pork shoulder",
            "1\/2 tablespoon crushed red pepper flakes",
            "1 teaspoon soy sauce",
            "2 teaspoons table salt",
            "1 cup tomato paste (10 ounces)",
            "1\/2 cup vegetable oil",
            "1\/2 cup Worcestershire sauce",
            "1 1\/2 cups chopped yellow onion (1 large onion)"
        ]
    }
}