{
    "version": "1.0",
    "lastUpdated": "2025-05-06",
    "recipe": {
        "title": "Rice and Peas with Coconut Curry Mackerel",
        "readyInMinutes": 45,
        "servings": 4,
        "image": "https:\/\/img.spoonacular.com\/recipes\/716364-556x370.jpg",
        "sourceUrl": "https:\/\/www.afrolems.com\/2014\/10\/31\/rice-and-peas-with-coconut-curry-mackerel\/",
        "instructions": "Pour 1 cup of coconut milk in a pot with 1 seasoning cube and allow to boil for a minute.Pour in your rice and peas in the boiling coconut milk and pour 2 cups of water and leave to boil till the rice and peas are soft on low heat.In a separate pot, season and bring the mackerel to boil in the rest of the coconut milk, curry powder and some water.Toss in the chopped onion, scotch bonnet peppers and garlic and allow to simmer on medium heat.Once the fish is cooked, add the corn starch to thicken the sauce and allow to simmer for 4 minutes on low heat.Serve with the rice and peas",
        "summary": "Rice and Peas with Coconut Curry Mackerel could be just the <b>gluten free and dairy free<\/b> recipe you've been looking for. For <b>$2.44 per serving<\/b>, you get a main course that serves 4. One serving contains <b>625 calories<\/b>, <b>31g of protein<\/b>, and <b>34g of fat<\/b>. This recipe from Afrolems has 26 fans. From preparation to the plate, this recipe takes around <b>45 minutes<\/b>. If you have coconut milk, corn starch, garlic, and a few other ingredients on hand, you can make it. A couple people really liked this Indian dish. All things considered, we decided this recipe <b>deserves a spoonacular score of 94%<\/b>. This score is super. Similar recipes are <a href=\"https:\/\/spoonacular.com\/recipes\/rice-and-peas-with-coconut-curry-mackerel-1585999\">Rice and Peas with Coconut Curry Mackerel<\/a>, <a href=\"https:\/\/spoonacular.com\/recipes\/coconut-chicken-curry-with-snow-peas-and-rice-1213727\">Coconut Chicken Curry with Snow Peas and Rice<\/a>, and <a href=\"https:\/\/spoonacular.com\/recipes\/black-eyed-peas-curry-with-coconut-lobia-curry-600742\">Black Eyed Peas Curry (With Coconut) (Lobia Curry)<\/a>.",
        "cuisines": [
            "Indian",
            "Asian"
        ],
        "dishTypes": [
            "lunch",
            "main course",
            "main dish",
            "dinner"
        ],
        "ingredients": [
            "2 cups of coconut milk",
            "1 tablespoon of corn starch",
            "2 tablespoons of curry powder",
            "1 clove of garlic (chopped)",
            "Seasoning cubes",
            "1 medium piece of Mackerel (chopped in 4 pieces)",
            "1\/2 bulb of onion",
            "1\/2 cup of red kidney beans",
            "1 cup of Rice",
            "3 scotch bonnet peppers"
        ]
    }
}