{
    "version": "1.0",
    "lastUpdated": "2025-10-12",
    "recipe": {
        "title": "Wildwood Ovens Bourbon Apple Glazed Cedar Plank Salmon",
        "readyInMinutes": 45,
        "servings": 6,
        "image": "https:\/\/img.spoonacular.com\/recipes\/665352-556x370.jpg",
        "sourceUrl": "https:\/\/www.foodista.com\/recipe\/P5XGZL3X\/wildwood-ovens-bourbon-apple-glazed-cedar-plank-salmon",
        "instructions": "<ol><li>Soak cedar plank in water for 2 hours.  Rinse salmon under cold water and pat dry with paper towels.  Place a medium sauce pan over medium high heat and add bourbon or brandy.  Use caution as the alcohol can ignite; never pour directly from the bottle.   When alcohol is reduced and there is only a small amount left, add apple juice, brown sugar, and garlic.  Continue to cook over medium high heat until reduced to about  of the original volume (should be slightly thinner than syrup).<\/li><li>Season salmon with salt and pepper on both sides, brush skin side with olive oil and place on cedar plank, skin side down.  Place cedar plank on a medium high grill, or in a wood fired oven pre-heated to 500F near the fire.  Use a probe thermometer to check the internal temperature of the salmon after 10 minutes, and every 5 minutes or so thereafter.  Once the salmon has an internal temperature of at least 100F, brush on the apple glaze that you made earlier, repeat this step every few minutes. Cook salmon until<\/li><\/ol>",
        "summary": "The recipe Wildwood Ovens Bourbon Apple Glazed Cedar Plank Salmon can be made <b>in about 45 minutes<\/b>. This gluten free, dairy free, and pescatarian recipe serves 6 and costs <b>$3.88 per serving<\/b>. One portion of this dish contains about <b>30g of protein<\/b>, <b>10g of fat<\/b>, and a total of <b>297 calories<\/b>. It is brought to you by Foodista. 3 people were impressed by this recipe. If you have apple juice, brown sugar, cedar plank, and a few other ingredients on hand, you can make it. It works well as a pretty expensive main course. All things considered, we decided this recipe <b>deserves a spoonacular score of 77%<\/b>. This score is solid. Users who liked this recipe also liked <a href=\"https:\/\/spoonacular.com\/recipes\/apricot-jalapeo-glazed-cedar-plank-salmon-519520\">Apricot Jalapeño Glazed Cedar Plank Salmon<\/a>, <a href=\"https:\/\/spoonacular.com\/recipes\/cedar-plank-salmon-5007\">Cedar Plank Salmon<\/a>, and <a href=\"https:\/\/spoonacular.com\/recipes\/cedar-plank-salmon-4420\">Cedar-Plank Salmon<\/a>.",
        "cuisines": [],
        "dishTypes": [
            "lunch",
            "main course",
            "main dish",
            "dinner"
        ],
        "ingredients": [
            "1 cup Apple Juice",
            "1\/4 cup Brown Sugar",
            "1 Cedar Plank",
            "2 Garlic Cloves (minced)",
            "TT Kosher salt",
            "TT Fresh cracked black pepper.",
            "2 pounds Salmon Filet",
            "1\/4 cup Bourbon Whiskey, or Brandy"
        ]
    }
}