{
    "version": "1.0",
    "lastUpdated": "2025-11-10",
    "recipe": {
        "title": "Best Potato Cheese Soup in a bread bowl",
        "readyInMinutes": 45,
        "servings": 8,
        "image": "https:\/\/img.spoonacular.com\/recipes\/634927-556x370.jpg",
        "sourceUrl": "https:\/\/www.foodista.com\/recipe\/VWFNYL5F\/best-potato-cheese-soup-in-a-bread-bowl",
        "instructions": "In a large heavy stock pot, heat 2 tbs of olive oil. When hot, add onions and cook over medium heat until translucent  2-3 mins. Add garlic and cook for another 1 minute. Add Chicken stock, water and salt to pot. Add potatoes and carrots to stock pot and bring to a boil. Boil until potatoes are fork tender.\nTurn burner off and allow to cool until able to remove about  of the potatoes with a slotted spoon to a food processor or blender. Process until potatoes turn into a paste and then add back to the stock pot.\nPlace stock pot back on the burner and on medium heat, add milk, cream, butter and Velveeta cheese and heat until butter and Velveeta is melted. Do not bring to a boil  adjust heat to low as temperature nears boiling. Stir frequently with wooden spoon and scrape bottom of stock pot frequently to prevent sticking.\nAdd sharp cheddar one handful at a time, stirring each time. Add parmesean. Add salt and pepper to taste (will vary greatly depending on types of cheese you use  so add a little, taste, repeat).\nServe in bread bowl, soup bowl or mug. Garnish with bacon crumbles, chives, sour cream and shredded cheese.",
        "summary": "Best Potato Cheese Soup in a bread bowl could be just the <b>gluten free<\/b> recipe you've been looking for. One portion of this dish contains about <b>26g of protein<\/b>, <b>45g of fat<\/b>, and a total of <b>750 calories<\/b>. For <b>$2.11 per serving<\/b>, this recipe <b>covers 29%<\/b> of your daily requirements of vitamins and minerals. This recipe serves 8. Head to the store and pick up block veleveeta cheese, onion, garnish - bacon crumbles, and a few other things to make it today. It works well as a rather cheap main course. Only a few people made this recipe, and 3 would say it hit the spot. It will be a hit at your <b>Autumn<\/b> event. From preparation to the plate, this recipe takes roughly <b>45 minutes<\/b>. It is brought to you by Foodista. Taking all factors into account, this recipe <b>earns a spoonacular score of 61%<\/b>, which is pretty good. Similar recipes are <a href=\"https:\/\/spoonacular.com\/recipes\/one-bowl-cheese-bread-582301\">One Bowl Cheese Bread<\/a>, <a href=\"https:\/\/spoonacular.com\/recipes\/beer-cheese-in-a-bread-bowl-recipe-147570\">Beer Cheese in a Bread Bowl Recipe<\/a>, and <a href=\"https:\/\/spoonacular.com\/recipes\/creamy-ranch-and-cheese-bread-bowl-dip-creamy-ranch-and-cheese-bread-bowl-dip-520657\">Creamy Ranch and Cheese Bread Bowl Dip Creamy Ranch and Cheese Bread Bowl Dip<\/a>.",
        "cuisines": [],
        "dishTypes": [
            "lunch",
            "soup",
            "main course",
            "main dish",
            "dinner"
        ],
        "ingredients": [
            "2 Tbs Olive oil",
            "1 large sweet onion – diced",
            "2 tsp garlic – minced ( about 4 cloves)",
            "1 quart Chicken Stock (if boxed, use one large box).",
            "1 quart of water",
            "2 tsp salt",
            "5-6 large potatoes – cut into 1 ½ inch cubes(if Russets or baking potatoes, peel. If Red or Yukon Gold – no need to peel).",
            "3 large carrots - peeled and cut into ½ inch pieces",
            "1\/3 Gallon of whole milk",
            "½ pint Heavy Cream",
            "½ stick of butter",
            "½ block Veleveeta Cheese – cubed.",
            "2 cups Sharp Cheedar Cheese – shredded",
            "Salt and pepper to taste",
            "Garnish – bacon crumbles, chives, sour cream, shredded cheese.",
            "1 C Parmesean – grated",
            "1 C Parmesean – grated"
        ]
    }
}