{
    "version": "1.0",
    "lastUpdated": "2025-04-03",
    "recipe": {
        "title": "Easy Eggplant Parmesan",
        "readyInMinutes": 45,
        "servings": 4,
        "image": "https:\/\/img.spoonacular.com\/recipes\/641962-556x370.jpg",
        "sourceUrl": "https:\/\/www.foodista.com\/recipe\/XQNPGJDB\/easy-eggplant-parmesan",
        "instructions": "Put the eggplant on a baking sheet and brush with olive oil. Place under the broiler until soft. Remove and allow to cool.\nMeanwhile, heat the sauce in a small saucepan. Heat the remaining oil and cook the onion for 5 minutes. Then add the garlic and cook for an additional minute. Add the onion and garlic to the sauce.\nArrange the eggplant across the bottom of a 8 x 6 baking dish and then scatter cheese on top. Repeat layers until you run out of eggplant. Finish off with sauce, basil and remaining cheese. Bake for 40 minutes and 375.\nOptional: If you prefer you can fry the eggplant in a bit of olive oil. Then, soak up oil on a paper towel.",
        "summary": "Easy Eggplant Parmesan might be a good recipe to expand your main course recipe box. For <b>$2.63 per serving<\/b>, this recipe <b>covers 21%<\/b> of your daily requirements of vitamins and minerals. Watching your figure? This gluten free, lacto ovo vegetarian, and primal recipe has <b>288 calories<\/b>, <b>21g of protein<\/b>, and <b>12g of fat<\/b> per serving. This recipe serves 4. 2 people have tried and liked this recipe. This recipe is typical of Mediterranean cuisine. A mixture of style cheese, onion, pasta sauce, and a handful of other ingredients are all it takes to make this recipe so delicious. From preparation to the plate, this recipe takes roughly <b>45 minutes<\/b>. It is brought to you by Foodista. Overall, this recipe earns a <b>solid spoonacular score of 64%<\/b>. <a href=\"https:\/\/spoonacular.com\/recipes\/easy-eggplant-parmesan-265330\">Easy Eggplant Parmesan<\/a>, <a href=\"https:\/\/spoonacular.com\/recipes\/easy-eggplant-parmesan-1620099\">Easy Eggplant Parmesan<\/a>, and <a href=\"https:\/\/spoonacular.com\/recipes\/easy-eggplant-parmesan-103890\">Easy Eggplant Parmesan<\/a> are very similar to this recipe.",
        "cuisines": [
            "Mediterranean",
            "Italian",
            "European"
        ],
        "dishTypes": [
            "lunch",
            "main course",
            "main dish",
            "dinner"
        ],
        "ingredients": [
            "3 tablespoons olive oil",
            "1 onion, chopped",
            "1 garlic clove, minced",
            "1\/2 jar pasta sauce",
            "1 1\/2 pounds eggplant, sliced",
            "2 cups bag of Italian Style Cheese",
            "1 cup basil leaves, chopped"
        ]
    }
}