{
    "version": "1.0",
    "lastUpdated": "2025-11-11",
    "recipe": {
        "title": "Seafood Gumbo",
        "readyInMinutes": 45,
        "servings": 12,
        "image": "https://img.spoonacular.com/recipes/659638-556x370.jpg",
        "sourceUrl": "https:\/\/www.foodista.com\/recipe\/XJJFHR6X\/seafood-gumbo",
        "instructions": "<ol><li>Heat oil in a large heavy stockpot over medium-high heat.<\/li><li>Add the flour and stir constantly until a light brown roux is formed.<\/li><li>Add the onions, bell pepper, celery and garlic. Saut until the onions become translucent and the vegetables are tender.<\/li><li>Add the tomatoes and tomato pure and cook over medium heat for 10 minutes.<\/li><li>Add the Creole seasoning, thyme, bay leaves and about 1\/2 teaspoon each of salt and pepper, and continue to cook another 10 minutes.<\/li><li>Add the okra, and cook for another 10 minutes, then add the stock. Bring to a boil, then reduce heat to simmer and cook another 30 minutes.<\/li><li>Reduce heat to low.<\/li><li>About 10 minutes prior to serving, add the shrimp, oysters and oyster liquor. Just prior to serving, add the crab meat (the crab meat does not need to be cooked, just stir until it is heated through.<\/li><li>Taste and correct seasonings if necessary.<\/li><li>Remove from heat and sprinkle the fil powder on the surface of the gumbo; cover and let stand for 15 minutes. Uncover and stir to mix.<\/li><li>Serve hot with French bread and cold beverages.<\/li><\/ol>",
        "summary": "Seafood Gumbo could be just the <b>dairy free and pescatarian<\/b> recipe you've been looking for. This recipe serves 12. This main course has <b>376 calories<\/b>, <b>35g of protein<\/b>, and <b>5g of fat<\/b> per serving. For <b>$4.87 per serving<\/b>, this recipe <b>covers 30%<\/b> of your daily requirements of vitamins and minerals. This recipe is liked by 4 foodies and cooks. From preparation to the plate, this recipe takes approximately <b>45 minutes<\/b>. This recipe is typical of Cajun cuisine. A mixture of salt and pepper, lump crab meat, flour, and a handful of other ingredients are all it takes to make this recipe so yummy. It is brought to you by Foodista. With a spoonacular <b>score of 80%<\/b>, this dish is solid. <a href=\"https:\/\/spoonacular.com\/recipes\/seafood-gumbo-1202205\">Seafood Gumbo<\/a>, <a href=\"https:\/\/spoonacular.com\/recipes\/seafood-gumbo-3129\">Seafood Gumbo<\/a>, and <a href=\"https:\/\/spoonacular.com\/recipes\/seafood-gumbo-1262935\">Seafood Gumbo<\/a> are very similar to this recipe.",
        "cuisines": [
            "Cajun",
            "Creole"
        ],
        "dishTypes": [
            "lunch",
            "soup",
            "main course",
            "main dish",
            "dinner"
        ],
        "ingredients": [
            "2 bay leaves",
            "3 ribs celery, finely diced",
            "8 cups cooked long-grain white rice",
            "1 tablespoon filé powder",
            "4 quarts shrimp stock, crab stock or fish stock",
            "1\/2 cup flour",
            "6 cloves garlic, minced",
            "2 green bell peppers, diced",
            "1 pound fresh lump crab meat, picked over for shells and cartilage",
            "1\/2 cup oil",
            "2 pounds okra, chopped",
            "2 medium onions, diced",
            "2 dozens oysters, freshly shucked, liquor reserved",
            "Salt and freshly ground black pepper to taste",
            "1 tablespoon Creole seasoning blend",
            "2 pounds medium shrimp, peeled and deveined",
            "1 teaspoon dried thyme leaves",
            "1 cup tomato purée",
            "4 tomatoes, seeded and diced"
        ]
    }
}
