{
    "version": "1.0",
    "lastUpdated": "2025-03-15",
    "recipe": {
        "title": "Chicken and Spring Mix Salad with Spicy Pineapple Dressing",
        "readyInMinutes": 25,
        "servings": 2,
        "image": "https:\/\/img.spoonacular.com\/recipes\/637924-556x370.jpg",
        "sourceUrl": "https:\/\/www.foodista.com\/recipe\/ZCNPRN88\/chicken-and-spring-mix-salad-with-spicy-pineapple-dressing",
        "instructions": "<ol><li>Heat a non-stick pan over medium-high heat with 1 tbsp olive oil. Sprinkle both sides of chicken evenly with paprika, garlic powder, and salt. Add chicken to pan; cook for 5 minutes on each side or until well browned. Remove from pan; set aside.<\/li><li>Combine half of pineapple, orange juice, vinegar, and Serrano in a blender; process until smooth. Add olive oil after blended and mix with spoon or ladle.<\/li><li>Cut the red onion and red bell pepper into thin strips or desired pieces. Pineapples should be cut into 1\/2-inch chunks or can be cut according to preference as well.<\/li><li>Combine remaining pineapple and the remaining ingredients in a large bowl. Drizzle with 3\/4 cup dressing, and toss gently to coat. Divide salad evenly among 2 plates. Cut chicken across the grain into thin slices; divide chicken evenly over salads. Drizzle salad evenly with remaining dressing. Enjoy!<\/li><\/ol>",
        "summary": "Chicken and Spring Mix Salad with Spicy Pineapple Dressing requires about <b>25 minutes<\/b> from start to finish. This recipe serves 2. For <b>$3.39 per serving<\/b>, this recipe <b>covers 31%<\/b> of your daily requirements of vitamins and minerals. Watching your figure? This gluten free, dairy free, paleolithic, and primal recipe has <b>348 calories<\/b>, <b>38g of protein<\/b>, and <b>12g of fat<\/b> per serving. 2 people were glad they tried this recipe. If you have onion, garlic powder, chicken breast halves, and a few other ingredients on hand, you can make it. <b>Spring<\/b> will be even more special with this recipe. It works well as a main course. It is brought to you by Foodista. All things considered, we decided this recipe <b>deserves a spoonacular score of 79%<\/b>. This score is solid. Users who liked this recipe also liked <a href=\"https:\/\/spoonacular.com\/recipes\/grilled-chicken-salad-with-spicy-pineapple-dressing-539375\">Grilled Chicken Salad with Spicy Pineapple Dressing<\/a>, <a href=\"https:\/\/spoonacular.com\/recipes\/grilled-chicken-salad-with-spicy-pineapple-dressing-43210\">Grilled Chicken Salad With Spicy Pineapple Dressing<\/a>, and <a href=\"https:\/\/spoonacular.com\/recipes\/grilled-chicken-and-spinach-salad-with-spicy-pineapple-dressing-19614\">Grilled Chicken and Spinach Salad with Spicy Pineapple Dressing<\/a>.",
        "cuisines": [],
        "dishTypes": [
            "side dish",
            "lunch",
            "main course",
            "salad",
            "main dish",
            "dinner"
        ],
        "ingredients": [
            "•2 tbsp apple cider vinegar (or vinegar + 1 tsp sugar)",
            "•1\/2 tsp garlic powder",
            "•1 tbsp olive oil (extra-virgin if available)",
            "•1 tbsp orange juice (or apple juice)",
            "•1 tsp paprika (or chili powder)",
            "•1 cup cubed fresh pineapple (about 8 ounces), divided",
            "•1\/3 red bell pepper, thinly sliced",
            "•1\/4 red onion, thinly sliced",
            "•1\/2 tsp salt",
            "•1\/2 Serrano pepper, seeded (or habanero)",
            "3\/4 pound skinless, boneless chicken breast halves, cut into cubes",
            "•1 (5-ounce) package fresh spring mix of spinach, baby lettuce, and radicchio"
        ]
    }
}