{
    "version": "1.0",
    "lastUpdated": "2025-04-27",
    "recipe": {
        "title": "Pesto Zucchini \"Spaghetti",
        "readyInMinutes": 45,
        "servings": 4,
        "image": "https:\/\/img.spoonacular.com\/recipes\/655853-556x370.jpg",
        "sourceUrl": "https:\/\/www.foodista.com\/recipe\/RGY8Z8V3\/pesto-zucchini-spaghetti",
        "instructions": "Place zucchini strips in a colander over a bowl or in the sink. Sprinkle zucchini with salt and toss to combine. Let the zucchini sit for 15 minutes while the salt extracts the moisture. Drain excess water, squeezing zucchini, if necessary.\nMeanwhile, cook bacon in a skillet over medium heat until crisp, turning frequently. Remove bacon to a stack of paper towels to drain. Crumble bacon. Remove all but 2 T of bacon drippings from the pan.\nReturn the pan to medium heat. Add the green onions and broccoli, stirring frequently for about 3-5 minutes or until crisp-tender. Add zucchini and 2 T of pesto, tossing to combine all ingredients. Taste and add more pesto, if needed. The mixture only needs to warm up, so 2-3 minutes of cooking ought to do it.\nServe with bacon crumbles and freshly grated Parmesan cheese.",
        "summary": "Pesto Zucchini \"Spaghetti requires around <b>45 minutes<\/b> from start to finish. This main course has <b>336 calories<\/b>, <b>18g of protein<\/b>, and <b>25g of fat<\/b> per serving. For <b>$1.9 per serving<\/b>, this recipe <b>covers 22%<\/b> of your daily requirements of vitamins and minerals. This recipe serves 4. Head to the store and pick up romano cheese, salt, bacon, and a few other things to make it today. 4 people have tried and liked this recipe. It is brought to you by Foodista. It is a good option if you're following a <b>gluten free and primal<\/b> diet. Overall, this recipe earns a <b>pretty good spoonacular score of 62%<\/b>. Similar recipes are <a href=\"https:\/\/spoonacular.com\/recipes\/spaghetti-with-zucchini-and-pistachio-pesto-668341\">Spaghetti with Zucchini and Pistachio Pesto<\/a>, <a href=\"https:\/\/spoonacular.com\/recipes\/spaghetti-with-zucchini-and-pistachio-pesto-1205233\">Spaghetti with Zucchini and Pistachio Pesto<\/a>, and <a href=\"https:\/\/spoonacular.com\/recipes\/zucchini-spaghetti-with-spinach-pesto-520192\">Zucchini \"Spaghetti\" with Spinach Pesto<\/a>.",
        "cuisines": [],
        "dishTypes": [
            "side dish",
            "lunch",
            "main course",
            "main dish",
            "dinner"
        ],
        "ingredients": [
            "4 medium zucchini, julienned thinly (mandoline slicers are great for this)",
            "generous pinch of salt",
            "6 slices of uncooked bacon",
            "1\/2 cup green onions, sliced into 1-inch pieces",
            "2 cups broccoli florets",
            "2-3 T prepared basil pesto",
            "Fresh Parmesan or Romano cheese, for garnish"
        ]
    }
}