{
    "version": "1.0",
    "lastUpdated": "2025-03-20",
    "recipe": {
        "title": "Mexican Casserole",
        "readyInMinutes": 65,
        "servings": 6,
        "image": "https:\/\/img.spoonacular.com\/recipes\/715438-556x370.jpg",
        "sourceUrl": "http:\/\/www.pinkwhen.com\/mexican-casserole\/",
        "instructions": "Take a large pot and ring water to a boil. When finished, place you chicken breasts in to boil for 20 minutes or until cooked. Take a smaller pan and cook rice as directed. Allow both rice and chicken time to cool when once fully cooked. Heat over to 350 degrees. Take cooled chicken breasts and shred, or cut into bite size pieces. Add into a large mixing bowl. Stir in cooked rice, 2 cups of Monterrey Jack cheese, and 1 cup of Cheddar. Stir in both soups, chopped onion, and salsa.Take a 9 x 13 baking dish and coat with non stick spray. Place mixture into the 9 x 13 dish and cover with the remaining cup of cheddar cheese. Bake for 40 minutes. Allow to cool before serving.",
        "summary": "The recipe Mexican Casserole could satisfy your Mexican craving in about <b>1 hour and 5 minutes<\/b>. This main course has <b>581 calories<\/b>, <b>48g of protein<\/b>, and <b>21g of fat<\/b> per serving. This recipe serves 6 and costs $2.63 per serving. It is brought to you by Pink When. 503 people were impressed by this recipe. It will be a hit at your <b>Autumn<\/b> event. A mixture of cheddar cheese, monterrey jack, salsa, and a handful of other ingredients are all it takes to make this recipe so scrumptious. It is a good option if you're following a <b>gluten free<\/b> diet. Overall, this recipe earns a <b>spectacular spoonacular score of 88%<\/b>. Try <a href=\"https:\/\/spoonacular.com\/recipes\/mexican-casserole-1620683\">Mexican Casserole<\/a>, <a href=\"https:\/\/spoonacular.com\/recipes\/mexican-casserole-513196\">Mexican Casserole<\/a>, and <a href=\"https:\/\/spoonacular.com\/recipes\/mexican-casserole-703344\">Mexican Casserole<\/a> for similar recipes.",
        "cuisines": [
            "Mexican"
        ],
        "dishTypes": [
            "side dish",
            "lunch",
            "main course",
            "main dish",
            "dinner"
        ],
        "ingredients": [
            "4 boneless chicken breasts",
            "2 cups shredded Monterrey Jack",
            "1 (10oz) cream of chicken soup",
            "1 (10oz) cream of mushroom soup",
            "1 onion, finely chopped",
            "1 cup uncooked rice",
            "1 cup salsa",
            "2 cups shredded Cheddar Cheese"
        ]
    }
}