{
    "version": "1.0",
    "lastUpdated": "2025-05-22",
    "recipe": {
        "title": "Bombay Potatoes",
        "readyInMinutes": 45,
        "servings": 1,
        "image": "https:\/\/img.spoonacular.com\/recipes\/635642-556x370.jpg",
        "sourceUrl": "http:\/\/www.foodista.com\/recipe\/8YS4235G\/bombay-potatoes",
        "instructions": "<ol><li>Peel the potatoes and dice into bite sized pieces. fill a deep pan with water and boil the potatoes with a pinch of salt until they have cooked throughout.<\/li><li>When the potatoes are done rinse under cold water, making sure the potatoes do not break.<\/li><li>In a non-stick frying pan, heat up the oil. Once the oil is hot, (not so hot that a blue haze appears), add the mustard seeds and cover with a lid.<\/li><li>Lower the gas to the medium setting. The seeds will soon start to pop; lower the heat and add the chili and turmeric power and stir. Ensure the powder mixture and seeds do not burn!<\/li><li>Add the potatoes to the pungent oil and stir slowly for a minute until the potatoes are covered in the seeds and they turn a light yellow due to the turmeric.<\/li><li>Remove from the heat and garnish with coriander.<\/li><\/ol>",
        "summary": "Bombay Potatoes requires around <b>45 minutes<\/b> from start to finish. One serving contains <b>1192 calories<\/b>, <b>24g of protein<\/b>, and <b>38g of fat<\/b>. For <b>$1.9 per serving<\/b>, this recipe <b>covers 48%<\/b> of your daily requirements of vitamins and minerals. This recipe serves 1. Only a few people really liked this main course. 2 people have tried and liked this recipe. A mixture of turmeric powder, salt, coriander leaf, and a handful of other ingredients are all it takes to make this recipe so tasty. It is a good option if you're following a <b>gluten free, dairy free, lacto ovo vegetarian, and fodmap friendly<\/b> diet. It is brought to you by Foodista. With a spoonacular <b>score of 93%<\/b>, this dish is tremendous. <a href=\"https:\/\/spoonacular.com\/recipes\/bombay-potatoes-1297967\">Bombay Potatoes<\/a>, <a href=\"https:\/\/spoonacular.com\/recipes\/bombay-potatoes-aloo-1087517\">Bombay Potatoes (Aloo)<\/a>, and <a href=\"https:\/\/spoonacular.com\/recipes\/bombay-breakfast-potatoes-44057\">Bombay Breakfast Potatoes<\/a> are very similar to this recipe.",
        "cuisines": [],
        "dishTypes": [
            "lunch",
            "main course",
            "main dish",
            "dinner"
        ],
        "ingredients": [
            "2 tablespoons brown mustard seeds",
            "2 1\/2 tablespoons cooking oil",
            "coriander leaf for garnishing",
            "3 large potatoes",
            "1\/2 teaspoon salt",
            "1 teaspoon turmeric powder"
        ]
    }
}