{
    "version": "1.0",
    "lastUpdated": "2025-09-20",
    "recipe": {
        "title": "Simple Roast Chicken",
        "readyInMinutes": 45,
        "servings": 4,
        "image": "https:\/\/img.spoonacular.com\/recipes\/660133-556x370.jpg",
        "sourceUrl": "https:\/\/www.foodista.com\/recipe\/QFV873BT\/simple-roast-chicken",
        "instructions": "Wash the chicken inside and out and pat dry. Make sure the skin is nice and dry so the skin gets crispy. Season well with salt and pepper inside, out and under the skin.\nMix the butter with the garlic, chilli and lemon rind. Season a bit with salt and pepper. Stuff the flavoured butter under the skin over the breast, legs and back. Stuff the lemon half into the cavity.\nPre-heat the oven to 400F. Toss the two kinds of potatoes in the bottom the the baking pan with the chilli, salt and pepper to taste and a generous helping of olive oil. Place a rack over the vegetables. Position the chicken breast side up on the rack.\nBake for the first 15 minutes at 400F. Then drop the temperature and continue to cook for about an hour at 300F.\nHalfway through cooking turn the chicken on its breast. Spoon over some of the juices.\nLater, to check for doneness, pierce the thickest part of the chicken (the thigh). If the juices run clear the chicken is ready, if not continue cooking.\nServe chicken on a platter on the bed of roasted potatoes.",
        "summary": "Simple Roast Chicken is a <b>gluten free<\/b> recipe with 4 servings. For <b>$2.76 per serving<\/b>, this recipe <b>covers 37%<\/b> of your daily requirements of vitamins and minerals. One portion of this dish contains about <b>47g of protein<\/b>, <b>64g of fat<\/b>, and a total of <b>990 calories<\/b>. It works well as a rather cheap main course. 2 people were glad they tried this recipe. From preparation to the plate, this recipe takes about <b>45 minutes<\/b>. It is brought to you by Foodista. Head to the store and pick up chicken, butter, lemon, and a few other things to make it today. Overall, this recipe earns a <b>solid spoonacular score of 69%<\/b>. Try <a href=\"https:\/\/spoonacular.com\/recipes\/simple-roast-chicken-1253951\">Simple Roast Chicken<\/a>, <a href=\"https:\/\/spoonacular.com\/recipes\/the-best-simple-roast-chicken-1510769\">The Best Simple Roast Chicken<\/a>, and <a href=\"https:\/\/spoonacular.com\/recipes\/simple-roast-chicken-697275\">Simple Roast Chicken<\/a> for similar recipes.",
        "cuisines": [],
        "dishTypes": [
            "lunch",
            "main course",
            "main dish",
            "dinner"
        ],
        "ingredients": [
            "1 large chicken (about 1.2kg)",
            "1\/2 stick of butter, softened",
            "5 cloves of garlic, chopped finely",
            "Rind of two lemons",
            "1 teaspoon chilli flakes",
            "salt and pepper",
            "1\/2 lemon",
            "4 Yukon Gold potatoes, sliced thickly into rounds",
            "2 sweet potatoes, sliced into rounds",
            "pinch of chilli flakes",
            "olive oil"
        ]
    }
}