{
    "version": "1.0",
    "lastUpdated": "2026-01-01",
    "recipe": {
        "title": "Warm Duck Salad With Roasted Beetroot",
        "readyInMinutes": 45,
        "servings": 4,
        "image": "https:\/\/img.spoonacular.com\/recipes\/664960-556x370.jpg",
        "sourceUrl": "https:\/\/www.foodista.com\/recipe\/KD7D3V7L\/warm-duck-salad-with-roasted-beetroot",
        "instructions": "Pre-heat the oven to 200 deg Celsius (400 F).\nStart by roasting the beetroots. Clean the beets of all mud and trim the stems. Wrap each beet tightly in aluminum foil. Place the wrapped beets on a pan and in a 200 deg Celsius oven for 30 to 40mins. They are done when they are very tender.\nWhile the beets are cooking, use a peeler and peel an orange, taking note to get as much of zest and as little of pith (the white parts) as possible. Stack the strips of orange zest and cut into fine strips with a sharp knife. Set aside.\nClean and dry the duck breasts. Score the skin of the duck. Make cuts into the fat layer and take care not to cut into the meat layer. Rub some salt into the skin side only of the duck. Add the duck breasts to a clean and COLD pan. Do not add any oil. Place the pan on the stove and turn the heat to medium.\nAs the pan heats up, the fat from the duck will render off and the skin will brown beautifully. Always keep the heat to between medium to medium-high. Never use high heat as the skin will burn before the duck is cooked through. Once the skin is a gorgeous dark golden brown, flip the duck breasts to the other side and cook for a few more minutes till the other sides are also golden brown. Be careful not to overcook the duck. Set the cooked duck aside and leave to rest covered with foil. Duck, like beef must be rested. The resting time is half that of cooking time. If the duck was cooked for 6 mins, then it should be rested for at least 3 minutes.\nWhile the duck is resting, make the vinaigrette. Squeeze the juice of the zested orange into a bowl. About 5 to 6 tablespoons of juice. Add 2 tablespoons of extra virgin olive oil. Use the best quality one you have. Add 4 teaspoons of balsamic vinegar. Add salt and pepper to taste. Whisk the mixture well. Set aside.\nWhen the beets are done, remove them from the oven and let them cool for a few minutes so that they are easier to hold. Put on some disposable gloves (else get blood red stained fingers later). Open the foil-wrapped beets. Using the rough surface of each piece of foil, rub the beets with the foil to remove the skin. Cut the cooked beets into small pieces. Set aside in a bowl.\nDrizzle 2 tablespoons of vinaigrette into the beets. Add 2 teaspoons of honey. Toss well to coat the beets with the dressing.\nSlice the rested duck into thin slices. The meat should be a beautiful pink.\nServe by layering the salad with greens, nuts and cheese of your choice, and the duck and beets.\nI like rocket greens with fresh basil or mint, mandarin orange segments, toasted almond flakes or pine nuts and some shaved parmesan cheese or some crumbed feta or goats cheese.\nGarnish with the orange zest.\nTrickle the vinaigrette over the salad.\nBest served immediately.",
        "summary": "The recipe Warm Duck Salad With Roasted Beetroot can be made <b>in around 45 minutes<\/b>. This gluten free and primal recipe serves 4 and costs <b>$5.81 per serving<\/b>. This main course has <b>520 calories<\/b>, <b>40g of protein<\/b>, and <b>26g of fat<\/b> per serving. Only a few people made this recipe, and 5 would say it hit the spot. Head to the store and pick up duck breast meat - skin left on, balsamic vinegar, arugula greens, and a few other things to make it today. It is brought to you by Foodista. Overall, this recipe earns a <b>super spoonacular score of 88%<\/b>. If you like this recipe, you might also like recipes such as <a href=\"https:\/\/spoonacular.com\/recipes\/warm-duck-salad-with-roasted-beetroot-1213825\">Warm Duck Salad With Roasted Beetroot<\/a>, <a href=\"https:\/\/spoonacular.com\/recipes\/warm-duck-breast-salad-with-spinach-kalamata-olives-roasted-p-74876\">Warm Duck Breast Salad With Spinach, Kalamatan Olives, Roasted P<\/a>, and <a href=\"https:\/\/spoonacular.com\/recipes\/shukhi-warm-beetroot-mushroom-salad-1086867\">Shukhi – warm beetroot & mushroom salad<\/a>.",
        "cuisines": [],
        "dishTypes": [
            "side dish",
            "lunch",
            "salad",
            "main course",
            "main dish",
            "dinner"
        ],
        "ingredients": [
            "500g ( - 1.1 pound) of duck breast meat (about 2slabs) – skin left on",
            "300g ( - 1\/2 pound +) baby beets or beetroot",
            "zest of 1 orange",
            "2 teaspoons honey",
            "1 teaspoon salt",
            "3 cups of rocket or arugula greens",
            "4 tablespoons of toasted almond flakes or pine nuts",
            "1 can of mandarin orange segments (drained)",
            "Bunch of fresh mint or basil",
            "Shaved parmesan cheese or crumbled goat or feta cheese",
            "Juice of 1 orange (about 6 tablespoons)",
            "2 tablespoons extra virgin olive oil",
            "4 teaspoons balsamic vinegar",
            "salt and pepper to taste"
        ]
    }
}