{
    "version": "1.0",
    "lastUpdated": "2025-11-28",
    "recipe": {
        "title": "Korean Extra Crispy Fried Chicken w Sweet Spicy Glaze",
        "readyInMinutes": 45,
        "servings": 6,
        "image": "https:\/\/img.spoonacular.com\/recipes\/649049-556x370.jpg",
        "sourceUrl": "https:\/\/www.foodista.com\/recipe\/LYJP4NPZ\/korean-extra-crispy-fried-chicken-w-sweet-spicy-glaze",
        "instructions": "1. Cut and discard the end tip of each chicken wing. cut remaining pieces in half at the joint to create 2 pieces. Rinse pieces under cold water and set to dry for at least 10 minutes. In a heavy pot such as a dutch oven, pour in canola or peanut oil to a depth of 3 inches. Heat over medium-high for about 15 minutes or until ready for frying.\n2. In the meantime, combine sauce ingredients of soy, vinegar, sugar, honey, ketchup, sesame oil, Thai chili peppers, and the seasoning in a small sauce pan. Boil until sauce slightly thickens and then set at low heat. Adjust the spiciness\/sweetness of the sauce by adding more minced red peppers and\/or sugar, continuously tasting for desired result.\n3. In a large mixing bowl, mix 1 cup cornstarch and salt and pepper. Individually coat each chicken wing pieces with the cornstarch and set aside.\n4. In another bowl, whisk the remaining cornstarch and water together to make a runny, liquidy batter. Add each chicken wing one at a time and coat well. Shake off excess batter and fry the chicken in batches for about 10~13 minutes, or until golden brown, then drain on paper towels. Do not overcrowd the pan when frying each batch.\n5. Flavor the wings with a brush or by tossing them all together in a mixing bowl. Transfer to a serving plate and garnish with sesame seeds. Enjoy and eat while hot!",
        "summary": "Korean Extra Crispy Fried Chicken w Sweet Spicy Glaze might be a good recipe to expand your main course repertoire. This recipe makes 6 servings with <b>732 calories<\/b>, <b>41g of protein<\/b>, and <b>38g of fat<\/b> each. For <b>$2.27 per serving<\/b>, this recipe <b>covers 20%<\/b> of your daily requirements of vitamins and minerals. Not a lot of people really liked this Southern dish. 7 people were impressed by this recipe. A mixture of ketchup, rice vinegar, cornstarch, and a handful of other ingredients are all it takes to make this recipe so yummy. From preparation to the plate, this recipe takes about <b>45 minutes<\/b>. It is a good option if you're following a <b>gluten free and dairy free<\/b> diet. It is brought to you by Foodista. With a spoonacular <b>score of 44%<\/b>, this dish is good. Similar recipes include <a href=\"https:\/\/spoonacular.com\/recipes\/korean-extra-crispy-fried-chicken-w-sweet-spicy-glaze-1534039\">Korean Extra Crispy Fried Chicken w Sweet Spicy Glaze<\/a>, <a href=\"https:\/\/spoonacular.com\/recipes\/korean-extra-crispy-fried-chicken-w-sweet-spicy-glaze-1532089\">Korean Extra Crispy Fried Chicken w Sweet Spicy Glaze<\/a>, and <a href=\"https:\/\/spoonacular.com\/recipes\/korean-extra-crispy-fried-chicken-649048\">Korean Extra Crispy Fried Chicken<\/a>.",
        "cuisines": [
            "Southern"
        ],
        "dishTypes": [
            "lunch",
            "main course",
            "main dish",
            "dinner"
        ],
        "ingredients": [
            "24 chicken wings, cut into 3 pieces and tips discarded",
            "canola oil, for frying (peanut oil if available)",
            "2 cloves garlic (or garlic powder)",
            "1 cup soy sauce",
            "3, 4 Thai chili peppers, deseeded and finely minced",
            "2 tbsp ketchup",
            "1, 2 tbsp rice vinegar (or cider vinegar)",
            "3 tbsp brown sugar",
            "1 tsp sesame oil",
            "1 tbsp honey",
            "2 cups cornstarch (1 cup coating, 1 cup for batter)",
            "1 cup water",
            "1\/2 tsp salt and pepper",
            "sesame seeds (garnish)"
        ]
    }
}