{
    "version": "1.0",
    "lastUpdated": "2025-11-26",
    "recipe": {
        "title": "Make Olive Garden’s Delicious Pasta Fagioli At Home",
        "readyInMinutes": 45,
        "servings": 20,
        "image": "https:\/\/img.spoonacular.com\/recipes\/650654-556x370.jpg",
        "sourceUrl": "https:\/\/www.foodista.com\/recipe\/3Q2XBWRG\/make-olive-gardens-delicious-pasta-fagioli-at-home",
        "instructions": "Brown beef in a large soup pot.  Drain in a colander in sink.\nIn the same pot, heat the olive oil.  Add the onions, carrots, celery, and garlic and cook for 2 minutes. Stir often.\nAdd the drained beef back to the pot.  Stir in the canned tomatoes, beans, beef broth, spaghetti sauce, zucchini, water, Italian seasonings and pepper.\nBring soup up to a boil.  Turn heat to a simmer, cover and let cook for 50 minutes.\nAdd pasta to the soup.  Cover and cook for about 10 minutes longer until pasta is ready.\nLadle soup into a small bowl or cup.  Top with grated Parmesan cheese, if desired\nMakes 20 cups",
        "summary": "If you want to add more <b>Mediterranean<\/b> recipes to your recipe box, Make Olive Garden’s Delicious Pasta Fagioli At Home might be a recipe you should try. This recipe serves 20. One portion of this dish contains approximately <b>21g of protein<\/b>, <b>10g of fat<\/b>, and a total of <b>285 calories<\/b>. For <b>$1.58 per serving<\/b>, this recipe <b>covers 18%<\/b> of your daily requirements of vitamins and minerals. It works well as a main course. Not a lot of people made this recipe, and 2 would say it hit the spot. From preparation to the plate, this recipe takes roughly <b>45 minutes<\/b>. It is brought to you by Foodista. If you have kidney beans, garlic cloves, excellent northern beans, and a few other ingredients on hand, you can make it. All things considered, we decided this recipe <b>deserves a spoonacular score of 62%<\/b>. This score is good. If you like this recipe, you might also like recipes such as <a href=\"https:\/\/spoonacular.com\/recipes\/olive-garden-pasta-e-fagioli-1347881\">Olive Garden Pastan e Fagioli<\/a>, <a href=\"https:\/\/spoonacular.com\/recipes\/olive-garden-pasta-e-fagioli-1228645\">Olive Garden Pastan e Fagioli<\/a>, and <a href=\"https:\/\/spoonacular.com\/recipes\/olive-garden-pasta-e-fagioli-990430\">Olive Garden Pastan e Fagioli<\/a>.",
        "cuisines": [
            "Mediterranean",
            "Italian",
            "European"
        ],
        "dishTypes": [
            "soup",
            "lunch",
            "main course",
            "main dish",
            "dinner"
        ],
        "ingredients": [
            "1 pound lean ground beef or ground turkey",
            "1 teaspoon olive oil",
            "3 cups onions, chopped",
            "4 carrots, chopped",
            "4 celery stalks, chopped",
            "2 garlic cloves, minced",
            "1 can (28 oz) tomatoes, diced",
            "1 can (16 oz) red kidney beans, rinsed and drained",
            "1 can (16 oz) white kidney beans, rinsed and drained",
            "1 can (16 oz) great northern beans, rinsed and drained",
            "3 cans (10 oz) reduced-sodium beef broth",
            "1 jar (24 oz) spaghetti, marinara, or pasta sauce, we used Prego's Heart Smart",
            "1 zucchini, chopped",
            "2 tablespoons Italian seasoning blend",
            "2 teaspoons fresh ground pepper or to taste",
            "6 ounces whole wheat penne pasta",
            "Grated Parmesan cheese to top each bowl with, optional"
        ]
    }
}