{
    "version": "1.0",
    "lastUpdated": "2025-11-02",
    "recipe": {
        "title": "Pork Chops with Garlic Cream",
        "readyInMinutes": 45,
        "servings": 4,
        "image": "https:\/\/img.spoonacular.com\/recipes\/656752-556x370.jpg",
        "sourceUrl": "https:\/\/www.foodista.com\/recipe\/MMSZLRHM\/pork-chops-with-garlic-cream",
        "instructions": "<ol><li>In a small sauce pan melt the butter over medium-low heat and cook the shallots until softened, about 5 minutes.<\/li><li>Add the wine, thyme and a generous  teaspoon salt. Raise the heat to medium and simmer until the liquid is reduced to 2 tablespoons. Stir in the heavy cream and the buttermilk and all the garlic cloves.<\/li><li>Return to a bare simmer and cook, stirring occasionally, until the garlic is completely tender, 40 to 45 minutes.<\/li><li>Transfer the garlic mixture to a blender and puree until very smooth, about 1 minute. Return the garlic sauce to the saucepan. It should be thick enough to cover the back of a wooden spoon but easy to pour. Set aside covered to keep warm.<\/li><li>Preheat oven to 375.<\/li><li>Salt and pepper generously the pork chops. In a large skillet over medium high heat add the oil. When hot add the chops and sear them on each side. 2minutes each sides.<\/li><li>Remove from the stove and place in the hot oven. Cook for 3 minutes at 375 then lower the heat to 300 for another 5 minutes. The chops need to be springy to the touch and golden brown on the outside.<\/li><\/ol>",
        "summary": "Pork Chops with Garlic Cream might be just the main course you are searching for. This recipe makes 4 servings with <b>728 calories<\/b>, <b>52g of protein<\/b>, and <b>51g of fat<\/b> each. For <b>$3.87 per serving<\/b>, this recipe <b>covers 40%<\/b> of your daily requirements of vitamins and minerals. This recipe is liked by 13 foodies and cooks. A mixture of butter, bell pepper, shallot, and a handful of other ingredients are all it takes to make this recipe so yummy. It is brought to you by Foodista. From preparation to the plate, this recipe takes approximately <b>45 minutes<\/b>. It is a good option if you're following a <b>gluten free and ketogenic<\/b> diet. Overall, this recipe earns a <b>spectacular spoonacular score of 88%<\/b>. If you like this recipe, take a look at these similar recipes: <a href=\"https:\/\/spoonacular.com\/recipes\/garlic-baked-pork-chops-free-pork-chops-1001480\">Garlic Baked Pork Chops + FREE PORK CHOPS<\/a>, <a href=\"https:\/\/spoonacular.com\/recipes\/garlic-roasted-pork-chops-1510299\">Garlic Roasted Pork Chops<\/a>, and <a href=\"https:\/\/spoonacular.com\/recipes\/honey-garlic-pork-chops-116394\">Honey & Garlic Pork Chops<\/a>.",
        "cuisines": [],
        "dishTypes": [
            "lunch",
            "main course",
            "main dish",
            "dinner"
        ],
        "ingredients": [
            "2 tablespoon butter",
            "1\/3 cup buttermilk",
            "1\/3 cup dry white wine",
            "3 sprigs Fresh thyme",
            "1 cup heavy cream",
            "pepper",
            "900 grams pork chops",
            "salt",
            "1 medium shallot, minced",
            "2 tablespoon vegetable oil",
            "12 large garlic cloves, all about the same size, and peeled but left whole"
        ]
    }
}