{
    "version": "1.0",
    "lastUpdated": "2025-09-30",
    "recipe": {
        "title": "Farmer's Strata with Kale and Tomatoes",
        "readyInMinutes": 45,
        "servings": 4,
        "image": "https:\/\/img.spoonacular.com\/recipes\/642596-556x370.jpg",
        "sourceUrl": "https:\/\/www.foodista.com\/recipe\/4ZKH33CK\/farmer-s-strata-with-kale-and-tomatoes",
        "instructions": "<ol><li>Preheat oven to 325 degrees F.<\/li><li>Beat eggs, salt, and pepper, in a medium bowl. Set aside.<\/li><li>Heat oil in a 10\" oven safe skillet over medium heat.<\/li><li>Add mushrooms, green onions, and sliced kale stems to skillet. Saute for 4 minutes.<\/li><li>Add garlic and herbs. Saute for an additional 2 minutes. Herbs will be wilted and the mushrooms are starting to brown.Handful of fresh parsley, chopped (about 3 Tablespoons)<\/li><li>Add layer of kale to mixture. Do not mix in, just lay on top of mushroom and herb mixture.<\/li><li>Add a layer of tomatoes over kale and sprinkle crumbled feta over tomatoes.<\/li><li>Evenly pour eggs over tomatoes and feta. Cook for 5 minutes over medium heat.<\/li><li>As eggs are cooking, lift edges of strata with a spatula allowing eggs in fill in the gaps.<\/li><li>Once bottom of strata begins to brown, transfer to the oven. Cook for 20 minutes, or until eggs are set.<\/li><li>Remove from pan and cut into wedges.<\/li><li>Remove from oven and take strata out of pan with a large spatula. Slice into wedges and serve.<\/li><\/ol>",
        "summary": "Farmer's Strata with Kale and Tomatoes is a main course that serves 4. One portion of this dish contains approximately <b>17g of protein<\/b>, <b>13g of fat<\/b>, and a total of <b>211 calories<\/b>. For <b>$1.67 per serving<\/b>, this recipe <b>covers 31%<\/b> of your daily requirements of vitamins and minerals. 3 people have made this recipe and would make it again. From preparation to the plate, this recipe takes roughly <b>45 minutes<\/b>. It is brought to you by Foodista. A mixture of salt, roma tomatoes, pepper, and a handful of other ingredients are all it takes to make this recipe so delicious. It is a good option if you're following a <b>gluten free, lacto ovo vegetarian, primal, and ketogenic<\/b> diet. Overall, this recipe earns a <b>pretty good spoonacular score of 71%<\/b>. Similar recipes include <a href=\"https:\/\/spoonacular.com\/recipes\/farmers-strata-375520\">Farmer's Strata<\/a>, <a href=\"https:\/\/spoonacular.com\/recipes\/farmers-strata-283662\">Farmer's Strata<\/a>, and <a href=\"https:\/\/spoonacular.com\/recipes\/kale-strata-700077\">Kale Strata<\/a>.",
        "cuisines": [],
        "dishTypes": [
            "lunch",
            "main course",
            "main dish",
            "dinner"
        ],
        "ingredients": [
            "1 teaspoon olive oil or coconut oil",
            "8 eggs",
            "1\/4 cup Feta cheese, crumbled",
            "Handful of fresh cilantro, chopped (about 3 Tablespoons)",
            "Handful of fresh parsley, chopped (about 3 Tablespoons)",
            "2 cloves of garlic, minced",
            "2 green onions, white and green segments sliced",
            "6 large leaves of red kale, chopped and stems removed and sliced",
            "1 cup sliced Shitake mushrooms, about 4-5",
            "1\/8 teaspoon pepper",
            "4 Roma tomatoes, sliced into 1\/4\" slices",
            "2 tablespoons salt"
        ]
    }
}