{
    "version": "1.0",
    "lastUpdated": "2026-01-16",
    "recipe": {
        "title": "Shrimp & Sausage Étouffée",
        "readyInMinutes": 45,
        "servings": 6,
        "image": "https:\/\/img.spoonacular.com\/recipes\/659909-556x370.jpg",
        "sourceUrl": "https:\/\/www.foodista.com\/recipe\/7F7WJGPG\/shrimp-sausage-etouffee",
        "instructions": "<ol><li>Prep everything beforehand. Dice the trinity (onion, celery, bell pepper), mince garlic, season shrimp with salt and pepper, etc.<\/li><li>In a medium-heated heavy pot or dutch oven, fry sliced sausage with a little olive oil and set aside.<\/li><li>In the same pot, add butter and about 1\/4 cup of olive oil. When butter melts, quickly whisk in flour until fully incorporated. Using a wooden spatula, stir continuously (to prevent flour from scorching) until roux is brown, about 10 minutes.<\/li><li>Add trinity and garlic to the mix and cook for another 5 minutes or so. Make sure the roux doesn't stick to the bottom of the pan, so add more oil if you need to.<\/li><li>Now, add the stock to deglaze the pot for a couple of minutes. Then, sprinkle in the Cajun seasoning mix and bring to a boil. Let reduce uncovered, still in medium heat, for about 40 minutes or until liquid reaches a gravy-like consistency.<\/li><li>In the end, stir in the sausage slices and raw shrimp for a couple more minutes. When it returns to boil, turn off heat and re-season accordingly. Let simmer for another 5 minutes before serving.<\/li><li>To serve, plate a bed of rice and smother with etouffee. Garnish liberally with parsley and scallions.<\/li><\/ol>",
        "summary": "Shrimp & Sausage Étouffée might be a good recipe to expand your main course recipe box. One serving contains <b>366 calories<\/b>, <b>30g of protein<\/b>, and <b>21g of fat<\/b>. For <b>$3.14 per serving<\/b>, this recipe <b>covers 21%<\/b> of your daily requirements of vitamins and minerals. This recipe serves 6. 3 people have tried and liked this recipe. A mixture of butter, garlic cloves, bell pepper, and a handful of other ingredients are all it takes to make this recipe so delicious. From preparation to the plate, this recipe takes approximately <b>45 minutes<\/b>. It is brought to you by Foodista. Overall, this recipe earns a <b>good spoonacular score of 61%<\/b>. Try <a href=\"https:\/\/spoonacular.com\/recipes\/chicken-and-sausage-etouffee-113849\">Chicken and Sausage Etouffee<\/a>, <a href=\"https:\/\/spoonacular.com\/recipes\/sausage-and-mushroom-touffe-158788\">Sausage and Mushroom Étouffée<\/a>, and <a href=\"https:\/\/spoonacular.com\/recipes\/shrimp-etouffee-344102\">Shrimp Etouffee<\/a> for similar recipes.",
        "cuisines": [],
        "dishTypes": [
            "lunch",
            "main course",
            "main dish",
            "dinner"
        ],
        "ingredients": [
            "3 Celery Ribs, finely diced",
            "4 Garlic Cloves, minced",
            "1 Green Bell Pepper, finely diced",
            "4 cups low-sodium Chicken Stock",
            "1\/4 cup olive oil",
            "1 Onion, finely diced",
            "Parsley, finely chopped",
            "1 pound Raw Large Shrimp, peeled and seasoned",
            "Salt & Pepper",
            "Scallions, finely chopped",
            "1 teaspoon Cajun Seasoning Mix",
            "1 pound Turkey Sausage, sliced",
            "1\/2 cup Unbleached Flour",
            "2 Tbs. Unsalted Butter"
        ]
    }
}