{
    "version": "1.0",
    "lastUpdated": "2025-04-28",
    "recipe": {
        "title": "Sweet and Spicy Country-Style Ribs",
        "readyInMinutes": 45,
        "servings": 6,
        "image": "https:\/\/img.spoonacular.com\/recipes\/662463-556x370.jpg",
        "sourceUrl": "https:\/\/www.foodista.com\/recipe\/2ZF5G885\/sweet-and-spicy-country-style-ribs",
        "instructions": "Heat the fat in a 6-quart enameled Dutch oven over medium high heat and brown the ribs on all sides.  Pour in the stock; add water to cover if necessary.  Add the vegetable scraps and bring to a boil.  Lower the heat to a simmer, cover and cook for 45 minutes to an hour, or until the ribs are tender.\nWhile the ribs are braising, saute the onions over medium-low heat in a large cast iron skillet until soft; add the garlic and saute for another minute more.  Stir in tomato sauce, vinegar, honey, pepper or hot sauce, cayenne pepper, chili chili powder, salt and dry mustard. Bring the mixture to a boil, then reduce heat and simmer, uncovered for 25 minutes, stirring occasionally.\nWhen the ribs are tender, remove them from the braising liquid and add them to the spicy tomato sauce in the pan.  Raise the heat and cook, stirring frequently, until the sauce has glazed the ribs, about 10 minutes.  Serve with the remaining sauce on the side, if desired.",
        "summary": "Sweet and Spicy Country-Style Ribs might be a good recipe to expand your main course repertoire. One portion of this dish contains about <b>25g of protein<\/b>, <b>20g of fat<\/b>, and a total of <b>506 calories<\/b>. This gluten free recipe serves 6 and costs <b>$3.31 per serving<\/b>. Head to the store and pick up beef stock, honey, butter, and a few other things to make it today. 3 people found this recipe to be scrumptious and satisfying. It is brought to you by Foodista. From preparation to the plate, this recipe takes around <b>45 minutes<\/b>. Overall, this recipe earns a <b>good spoonacular score of 46%<\/b>. Try <a href=\"https:\/\/spoonacular.com\/recipes\/sweet-and-sour-country-style-ribs-487238\">Sweet and Sour Country Style Ribs<\/a>, <a href=\"https:\/\/spoonacular.com\/recipes\/sweet-n-spicy-country-ribs-397391\">Sweet 'n' Spicy Country Ribs<\/a>, and <a href=\"https:\/\/spoonacular.com\/recipes\/country-style-ribs-146904\">Country Style Ribs<\/a> for similar recipes.",
        "cuisines": [],
        "dishTypes": [
            "lunch",
            "main course",
            "main dish",
            "dinner"
        ],
        "ingredients": [
            "2 pounds country-style pork ribs or beef short ribs",
            "2 tablespoons lard (pork), tallow, or vegetable oil (",
            "1 small yellow onion, finely chopped",
            "1 clove garlic, minced",
            "2 tablespoons unsalted butter",
            "1 1\/2 cups tomato sauce",
            "cup apple cider vinegar",
            "cup honey",
            "1 tablespoon bottled pepper sauce or hot sauce (I used Sriracha)",
            "2 teaspoons cayenne pepper",
            "2 teaspoons ancho chili powder",
            "1\/2 teaspoon salt",
            "1\/2 teaspoon dry mustard",
            "vegetable scraps – carrot, onion, ce",
            "2 cups chicken or beef stock, preferably homemade",
            "water to cover, if needed"
        ]
    }
}