{
    "version": "1.0",
    "lastUpdated": "2025-09-21",
    "recipe": {
        "title": "Herb chicken with sweet potato mash and sautéed broccoli",
        "readyInMinutes": 45,
        "servings": 4,
        "image": "https:\/\/img.spoonacular.com\/recipes\/646651-556x370.jpg",
        "sourceUrl": "https:\/\/www.foodista.com\/recipe\/NHZKT2K8\/serve-a-sensationally-seasoned-chicken-dish",
        "instructions": "<ol><li> Preheat the oven to 350F (180C) or 320F (160C) for convection oven and cook the chicken according to the pack instructions.<\/li><li> About 15 minutes before the end of the chicken cooking time, place the diced potato into boiling water for 5 minutes, then add the sweet potato and cook until the potatoes are tender. Roughly mash, adding butter, salt, and pepper to taste, then mash thoroughly.<\/li><li> Heat the oil in a pan and quickly saut the broccoli until tender. Cover to keep warm.<\/li><li> Remove the chicken from the oven, leave to cool for a minute then cut the bag open and gently tip the contents into a dish.<\/li><li> Slice the chicken breasts into chunky pieces on a board, keeping the chicken breast shape together.<\/li><li> Serve the mash potato topped with the chicken and remaining sauce with a side of broccoli.<\/li><\/ol>",
        "summary": "Herb chicken with sweet potato mash and sautéed broccoli might be a good recipe to expand your main course recipe box. One portion of this dish contains roughly <b>47g of protein<\/b>, <b>25g of fat<\/b>, and a total of <b>710 calories<\/b>. For <b>$3.13 per serving<\/b>, this recipe <b>covers 50%<\/b> of your daily requirements of vitamins and minerals. This recipe serves 4. 9 people have made this recipe and would make it again. Head to the store and pick up broccoli, butter, pepper and salt, and a few other things to make it today. It is a good option if you're following a <b>gluten free<\/b> diet. It is brought to you by Foodista. From preparation to the plate, this recipe takes around <b>45 minutes<\/b>. Taking all factors into account, this recipe <b>earns a spoonacular score of 95%<\/b>, which is awesome. Try <a href=\"https:\/\/spoonacular.com\/recipes\/herb-chicken-with-sweet-potato-mash-and-sauted-broccoli-1263701\">Herb chicken with sweet potato mash and sautéed broccoli<\/a>, <a href=\"https:\/\/spoonacular.com\/recipes\/herb-chicken-with-sweet-potato-mash-and-sauted-broccoli-1516743\">Herb chicken with sweet potato mash and sautéed broccoli<\/a>, and <a href=\"https:\/\/spoonacular.com\/recipes\/herb-chicken-with-sweet-potato-mash-and-sauted-broccoli-1337501\">Herb chicken with sweet potato mash and sautéed broccoli<\/a> for similar recipes.",
        "cuisines": [],
        "dishTypes": [
            "lunch",
            "main course",
            "main dish",
            "dinner"
        ],
        "ingredients": [
            "1 medium head of broccoli, cut into florets",
            "1 x pack Maggi So Juicy Mixed Herbs",
            "1\/4 cup olive oil (60 mL)",
            "1 large Russet potato, peeled and diced",
            "Freshly ground black pepper and salt",
            "1 1\/2 pounds of boneless, skinless chicken breasts",
            "3 large sweet potatoes, peeled and diced",
            "2 tablespoons Chilled unsalted butter"
        ]
    }
}