{
    "version": "1.0",
    "lastUpdated": "2025-10-11",
    "recipe": {
        "title": "Spiced Chicken With Risotto, Wild Mushroom Cognac Cream, and Pan-Seared Ramps",
        "readyInMinutes": 45,
        "servings": 2,
        "image": "https:\/\/img.spoonacular.com\/recipes\/660944-556x370.jpg",
        "sourceUrl": "https:\/\/www.foodista.com\/recipe\/JQPV5YW8\/spiced-chicken-with-risotto-wild-mushroom-cognac-cream-and-pan-seared-ramps",
        "instructions": "I prep my vegetables first  starting by peeling, halving, and slicing my strangely oblong shallot thinly, into variegated half-moons.\nThen I wash the roots of my ramps, which are tender baby shallots, shot through with vibrant purple, topped with leafy greens, and tipped with firm white bulbs.\nI trim off the ends, then cut the green leaves from the pinkywhite stalks.  They release a sweetly oniony aroma  not pungent, but thoroughly vegetal.  I set these lengths of green goodness aside.\nIts time to prepare my mushrooms, which I wash and dry thoroughly to remove all the silt and dirt clinging to their tender stalks.  This strange twin shitake reminded me of Quatto from Total Recall (one of my favorite go-to-on-a-rainy-Sunday-afternoon sci-fi movies)  I sliced them thinly and lengthwise.\nI also have some delicate, creamy oyster mushrooms.  They naturally spring from the same root, bifurcating and trifurcating at their supple elbows and knobby knees, exploding into flowering trumpets from their several sets of shoulders and their outcurling heads.  I nip these into individuals, respecting their natural tubular shapes.\nI melt two tablespoons of butter in my wok and add half my shallots, stirring to coat, scent, and soften.  I add a dash of salt and pepper, and sautee.\nI dump in my sliced mushrooms, including my baby bellas (which I bought sliced  which were cheaper, I admit, than whole  but frankly just as good), and I toss well with the butter and soft shallots.  I set the heat to low, and  tossing regularly  I let the mushrooms reduce, release their liquids, and simmer in their own rich brown juices.  On the right heat setting, this can take as long as you need it to  which, for me, is about 20 minutes.\nMeanwhile, I have all my other heat sources going, too: on one, I have a quart of chicken stock simmering on low; on another, a few glugs of EVOO and the rest of my shallots over medium heat; on the final eye, I have two more glugs of EVOO simmering on high heat, onto which Ive placed my\nChicken legs, onto which Ive sprinkled sea salt, cracked black pepper, paprika, cayenne pepper, and granulated garlic, and which I then sear\nOn both sides in hot EVOO in my large skillet.  After each side has crisped a bit, I place this into a 350 degree oven for the next 15-20 minutes.\nI dump my arborio rice into the pan thats been softening the remainder of my shallots in EVOO.  By stirring the pot well, I coat each plump grain with hot fat, toasting their outsides, readying them for the absorption of the warms liquids Im soon to introduce.\nI then add about a cup of white wine.  Its not exact  I just sort of douse the pan with wine, not fully covering my rice, but also not being too cheap.  About a cup  which I stir well, over low heat, allowing all the moisture to be sucked in by the starchy rice grains.\nOnce the wine is absorbed, and stirring the pan means revealing its stainless steel surface, I add 4oz of my warm chicken stock.  For risotto, you have to add already hot liquids to the already hot rice, which promotes absorption, and which  when stirred well, as most traditional risottos require  releases the binding strings of starch from the dried rice kernels, creating the creamy texture and toothsome consistency of Italys most homey staple.\nThe technique?  Add 4oz of hot stock every time the previous 4oz I added has absorbed into the rice, then I add another scoop.  And I stir, and stir, and stir constantly.\nWhen the opaque white center of my rice kernels has disappeared, I try a nibble, continuing to cook until there is no hard starch left in the center of any random sample.\nMeanwhile, my mushrooms have simmered down to at least 1\/2 their original volume, and Im ready to add their final flavorings.\nCognac (this is a nip; but looks big,  right?  I use 1\/2 of it, so 25 ml.), and\nHeavy cream  about a cup.  I set the heat to low simmer.\nClayton bought me a lovely jar of fennel salt, which I added to this mixture to flavor it.  You could substitute ground fennel or fennel seeds, onion powder, and fine ground sea salt instead.  I stir this well, flavoring to taste, and set to simmer while the rest of dinner finishes.  This can hold for some time, if need be  just stir occasionally, continuing to coat each shroom slice with sweet sweet moisturizing cream.\nFinally, on the back eye (which has freed up, since all my stock is absorbed in my risotto), Ive set my small skillet to high heat, and have brought some EVOO to sizzling.  I add first my white ramp stalks, tossing them in the hot oil, searing and browning their delicate bodies.  After a few  beats, I add the leaves themselves, also tossing well, and also allowing them to sear in the hot, nutty oil, crisping on the edges, becoming more delicious by the moment.\nAs my ramps sizzle, I grate about a cup of my hard Italian cheese into my ready (tender to the tongue) risotto, and add about a cup of chopped parsley.  Now my rice is super creamy, very flavorful, snappy with green and salty with cheese, and ready to mold as a base for my plate.\nFinally, I add my chopped chives  our gardens first harvest of the season!  to my cream cognac mushroom sauce, adding just the green savory freshness to this rich earthiness.\nCreamy craggy mounds of parsley parmeggiano risotto support supple, spicy, crisp-skinned legs of savory chicken, and are surrounded by tender, toothsome, rich and complex creamy cognac mushrooms, and topped with garden-snappy spring leeks, sharpened with EVOO and sea salt.  A full-bellied beautiful meal, a mouthful of stick-to-your-ribs tenderichearthiness, a nest of wholesome goodness uniting ground, air, marshland and kitchen garden, the chicken and the cow, the simple and the rich.  Enjoy this dinner, my friends.  I recommend it as salve for the soul.",
        "summary": "If you want to add more <b>gluten free<\/b> recipes to your recipe box, Spiced Chicken With Risotto, Wild Mushroom Cognac Cream, and Pan-Seared Ramps might be a recipe you should try. This recipe serves 2. For <b>$7.73 per serving<\/b>, this recipe <b>covers 54%<\/b> of your daily requirements of vitamins and minerals. One portion of this dish contains around <b>48g of protein<\/b>, <b>57g of fat<\/b>, and a total of <b>1227 calories<\/b>. This recipe is liked by 3 foodies and cooks. It is a <b>pricey<\/b> recipe for fans of Mediterranean food. Head to the store and pick up sea salt, fennel salt, parmigiano-reggiano, and a few other things to make it today. It works well as a main course. From preparation to the plate, this recipe takes approximately <b>45 minutes<\/b>. It is brought to you by Foodista. Overall, this recipe earns a <b>solid spoonacular score of 79%<\/b>. If you like this recipe, you might also like recipes such as <a href=\"https:\/\/spoonacular.com\/recipes\/pan-seared-chicken-with-a-wild-mushroom-thyme-sauce-609311\">Pan Seared Chicken with a Wild Mushroom Thyme Sauce<\/a>, <a href=\"https:\/\/spoonacular.com\/recipes\/pan-seared-chicken-breasts-in-a-mushroom-tarragon-and-mustard-pan-sauce-248208\">Pan Seared Chicken Breasts in a Mushroom, Tarragon and Mustard Pan Sauce<\/a>, and <a href=\"https:\/\/spoonacular.com\/recipes\/pan-seared-chicken-breasts-in-a-mushroom-tarragon-and-mustard-pan-sauce-1274199\">Pan Seared Chicken Breasts in a Mushroom, Tarragon and Mustard Pan Sauce<\/a>.",
        "cuisines": [
            "Mediterranean",
            "Italian",
            "European"
        ],
        "dishTypes": [
            "lunch",
            "main course",
            "main dish",
            "dinner"
        ],
        "ingredients": [
            "2 chicken quarters (these are leg\/thighs)",
            "1 cup arborio rice",
            "1 shallot",
            "3 ounces shitake mushrooms",
            "3 ounces oyster mushrooms",
            "6 ounces baby bella mushrooms",
            "fresh, garden cut chives",
            "8 ramps (a.k.a. tender baby leeks)",
            "Parmigiano-Reggiano",
            "heavy cream",
            "white wine",
            "fresh chopped parsley",
            "fennel salt",
            "sea salt",
            "cracked black pepper",
            "cayenne pepper",
            "paprika",
            "EVOO",
            "butter"
        ]
    }
}