{
    "version": "1.0",
    "lastUpdated": "2025-08-21",
    "recipe": {
        "title": "Basil Marinated Grilled Chicken",
        "readyInMinutes": 45,
        "servings": 8,
        "image": "https:\/\/img.spoonacular.com\/recipes\/634434-556x370.jpg",
        "sourceUrl": "https:\/\/www.foodista.com\/recipe\/6FPGHLSQ\/basil-marinated-grilled-chicken",
        "instructions": "Mince garlic in a food processor, then add basil and process until roughly chopped.\nDrizzle in olive oil until a thin ketchup consistency is achieved. Add salt and whirl for 5 seconds to combine.\nPlace chicken in a baking dish and pour marinade over chicken, turning pieces to coat evenly. Cover and refrigerate for 4 hours.\nGrill over medium high heat until cooked through, about 8 minutes per side.",
        "summary": "Basil Marinated Grilled Chicken is a <b>gluten free, dairy free, paleolithic, and primal<\/b> recipe with 8 servings. One serving contains <b>309 calories<\/b>, <b>48g of protein<\/b>, and <b>11g of fat<\/b>. For <b>$2.59 per serving<\/b>, this recipe <b>covers 25%<\/b> of your daily requirements of vitamins and minerals. Head to the store and pick up garlic, chicken breasts, salt, and a few other things to make it today. 11 person have tried and liked this recipe. It will be a hit at your <b>The Fourth Of July<\/b> event. It works well as a rather cheap main course. It is brought to you by Foodista. From preparation to the plate, this recipe takes roughly <b>45 minutes<\/b>. Taking all factors into account, this recipe <b>earns a spoonacular score of 80%<\/b>, which is excellent. Try <a href=\"https:\/\/spoonacular.com\/recipes\/basil-marinated-grilled-chicken-1380155\">Basil Marinated Grilled Chicken<\/a>, <a href=\"https:\/\/spoonacular.com\/recipes\/basil-marinated-grilled-chicken-1255469\">Basil Marinated Grilled Chicken<\/a>, and <a href=\"https:\/\/spoonacular.com\/recipes\/all-purpose-lemon-basil-marinated-chicken-1202589\">All Purpose Lemon Basil Marinated Chicken<\/a> for similar recipes.",
        "cuisines": [],
        "dishTypes": [
            "lunch",
            "main course",
            "main dish",
            "dinner"
        ],
        "ingredients": [
            "4 cloves garlic",
            "2 cups lightly packed basil leaves",
            "cup extra virgin olive oil, about ½",
            "1\/2 teaspoon salt",
            "8 boneless chicken breasts, patted dry so the marinade wil"
        ]
    }
}