{
    "version": "1.0",
    "lastUpdated": "2025-09-27",
    "recipe": {
        "title": "Brown Butter Twice Baked Sweet Potatoes",
        "readyInMinutes": 95,
        "servings": 4,
        "image": "https:\/\/img.spoonacular.com\/recipes\/715544-556x370.jpg",
        "sourceUrl": "https:\/\/www.pinkwhen.com\/brown-butter-twice-baked-sweet-potatoes\/",
        "instructions": "<p>Preheat your oven to 400 degrees F. Poke your sweet potatoes with a fork and place them directly on the rack of your oven. Place a piece of foil on the rack below to reduce mess. Bake the sweet potatoes for 45-50 minutes or until tender. Times may vary depending on how hot your oven gets.Remove the potatoes from the oven and let stand at room temperature until they are cool enough to handle, about 20-30 minutes. Leave the oven on.While your potatoes are cooling, melt the butter over medium heat. Continue to cook the butter, stirring frequently, until brown bits begin to form on the bottom of the pan, about 5-6 minutes. Pay close attention as the butter can quickly go from brown to burnt in a matter of seconds. Once you see the brown bits forming and a nutty aroma fills the air, pull the butter from the heat immediately. Set aside.Cut the tops off of the sweet potatoes, lengthwise. Scoop the sweet potato flesh into a medium bowl, leaving the skins in tact. To the bowl, add the brown butter, 2 tablespoons of the fresh parsley, 3\/4 of the chopped bacon, and 4 ounces of the goats cheese. Sprinkle with salt and black pepper to taste and mash the ingredients together until combined. Scoop the filling back into the sweet potatoes.Place the potatoes on a baking sheet that has been lined with foil or parchment paper. Place them back in the oven to bake for 25 minutes.While your potatoes are baking for a second time, prepare your avocado cream. In the bowl of your food processor or blender, combine the avocados, sour cream and buttermilk. Add a dash of salt and pepper and pulse until completely smooth and creamy.Once your potatoes have baked, remove from oven. Sprinkle on the remaining parsley, bacon and goats cheese. Drizzle with avocado cream and serve immediately.Enjoy!I hope you enjoy this recipe for brown butter twice baked sweet potatoes!<\/p>",
        "summary": "The recipe Brown Butter Twice Baked Sweet Potatoes can be made <b>in about 1 hour and 35 minutes<\/b>. Watching your figure? This gluten free and primal recipe has <b>677 calories<\/b>, <b>19g of protein<\/b>, and <b>44g of fat<\/b> per serving. This recipe serves 4 and costs $3.56 per serving. 8242 people have tried and liked this recipe. This recipe from Pink When requires goat's cheese, sweet potatoes, bacon, and butter. It works well as a main course. All things considered, we decided this recipe <b>deserves a spoonacular score of 94%<\/b>. This score is super. Similar recipes include <a href=\"https:\/\/spoonacular.com\/recipes\/twice-baked-sweet-potatoes-with-brown-sugar-pecans-489041\">Twice Baked Sweet Potatoes {with Brown Sugar & Pecans}<\/a>, <a href=\"https:\/\/spoonacular.com\/recipes\/maple-brown-butter-mashed-sweet-potatoes-828414\">Maple Brown Butter Mashed Sweet Potatoes<\/a>, and <a href=\"https:\/\/spoonacular.com\/recipes\/maple-brown-butter-roasted-sweet-potatoes-1571611\">Maple Brown Butter Roasted Sweet Potatoes<\/a>.",
        "cuisines": [],
        "dishTypes": [
            "lunch",
            "main course",
            "main dish",
            "dinner"
        ],
        "ingredients": [
            "2 very ripe avocados, pitted and skins removed",
            "2 tablespoons buttermilk",
            "4 strips of bacon, cooked until crisp and chopped",
            "1\/4 cup fresh parsley, chopped",
            "6 ounces goat's cheese, crumbled",
            "salt and black pepper",
            "1\/2 cup sour cream (plain Greek yogurt may be substituted)",
            "4 medium sweet potatoes",
            "6 tablespoons unsalted butter"
        ]
    }
}