{
    "version": "1.0",
    "lastUpdated": "2025-10-30",
    "recipe": {
        "title": "Pasta With Chicken and Mushrooms",
        "readyInMinutes": 45,
        "servings": 6,
        "image": "https:\/\/img.spoonacular.com\/recipes\/654913-556x370.jpg",
        "sourceUrl": "https:\/\/www.foodista.com\/recipe\/6QZ47BPL\/pasta-with-chicken-and-mushrooms",
        "instructions": "<ol><li>Bring 6 quarts of salted water to a rolling boil in a large pot. Season the flour with salt and pepper. Dredge the chicken in the seasoned flour.<\/li><li>Shake off any excess. Heat the oil in a large, heavy non-stick skillet over high heat. Brown the chicken on one side (about 3 minutes). Add the garlic. Turn the chicken. Scatter the mushrooms over the chicken. Cook for 3 minutes, shaking the skillet to distribute the mushrooms. Add the vinegar, broth, bay leaves, and thyme. Cover the skillet lightly. Cook, over medium heat for 10 minutes, turning the chicken once. Uncover.<\/li><li>Transfer the chicken to a warm plate. Cover with foil. Continue cooking the mushrooms for another 7 minutes. Cook the pasta, stirring frequently, in the boiling salted water until al dente.Drain. Place on a warm serving plate. Arrange the chicken pieces over the pasta. Remove the bay leaf from the sauce. Pour the mushroom sauce over the chicken and pasta. Serve.<\/li><\/ol>",
        "summary": "Pasta With Chicken and Mushrooms might be just the main course you are searching for. This recipe serves 6 and costs $1.75 per serving. Watching your figure? This dairy free recipe has <b>463 calories<\/b>, <b>36g of protein<\/b>, and <b>6g of fat<\/b> per serving. Head to the store and pick up chicken broth, olive oil, chicken breast halves, and a few other things to make it today. This recipe is liked by 2 foodies and cooks. It is brought to you by Foodista. From preparation to the plate, this recipe takes roughly <b>45 minutes<\/b>. Overall, this recipe earns a <b>good spoonacular score of 67%<\/b>. Users who liked this recipe also liked <a href=\"https:\/\/spoonacular.com\/recipes\/pasta-with-chicken-and-mushrooms-1398593\">Pasta With Chicken and Mushrooms<\/a>, <a href=\"https:\/\/spoonacular.com\/recipes\/penne-pasta-with-chicken-and-mushrooms-655582\">Penne Pasta With Chicken And Mushrooms<\/a>, and <a href=\"https:\/\/spoonacular.com\/recipes\/chicken-piccata-with-pasta-mushrooms-1326243\">Chicken Piccata with Pasta & Mushrooms<\/a>.",
        "cuisines": [],
        "dishTypes": [
            "side dish",
            "lunch",
            "main course",
            "main dish",
            "dinner"
        ],
        "ingredients": [
            "1\/4 cup Balsamic Vinegar",
            "1 bay leaf",
            "6 Chicken Breast Halves, skinned & boned",
            "2 cups chicken broth",
            "1\/4 cup flour",
            "1 pound Linguini, uncooked",
            "1\/2 pound mushrooms, sliced",
            "2 teaspoons olive oil",
            "1\/2 teaspoon pepper",
            "1\/4 teaspoon salt",
            "1\/4 teaspoon Thyme"
        ]
    }
}