{
    "version": "1.0",
    "lastUpdated": "2025-09-26",
    "recipe": {
        "title": "Spaghetti With Pesto Trapanese",
        "readyInMinutes": 45,
        "servings": 6,
        "image": "https:\/\/img.spoonacular.com\/recipes\/660835-556x370.jpg",
        "sourceUrl": "https:\/\/www.foodista.com\/recipe\/VWV2WXBJ\/spaghetti-with-pesto-trapanese",
        "instructions": "Place a large (this is key) pot of water to boil. Salt when it boils, not before.\nMeanwhile, make the pesto: In a mortar (or use a food processor with a blade) pound together the oil, almonds and pine-nuts. Add the garlic, 2 ice cubes and the rest of the ingredients, pounding quickly to make a paste.You want to leave a bit of a texture for crunch.\nCook the pasta al dente, as per directions, drain and reserve some of the boiling water. Toss the pasta with the pesto, using some of the reserved water to make it creamier. Grate some fresh pecorino or ricotta salata (or both) over and serve hot with a leaf of basil to garnish.",
        "summary": "Spaghetti With Pesto Trapanese is a <b>lacto ovo vegetarian<\/b> recipe with 6 servings. For <b>$1.46 per serving<\/b>, this recipe <b>covers 19%<\/b> of your daily requirements of vitamins and minerals. One serving contains <b>433 calories<\/b>, <b>14g of protein<\/b>, and <b>15g of fat<\/b>. Not a lot of people made this recipe, and 4 would say it hit the spot. Head to the store and pick up spaghetti, almonds, pine nuts, and a few other things to make it today. It works best as a main course, and is done in around <b>45 minutes<\/b>. It is brought to you by Foodista. All things considered, we decided this recipe <b>deserves a spoonacular score of 86%<\/b>. This score is tremendous. Try <a href=\"https:\/\/spoonacular.com\/recipes\/spaghetti-with-pesto-trapanese-530919\">Spaghetti with Pesto Trapanese<\/a>, <a href=\"https:\/\/spoonacular.com\/recipes\/pasta-con-il-pesto-alla-trapanese-tomato-and-almond-pesto-1219115\">Pasta con il pesto alla Trapanese (Tomato and almond pesto)<\/a>, and <a href=\"https:\/\/spoonacular.com\/recipes\/pasta-con-il-pesto-alla-trapanese-tomato-and-almond-pesto-218612\">Pasta con il pesto alla Trapanese (Tomato and almond pesto)<\/a> for similar recipes.",
        "cuisines": [],
        "dishTypes": [
            "side dish",
            "lunch",
            "main course",
            "main dish",
            "dinner"
        ],
        "ingredients": [
            "1 pound spaghetti",
            "1\/2 cup (80 gr) almonds (if you can get the Sicilian ones from Noto they are wonderful)",
            "1\/4 cup (30 gr) pine nuts",
            "1\/2 cup (100 gr) extra virgin olive oil",
            "3 garlic cloves",
            "2 tomatoes, peeled and seeded",
            "2 1\/2 cups (60 gr) basil",
            "Salt and pepper as needed",
            "Ricotta salata or pecorino, to be grated fresh over the past"
        ]
    }
}