{
    "version": "1.0",
    "lastUpdated": "2026-01-14",
    "recipe": {
        "title": "Venison Stew",
        "readyInMinutes": 45,
        "servings": 7,
        "image": "https:\/\/img.spoonacular.com\/recipes\/664786-556x370.jpg",
        "sourceUrl": "https:\/\/www.foodista.com\/recipe\/JJ7SSGCX\/venison-stew",
        "instructions": "Cut all ingredients into 1 inch pieces. Dredge venison with flour and spices. Brown venison in hot vegetable oil. Boil and simmer venison 2 hours with beef bouillon and water. Add remaining ingredients and simmer for 1\/2 hour. Mix 3 tablespoons flour and 1 cup cold water and add to stew to thicken.",
        "summary": "Venison Stew is a <b>dairy free<\/b> main course. This recipe serves 7. One serving contains <b>316 calories<\/b>, <b>32g of protein<\/b>, and <b>7g of fat<\/b>. For <b>$2.02 per serving<\/b>, this recipe <b>covers 30%<\/b> of your daily requirements of vitamins and minerals. It can be enjoyed any time, but it is especially good for <b>Autumn<\/b>. 3 people found this recipe to be tasty and satisfying. Head to the store and pick up venison stew meat, baby carrots, bell pepper, and a few other things to make it today. From preparation to the plate, this recipe takes roughly <b>45 minutes<\/b>. It is brought to you by Foodista. All things considered, we decided this recipe <b>deserves a spoonacular score of 86%<\/b>. This score is tremendous. Similar recipes include <a href=\"https:\/\/spoonacular.com\/recipes\/venison-bourguignon-venison-stew-147886\">Venison Bourguignon (Venison Stew)<\/a>, <a href=\"https:\/\/spoonacular.com\/recipes\/venison-stew-629599\">Venison Stew<\/a>, and <a href=\"https:\/\/spoonacular.com\/recipes\/venison-stew-404173\">Venison Stew<\/a>.",
        "cuisines": [],
        "dishTypes": [
            "lunch",
            "soup",
            "main course",
            "main dish",
            "dinner"
        ],
        "ingredients": [
            "2 pounds venison stew meat, cut in cubes",
            "Spices: onion salt, 8 cups water 4 pieces large potatoes 1 piece large onion 4 pieces carrots or baby carrots 4 stalks celery 1 can mushrooms 1 piece green pepper 1 cup flour and 3 tbsp 2 tablespoons beef bouillon",
            "8 cups water",
            "4 pieces large potatoes",
            "1 piece large onion",
            "4 pieces carrots or baby carrots",
            "4 stalks celery",
            "1 can mushrooms",
            "1 piece green pepper",
            "1 cup flour and 3 tbsp",
            "2 tablespoons beef bouillon"
        ]
    }
}