{
    "version": "1.0",
    "lastUpdated": "2025-12-17",
    "recipe": {
        "title": "Shrimp and Avocado Salad",
        "readyInMinutes": 45,
        "servings": 4,
        "image": "https:\/\/img.spoonacular.com\/recipes\/659927-556x370.jpg",
        "sourceUrl": "https:\/\/www.foodista.com\/recipe\/ZTNWCWQP\/shrimp-and-avocado-salad",
        "instructions": "1.Firstly, to cook the shrimp, heat the olive oil in a pan and once hot add the shrimp crushed garlic and chili flakes. It is important to get the oil nice and hot (not smoking, just before that point) your shrimp should sizzle when added to the pan. Check the back of the shrimp and when you see the colour change about half way up, turn them over. Do the same on the other side. This should only take a minute to two minutes maximum on both sides  otherwise you will get a rubbery result if you leave it too long. Squeeze over the lime juice  this too should bubble and reduce. Add a little salt and pepper, stir through, remove from the heat and set aside.\n2.Mix the dressing ingredients together, check for flavour, adjust if need be and set aside.\n3.Place all the salad ingredients in a bowl except the avocado and the salt and pepper. Prepare the avocado as you are about to serve otherwise it will turn brown. Once it is covered in the lime dressing, this will slow down the oxidization process and it wont go brown so easily.\n4.When you are ready to serve mix  of the avocado through the salad and add the dressing. Toss everything together. Taste to see if you need any salt and pepper. Place your shrimp on top of the salad with the rest of the avocado and sprinkle\/pour any residue from the pan over your salad in which you cooked the shrimp. This is great flavour, so you dont want to lose it.",
        "summary": "Need a <b>gluten free, dairy free, and pescatarian main course<\/b>? Shrimp and Avocado Salad could be an awesome recipe to try. This recipe serves 4 and costs $11.57 per serving. One portion of this dish contains about <b>34g of protein<\/b>, <b>37g of fat<\/b>, and a total of <b>639 calories<\/b>. From preparation to the plate, this recipe takes about <b>45 minutes<\/b>. This recipe is liked by 8 foodies and cooks. This recipe from Foodista requires the shrimp, salt and pepper, garlic cloves, and the dressing. All things considered, we decided this recipe <b>deserves a spoonacular score of 86%<\/b>. This score is outstanding. If you like this recipe, take a look at these similar recipes: <a href=\"https:\/\/spoonacular.com\/recipes\/shrimp-corn-california-avocado-pasta-salad-a-ca-avocado-trip-584558\">Shrimp, Corn & Californian Avocado Pasta Salad & a CAn Avocado Trip<\/a>, <a href=\"https:\/\/spoonacular.com\/recipes\/shrimp-corn-california-avocado-pasta-salad-a-ca-avocado-trip-1236119\">Shrimp, Corn & Californian Avocado Pasta Salad & a CAn Avocado Trip<\/a>, and <a href=\"https:\/\/spoonacular.com\/recipes\/shrimp-corn-california-avocado-pasta-salad-a-ca-avocado-trip-1219445\">Shrimp, Corn & Californian Avocado Pasta Salad & a CAn Avocado Trip<\/a>.",
        "cuisines": [],
        "dishTypes": [
            "side dish",
            "lunch",
            "main course",
            "salad",
            "main dish",
            "dinner"
        ],
        "ingredients": [
            "The Shrimp",
            "About 600gr of large tiger style shrimp (prawns\/langoustine) peeled and cleaned",
            "2 x garlic cloves, crushed",
            "1 x tbsp olive oil",
            "Juice of 1 lime",
            "Salt and Pepper",
            "The Salad",
            "The leaves of 1 medium Cos lettuce finely shredded",
            "6\/8 basil leaves chopped",
            "200gr sweet corn",
            "3 x spring onions (scallions) chopped finely",
            "600gr fresh pineapple cut into small cubes",
            "2 x avocados chopped into cubes",
            "Avocado",
            "The Dressing",
            "3 x tbsp olive oil",
            "3 x tbsp honey",
            "Juice and zest of 3 limes"
        ]
    }
}