{
    "version": "1.0",
    "lastUpdated": "2025-12-04",
    "recipe": {
        "title": "Polenta gnocchi with savoy cabbage and cheese",
        "readyInMinutes": 45,
        "servings": 2,
        "image": "https:\/\/img.spoonacular.com\/recipes\/656544-556x370.jpg",
        "sourceUrl": "http:\/\/www.foodista.com\/recipe\/WWSDXGJH\/polenta-gnocchi-with-savoy-cabbage-and-cheese",
        "instructions": "<ol><li>Put the cold precooked polenta in a mixer and blend it with the egg until creamy.<\/li><li>Add the buckwheat flour. You will need more or less 1\/3 of a cup, but a lot depends on how sticky your polenta. Add enough flour to get a soft dough that doesn't stick to your hand.<\/li><li>Form the gnocchi on a floured surface by rolling out the dough in long logs, more or less as thick as a thumb and then cut them in gnocchi. If you want the gnocchi to look super nice, roll them on a fork to give them the characteristic stripes (I never do). Place the gnocchi in the fridge while you prepare the sauce.<\/li><li>Cut the savoy cabbage in stripes, wash it and stew it with a bit of water until wilted. Drain it and sautee it with 1 spoon butter and salt until cooked.<\/li><li>Prepare the cheese by dicing it and the rest of the butter by melting it with the sage and the garlic.<\/li><li>Cook the gnocchi in salted boiling water in batches. Throw 10-20 gnocchi in the pot of boiling water and fish them out once they start floating. Drain them and add them to a bowl. Dress with cheese, cabbage and butter and keep layering the ingredients in the bowl until you run out.<\/li><li>Do not mix the gnocchi in the bowl, as they are rather soft and would break. If the cheese didn't melt much, you can microwave the bowl for a couple of minutes.<\/li><li>Serve piping hot.<\/li><\/ol>",
        "summary": "Polenta gnocchi with savoy cabbage and cheese could be just the <b>gluten free and lacto ovo vegetarian<\/b> recipe you've been looking for. For <b>$2.39 per serving<\/b>, you get a main course that serves 2. One serving contains <b>459 calories<\/b>, <b>20g of protein<\/b>, and <b>25g of fat<\/b>. This recipe is liked by 10 foodies and cooks. This recipe from Foodista requires savoy cabbage, sage, polenta, and egg. This recipe is typical of Mediterranean cuisine. From preparation to the plate, this recipe takes roughly <b>45 minutes<\/b>. Taking all factors into account, this recipe <b>earns a spoonacular score of 76%<\/b>, which is pretty good. <a href=\"https:\/\/spoonacular.com\/recipes\/savoy-cabbage-and-potato-soup-with-grated-leicester-cheese-and-greek-yogurt-486567\">Savoy Cabbage and Potato Soup with grated Leicester Cheese and Greek Yogurt<\/a>, <a href=\"https:\/\/spoonacular.com\/recipes\/savoy-cabbage-and-turnips-11377\">Savoy Cabbage And Turnips<\/a>, and <a href=\"https:\/\/spoonacular.com\/recipes\/savoy-cabbage-with-caraway-11134\">Savoy Cabbage With Caraway<\/a> are very similar to this recipe.",
        "cuisines": [
            "Mediterranean",
            "Italian",
            "European"
        ],
        "dishTypes": [
            "side dish",
            "lunch",
            "main course",
            "main dish",
            "dinner"
        ],
        "ingredients": [
            "1\/3 cup buckwheat flour",
            "2 tbsp butter",
            "1\/2 lb cooked polenta",
            "1 egg",
            "1\/2 cup fontina",
            "1 clove garlic",
            "sage",
            "salt",
            "1\/2 savoy cabbage"
        ]
    }
}