{
    "version": "1.0",
    "lastUpdated": "2025-11-01",
    "recipe": {
        "title": "Baked Rigatoni With Sausage",
        "readyInMinutes": 45,
        "servings": 6,
        "image": "https:\/\/img.spoonacular.com\/recipes\/633765-556x370.jpg",
        "sourceUrl": "https:\/\/www.foodista.com\/recipe\/XSDM3NJC\/baked-rigatoni-with-sausage",
        "instructions": "<ol><li>Bring a large pot of salted water to a boil over high heat for the pasta.<\/li><li>Meanwhile, heat 1 tablespoon olive oil in a large skillet over medium-high heat. Add the sausage and saute for 3 to 4 minutes until brown, but not fully cooked. Drain sausage and place in a 9x13 baking dish.<\/li><li>Add the remaining 1 tablespoon olive oil to the skillet, then add the onion and garlic, and cook until translucent ( 3 to 4 minutes). Add the tomatoes and their juices into a bowl and crush with your hands to break them up; pour tomatoes into the skillet with the basil and cook it down until slightly thickened (about 15 minutes).<\/li><li>Add the rigatoni to the boiling water, give it a stir, and cook for 6 to 7 minutes, it should be slightly firm as it will cook further in the oven. Ladle out 1\/2 cup of the pasta cooking water and reserve; then drain the rigatoni.<\/li><li>Preheat the oven to 450 degrees F. Add the tomato sauce, rigatoni, and the reserved pasta water to the baking dish. Break up half the mozzarella over the mixture, season with salt and pepper, and gently mix with a spoon. Dust with the Parmigiano and drizzle with more olive oil. Bake for 15 minutes. Spread the remaining mozzarella in an even layer over the top and continue to bake for another 10 minutes or until golden brown and bubbly.<\/li><\/ol>",
        "summary": "Baked Rigatoni With Sausage might be a good recipe to expand your main course recipe box. One serving contains <b>844 calories<\/b>, <b>43g of protein<\/b>, and <b>43g of fat<\/b>. This recipe serves 6 and costs $2.59 per serving. This recipe from Foodista requires garlic cloves, rigatoni, onion, and mozzarella. 9 people found this recipe to be delicious and satisfying. From preparation to the plate, this recipe takes roughly <b>45 minutes<\/b>. With a spoonacular <b>score of 90%<\/b>, this dish is awesome. If you like this recipe, you might also like recipes such as <a href=\"https:\/\/spoonacular.com\/recipes\/baked-rigatoni-sausage-424945\">Baked Rigatoni & Sausage<\/a>, <a href=\"https:\/\/spoonacular.com\/recipes\/baked-rigatoni-with-eggplant-and-sausage-331732\">Baked Rigatoni with Eggplant and Sausage<\/a>, and <a href=\"https:\/\/spoonacular.com\/recipes\/baked-sausage-and-cheese-rigatoni-826969\">Baked Sausage and Cheese Rigatoni<\/a>.",
        "cuisines": [],
        "dishTypes": [
            "side dish",
            "lunch",
            "main course",
            "main dish",
            "dinner"
        ],
        "ingredients": [
            "Leaves from 1 small bunch basil",
            "Freshly ground black pepper",
            "1 large can (28 ounces) peeled whole tomatoes",
            "1 pound fresh mozzarella",
            "3 garlic cloves, chopped",
            "3\/4 pound Italian sausage",
            "Kosher Salt",
            "1 tablespoon extra-virgin olive oil",
            "1 large onion, chopped",
            "1 cup freshly grated Parmigiano-Reggiano",
            "1 pound rigatoni"
        ]
    }
}