{
    "version": "1.0",
    "lastUpdated": "2026-02-01",
    "recipe": {
        "title": "Slow Cooker Spicy Hot Wings",
        "readyInMinutes": 14,
        "servings": 4,
        "image": "https:\/\/img.spoonacular.com\/recipes\/715419-556x370.jpg",
        "sourceUrl": "https:\/\/www.pinkwhen.com\/slow-cooker-spicy-hot-wings\/",
        "instructions": "Yes, these are called SPICY hot wings for a reason. I like adding the brown sugar to give them a little sweeter taste, but it is by far a delicious spicy recipe more than anything.To get started, mix the brown sugar, crushed garlic, hot sauce, and cayenne pepper into a medium mixing bowl. Mix well and then set aside.Take the cooking spray and spray the entire inside portion of the slow cooker AND also the wings. (Spraying the wings before you grill, bake, or cook chicken keeps the flavor and makes them super juicy. TRUST ME.)Take the wings and add them into the mixing bowl with your spices and toss to get a good even coat over the wings.Place in the slow cooker on low for 4 hours. After 4hours, remove carefully and place on a prepared cookie sheet. Place in the oven under broiler setting for 4-6 minutes, allowing the wings to get a little crisp.Serve immediately with a little blue cheese dressing and celery.",
        "summary": "Slow Cooker Spicy Hot Wings might be a good recipe to expand your hor d'oeuvre recipe box. This recipe serves 4 and costs $1.01 per serving. One portion of this dish contains approximately <b>23g of protein<\/b>, <b>20g of fat<\/b>, and a total of <b>384 calories<\/b>. Head to the store and pick up brown sugar, cayenne pepper, garlic, and a few other things to make it today. This recipe is typical of American cuisine. 16911 person were glad they tried this recipe. It is brought to you by Pink When. From preparation to the plate, this recipe takes about <b>14 minutes<\/b>. It is a good option if you're following a <b>gluten free and dairy free<\/b> diet. All things considered, we decided this recipe <b>deserves a spoonacular score of 57%<\/b>. This score is pretty good. If you like this recipe, you might also like recipes such as <a href=\"https:\/\/spoonacular.com\/recipes\/slow-cooker-spicy-hot-wings-1261215\">Slow Cooker Spicy Hot Wings<\/a>, <a href=\"https:\/\/spoonacular.com\/recipes\/hot-spicy-wings-with-maple-chipotle-hot-sauce-1093023\">Hot & spicy wings with maple chipotle hot sauce<\/a>, and <a href=\"https:\/\/spoonacular.com\/recipes\/spicy-hot-wings-434688\">Spicy Hot Wings<\/a>.",
        "cuisines": [
            "American"
        ],
        "dishTypes": [
            "lunch",
            "antipasti",
            "main course",
            "starter",
            "snack",
            "appetizer",
            "main dish",
            "antipasto",
            "dinner",
            "hor d'oeuvre"
        ],
        "ingredients": [
            "½ cup brown sugar",
            "1 tsp cayenne pepper",
            "2 - 4 pounds regular chicken wings",
            "1 Tbsp crushed garlic",
            "½ cup Louisiana Hot sauce"
        ]
    }
}