{
    "version": "1.0",
    "lastUpdated": "2025-03-22",
    "recipe": {
        "title": "Traditional Garlic and Herb Crusted Prime Rib Roast",
        "readyInMinutes": 45,
        "servings": 24,
        "image": "https:\/\/img.spoonacular.com\/recipes\/663763-556x370.jpg",
        "sourceUrl": "http:\/\/www.foodista.com\/recipe\/FGWST82P\/traditional-garlic-and-herb-crusted-prime-rib-roast",
        "instructions": "<ol><li>2-3 hours before you want to begin cooking, take the roast out of the fridge and place it on a cutting board at room temperature.<\/li><li>Preheat the oven to 325 degrees F.<\/li><li>To prepare roast, remove excess fat from the bottom of the roast, and then trim the layer of fat from the top side (leaving a little fat is fine).<\/li><li>In a bowl, mix the garlic and chopped herbs with salt and pepper. Add the olive oil and mix until combined.<\/li><li>Evenly apply garlic herb rub on all sides of the roast.<\/li><li>Tie roast with string and insert a bay leaf underneath each string across the top.<\/li><li>Roast until the internal temperature reaches 120 degrees F for medium-rare, about 2 1\/2 hours. If you prefer medium, take the roast out when the thermometer reads 130 degrees F.<\/li><li>Let roast rest for 10 minutes before carving.<\/li><\/ol>",
        "summary": "Traditional Garlic and Herb Crusted Prime Rib Roast is a main course that serves 24. Watching your figure? This gluten free, dairy free, paleolithic, and primal recipe has <b>592 calories<\/b>, <b>26g of protein<\/b>, and <b>53g of fat<\/b> per serving. For <b>$4.32 per serving<\/b>, this recipe <b>covers 17%<\/b> of your daily requirements of vitamins and minerals. Head to the store and pick up bay leaves, pepper, thyme leaves, and a few other things to make it today. 2 people have made this recipe and would make it again. From preparation to the plate, this recipe takes roughly <b>45 minutes<\/b>. <b>valentin day<\/b> will be even more special with this recipe. It is brought to you by Foodista. Taking all factors into account, this recipe <b>earns a spoonacular score of 50%<\/b>, which is solid. Similar recipes include <a href=\"https:\/\/spoonacular.com\/recipes\/traditional-garlic-and-herb-crusted-prime-rib-roast-1372005\">Traditional Garlic and Herb Crusted Prime Rib Roast<\/a>, <a href=\"https:\/\/spoonacular.com\/recipes\/herb-crusted-prime-rib-roast-291159\">Herb Crusted Prime Rib Roast<\/a>, and <a href=\"https:\/\/spoonacular.com\/recipes\/garlic-herb-crusted-prime-rib-275407\">Garlic & Herb-Crusted Prime Rib<\/a>.",
        "cuisines": [],
        "dishTypes": [
            "lunch",
            "main course",
            "main dish",
            "dinner"
        ],
        "ingredients": [
            "Bay leaves",
            "1\/2 teaspoon black pepper",
            "1\/2 cup fresh parsley leaves, finely chopped",
            "1\/2 cup fresh rosemary leaves, finely chopped",
            "1\/2 cup fresh tarragon leaves, finely chopped",
            "1\/4 cup fresh thyme leaves, finely chopped",
            "3 gloves garlic, crushed",
            "2 tablespoons kosher salt",
            "1\/4 cup olive oil",
            "1 10 to 12-pound boneless prime rib roast, at room temperature"
        ]
    }
}