{
    "version": "1.0",
    "lastUpdated": "2025-06-10",
    "recipe": {
        "title": "Easy Baked Pork Chop",
        "readyInMinutes": 45,
        "servings": 3,
        "image": "https:\/\/img.spoonacular.com\/recipes\/715481-556x370.jpg",
        "sourceUrl": "http:\/\/www.pinkwhen.com\/easy-baked-pork-chop-recipe\/",
        "instructions": "Heat your oven up to 350. Mix in a small bowl the soy sauce, worcestershire sauce, ketchup, vegetable oil, and lemon juice together. Rinse your pork chops, and place them in a glass baking dish. Place half of your mixture over the top of the pork chops and bake for 30 minutes. Remove from oven, turn over pork chops, and cover with the remaining mixture. Bake for an additional 30 minutes.You are all done! Add a salad, mashed potatoes, and some bread!Simple, Quick, and Easy.JOIN 500,000 SUBSCRIBERS!Join over 500,000 others who follow PinkWhen on Social Media, the PinkWhen blog, and email. Sign up to receive exclusive bonuses like this FREE Simple Fit Dinners Ebook.Don't wait! You won't want to miss a thing.Success! Now check your email to confirm your subscription and download your FREE ebook.There was an error submitting your subscription. Please try again.First NameEmail AddressSubscribePowered by ConvertKit",
        "summary": "Easy Baked Pork Chop requires approximately <b>45 minutes<\/b> from start to finish. One portion of this dish contains roughly <b>59g of protein<\/b>, <b>28g of fat<\/b>, and a total of <b>520 calories<\/b>. This gluten free, dairy free, and fodmap friendly recipe serves 3 and costs <b>$3.19 per serving<\/b>. It is brought to you by Pink When. If you have worcestershire sauce, lemon juice, cut pork chops, and a few other ingredients on hand, you can make it. It works well as a rather pricey main course. This recipe is liked by 405 foodies and cooks. Taking all factors into account, this recipe <b>earns a spoonacular score of 92%<\/b>, which is super. If you like this recipe, take a look at these similar recipes: <a href=\"https:\/\/spoonacular.com\/recipes\/easy-baked-pork-chop-1370031\">Easy Baked Pork Chop<\/a>, <a href=\"https:\/\/spoonacular.com\/recipes\/easy-dinner-s-baked-pork-chop-528251\">Easy Dinner s: Baked Pork Chop<\/a>, and <a href=\"https:\/\/spoonacular.com\/recipes\/one-dish-baked-pork-chop-dinner-526437\">One Dish Baked Pork Chop Dinner<\/a>.",
        "cuisines": [],
        "dishTypes": [
            "lunch",
            "main course",
            "main dish",
            "dinner"
        ],
        "ingredients": [
            "2 tbsp ketchup",
            "1 tbsp lemon juice",
            "6 medium cut pork chops",
            "1 tbsp soy sauce",
            "2 tbsp vegetable oil",
            "2 tbsp worcestershire sauce"
        ]
    }
}