{
    "version": "1.0",
    "lastUpdated": "2025-03-28",
    "recipe": {
        "title": "Enchiladas Verdes (Green Enchiladas)",
        "readyInMinutes": 45,
        "servings": 6,
        "image": "https:\/\/img.spoonacular.com\/recipes\/642403-556x370.jpg",
        "sourceUrl": "https:\/\/www.foodista.com\/recipe\/XXGS8CCC\/enchiladas-verdes-green-enchiladas",
        "instructions": "Roast Chili Peppers\nPreheat broiler. Select firm, meaty peppers without wrinkles for roasting. Wash thoroughly. Place peppers evenly in a single layer on a foil-lined cookie sheet. Place under broiler. Watch them closely as the skin will blister and turn black within minutes. Turn the peppers after 5 minutes to blister all sides evenly. When done, the pepper skins should be evenly blistered and mostly black. Place roasted peppers in a plastic bag, cover with a kitchen towel and when cool, rub off blackened skin. Tear open and pull out the seed pod and stem.\nSauce\nIn a blender combine the peppers, flour, and half of the suero or buttermilk and blend until creamy. Pour mixture into medium skillet and set over medium-low heat to warm. Add additional suero or buttermilk and stir. Taste and season with salt, usually about 2 teaspoons. If the sauce is too spicy, add  cup of crema or sour cream and stir. If the sauce is too thick, add water until desired consistency is reached.\nChicken (Optional)\nIn a pot with enough water to cover, boil chicken breasts 25 minutes or until juices run clear. Drain, cool, and shred. Optional time-saver: shred a store bought rotisserie chicken.\nStacked Style\nFry tortillas in hot oil until softened. Drain on paper towels. Soften tortillas by soaking in sauce one at a time. Place softened tortillas on individual serving plates. Layer with cooked chicken, cheese, and onion. Repeat process for a total of 3 tortillas for each serving.\nOven Style\nPreheat oven to 350 degrees. Spread 1 cup of the sauce in an ungreased 9-by-13-inch baking dish. Fry tortillas in hot oil just until softened. Drain on paper towels. Fill with cooked chicken, cheese, and onion. Roll, placing seam side down.\nPour 2 cups of the sauce over enchiladas. Sprinkle with crumbled queso fresco and bake until warm, about 15 minutes. Serve with a dollop of crema or sour cream and your favorite side dish.",
        "summary": "Enchiladas Verdes (Green Enchiladas) might be just the <b>Mexican<\/b> recipe you are searching for. This recipe makes 6 servings with <b>471 calories<\/b>, <b>29g of protein<\/b>, and <b>20g of fat<\/b> each. For <b>$2.6 per serving<\/b>, this recipe <b>covers 22%<\/b> of your daily requirements of vitamins and minerals. 8 people found this recipe to be tasty and satisfying. From preparation to the plate, this recipe takes approximately <b>45 minutes<\/b>. A mixture of chicken breast, onion, canolan oil, and a handful of other ingredients are all it takes to make this recipe so flavorful. It is brought to you by Foodista. Only a few people really liked this main course. Overall, this recipe earns a <b>solid spoonacular score of 61%<\/b>. If you like this recipe, take a look at these similar recipes: <a href=\"https:\/\/spoonacular.com\/recipes\/enchiladas-verdes-con-pavo-green-chile-turkey-enchiladas-555668\">Enchiladas Verdes con Pavo (Green Chile Turkey Enchiladas)<\/a>, <a href=\"https:\/\/spoonacular.com\/recipes\/enchiladas-verdes-green-enchiladas-1282881\">Enchiladas Verdes (Green Enchiladas)<\/a>, and <a href=\"https:\/\/spoonacular.com\/recipes\/enchiladas-verdes-green-enchiladas-1772459\">Enchiladas Verdes (Green Enchiladas)<\/a>.",
        "cuisines": [
            "Mexican"
        ],
        "dishTypes": [
            "lunch",
            "main course",
            "main dish",
            "dinner"
        ],
        "ingredients": [
            "1 pound skinless, boneless chicken breast",
            "12 Anaheim green chili peppers",
            "1\/2 cup canola oil for frying",
            "1 quart Suero de Sal (whey) or buttermilk can be used as a substitute",
            "2 tablespoons flour",
            "1 medium white onion, diced",
            "12 to 18 corn tortillas, preferably white",
            "1 cup white shredded cheese (Monterey Jack, Azadero or Muenster)",
            "1\/4 queso fresco, crumbled",
            "1\/2 cup crema or sour cream (for sauce and topping)",
            "Salt (to taste)",
            "Water (if needed)"
        ]
    }
}