{
    "version": "1.0",
    "lastUpdated": "2025-08-09",
    "recipe": {
        "title": "Beef Lo Mein Noodles",
        "readyInMinutes": 45,
        "servings": 4,
        "image": "https:\/\/img.spoonacular.com\/recipes\/634629-556x370.jpg",
        "sourceUrl": "https:\/\/www.foodista.com\/recipe\/8QKG6BC8\/beef-lo-mein",
        "instructions": "Drop noodles into a large quantity of boiling water and cook 3-5 minutes, until barely tender to the bite. Drain, rinse with cold water and reserve.\nCombine the beef and oyster sauce in a bowl; stir to coat. Let stand for 10 minutes.\nIn another bowl, combine the chicken broth, soy sauce and sesame oil. Set aside.\nHeat a wok over high heat. When hot, add the vegetable oil, swirling to coat the sides. Add the garlic, ginger, and green onions and cook, stirring until fragrant, about 30 seconds. Add the beef and cook, stirring constantly, about 1 minute.\nAdd the sauce and noodles.\nGently toss until heated through and sauce has thickened. Serve immediately.",
        "summary": "The recipe Beef Lo Mein Noodles can be made <b>in around 45 minutes<\/b>. This recipe serves 4 and costs $2.28 per serving. One portion of this dish contains around <b>23g of protein<\/b>, <b>18g of fat<\/b>, and a total of <b>344 calories<\/b>. It works well as a reasonably priced main course. This recipe from Foodista requires soba noodles, flank steak, green onions, and garlic. It is a good option if you're following a <b>dairy free<\/b> diet. 22 people were impressed by this recipe. With a spoonacular <b>score of 67%<\/b>, this dish is pretty good. Users who liked this recipe also liked <a href=\"https:\/\/spoonacular.com\/recipes\/beef-lo-mein-noodles-1299671\">Beef Lo Mein Noodles<\/a>, <a href=\"https:\/\/spoonacular.com\/recipes\/lo-mein-noodles-471994\">Lo Mein Noodles<\/a>, and <a href=\"https:\/\/spoonacular.com\/recipes\/pork-lo-mein-with-zucchini-noodles-1270489\">Pork Lo Mein with Zucchini Noodles<\/a>.",
        "cuisines": [],
        "dishTypes": [
            "side dish",
            "lunch",
            "main course",
            "main dish",
            "dinner"
        ],
        "ingredients": [
            "8 ounces dried Chinese egg noodles or soba (buckwheat) noodles",
            "3\/4 pound flank steak, trimmed of any fat and cut into thin strips",
            "1 tablespoon oyster sauce",
            "1\/2 cup chicken stock",
            "2 tablespoons soy sauce",
            "2 teaspoons sesame oil",
            "3 tablespoons vegetable oil",
            "2 teaspoons garlic, minced",
            "2 teaspoon ginger, minced",
            "1\/4 cup green onions, chopped"
        ]
    }
}