{
    "version": "1.0",
    "lastUpdated": "2025-10-24",
    "recipe": {
        "title": "Pasta With Salmon Cream Sauce",
        "readyInMinutes": 45,
        "servings": 4,
        "image": "https:\/\/img.spoonacular.com\/recipes\/654944-556x370.jpg",
        "sourceUrl": "https:\/\/www.foodista.com\/recipe\/WRF73JT3\/pasta-with-salmon-cream-sauce",
        "instructions": "<ol><li>Calories per serving: 300 In large pot of boiling water, cook pasta al dente (tender but firm) about 10 12 minutes. Drain and return to pot. In saucepan, melt butter over medium heat add onion and cook until tender.<\/li><li>Stir in flour and cook for a few seconds. Whisk in milk and bring to sa simmer, stirring constantly. Add peas, salmon brokin into chunks and salmon juices, parsley, cheese, pepper. Pour mixture over pasta and stir gently to mix. Serve Immediately. Microwave method: Cook pasta as above in glass bowl or 4 cup measure. Microwave butter and onion at Medium-High for 1 minute or until onion is tender. Stir in flour to form smooth paste. Gradually whisk in milk. <\/li><\/ol>",
        "summary": "Pasta With Salmon Cream Sauce is a <b>pescatarian<\/b> main course. One portion of this dish contains approximately <b>23g of protein<\/b>, <b>15g of fat<\/b>, and a total of <b>439 calories<\/b>. For <b>$1.6 per serving<\/b>, this recipe <b>covers 23%<\/b> of your daily requirements of vitamins and minerals. This recipe serves 4. 3 people were impressed by this recipe. It is brought to you by Foodista. If you have peas, salmon, milk, and a few other ingredients on hand, you can make it. From preparation to the plate, this recipe takes about <b>45 minutes<\/b>. Taking all factors into account, this recipe <b>earns a spoonacular score of 68%<\/b>, which is pretty good. Similar recipes include <a href=\"https:\/\/spoonacular.com\/recipes\/pasta-with-salmon-cream-sauce-1241307\">Pasta With Salmon Cream Sauce<\/a>, <a href=\"https:\/\/spoonacular.com\/recipes\/spinach-pasta-with-salmon-and-cream-sauce-86877\">Spinach Pasta with Salmon and Cream Sauce<\/a>, and <a href=\"https:\/\/spoonacular.com\/recipes\/artisan-farfalle-pasta-with-smoked-salmon-and-cream-sauce-632778\">Artisan Farfalle Pasta With Smoked Salmon and Cream Sauce<\/a>.",
        "cuisines": [],
        "dishTypes": [
            "side dish",
            "lunch",
            "main course",
            "main dish",
            "dinner"
        ],
        "ingredients": [
            "2 tablespoons butter - (¼ stick)",
            "2 teaspoons Flour, all purpose",
            "1 1\/4 cups Milk",
            "2 teaspoons Onion, minced",
            "1\/2 cup Parmesan cheese, grated",
            "1\/4 cup Parsley",
            "1 cup Peas",
            "8 ounces Penne or zita or other tubul",
            "1\/4 teaspoon Pepper",
            "1 cup Salmon, red sockeye"
        ]
    }
}