{
    "version": "1.0",
    "lastUpdated": "2025-08-31",
    "recipe": {
        "title": "Chicken Pasta With Anchovy Rosemary Sauce",
        "readyInMinutes": 45,
        "servings": 4,
        "image": "https:\/\/img.spoonacular.com\/recipes\/638245-556x370.jpg",
        "sourceUrl": "https:\/\/www.foodista.com\/recipe\/QVWP6WF5\/chicken-pasta-with-anchovy-rosemary-sauce",
        "instructions": "<ol><li>Place garlic, anchovies (with their oil), rosemary and lemon juice in a food processor.  Blend until fairly smooth.  Add lemon juice followed by olive oil and continue to blend until smooth.  Cover and set aside.<\/li><li>Season chicken with red pepper flakes, poultry seasoning and a pinch of kosher salt.  Set aside.<\/li><li>Start a pot of water boiling for the pasta.  Add a pinch of salt.  Once boiling, cook pasta to desired doneness, approximately 6-9 minutes for al dente.<\/li><li>As pasta cooks, drizzle a bit of olive oil in a wide pan.  When hot, add the chicken and cook until no longer pink inside, approximately 5-7 minutes.<\/li><li>Drain pasta and drop the noodles directly into the pan with the chicken.  Add anchovy sauce and toss to coat. Sprinkle with fresh parsley if desired.<\/li><\/ol>",
        "summary": "If you have around <b>45 minutes<\/b> to spend in the kitchen, Chicken Pasta With Anchovy Rosemary Sauce might be an awesome <b>dairy free<\/b> recipe to try. This recipe serves 4. One serving contains <b>394 calories<\/b>, <b>23g of protein<\/b>, and <b>14g of fat<\/b>. For <b>$1.59 per serving<\/b>, this recipe <b>covers 16%<\/b> of your daily requirements of vitamins and minerals. It works well as a rather inexpensive main course. 2 people were impressed by this recipe. A mixture of olive oil, garlic, juice of lemon, and a handful of other ingredients are all it takes to make this recipe so tasty. It is brought to you by Foodista. Overall, this recipe earns a <b>solid spoonacular score of 58%<\/b>. If you like this recipe, take a look at these similar recipes: <a href=\"https:\/\/spoonacular.com\/recipes\/chicken-pasta-with-anchovy-rosemary-sauce-1375729\">Chicken Pasta With Anchovy Rosemary Sauce<\/a>, <a href=\"https:\/\/spoonacular.com\/recipes\/pasta-with-walnut-anchovy-sauce-1108338\">Pasta with Walnut Anchovy Sauce<\/a>, and <a href=\"https:\/\/spoonacular.com\/recipes\/pasta-with-anchovy-walnut-sauce-238\">Pasta With Anchovy-walnut Sauce<\/a>.",
        "cuisines": [],
        "dishTypes": [
            "side dish",
            "lunch",
            "main course",
            "main dish",
            "dinner"
        ],
        "ingredients": [
            "2 ounces anchovies, in oil",
            "1 boneless Chicken Breast",
            "4 tablespoons fresh rosemary",
            "1 large clove garlic, peeled and roughly chopped",
            "Juice of 1\/2 lemon",
            "Kosher salt",
            "3 tablespoons Olive Oil",
            "1 tablespoon poultry seasoning",
            "1\/2 teaspoon red pepper flakes",
            "1\/2 pound spaghetti"
        ]
    }
}