{
    "version": "1.0",
    "lastUpdated": "2025-12-23",
    "recipe": {
        "title": "Pork chops with apples and onions",
        "readyInMinutes": 45,
        "servings": 4,
        "image": "https:\/\/img.spoonacular.com\/recipes\/656738-556x370.jpg",
        "sourceUrl": "https:\/\/www.foodista.com\/recipe\/ZFS45WC2\/pork-chops-with-apples-and-onions",
        "instructions": "Season the chops with salt and pepper on both sides. Saut the pork chops in hot oil for 5 minutes on each side until browned. Transfer the chops to a warm plate.\nSwirl the butter into the pan, and add the onion and apples. Saut until the onion slices are lightly caramelized and the apples have begun to soften, about 8 minutes.\nStir in the wine or other liquid. Return chops to the pan.\nCook until the pork is tender, about 15 more minutes (depending on the size of the chops), turning halfway through and covering the chops with the apple mixture.\nServe the chops over rice or mashed potatoes with a large spoonful of the apple-onion mixture over the top.\nEasy suggestion: replace the onion with leeks or add a sliced potato. You can deglaze the pan with beer, cider, chicken broth, or even water.",
        "summary": "You can never have too many main course recipes, so give Pork chops with apples and onions a try. Watching your figure? This gluten free recipe has <b>483 calories<\/b>, <b>36g of protein<\/b>, and <b>25g of fat<\/b> per serving. This recipe serves 4 and costs $2.52 per serving. If you have pork chops, white wine, butter, and a few other ingredients on hand, you can make it. It is brought to you by Foodista. This recipe is liked by 8 foodies and cooks. From preparation to the plate, this recipe takes around <b>45 minutes<\/b>. Taking all factors into account, this recipe <b>earns a spoonacular score of 64%<\/b>, which is solid. Try <a href=\"https:\/\/spoonacular.com\/recipes\/pork-chops-with-apples-and-onions-1364599\">Pork chops with apples and onions<\/a>, <a href=\"https:\/\/spoonacular.com\/recipes\/pork-chops-with-onions-and-apples-436654\">Pork Chops with Onions and Apples<\/a>, and <a href=\"https:\/\/spoonacular.com\/recipes\/pork-chops-with-apples-and-onions-1218929\">Pork Chops with Apples and Onions<\/a> for similar recipes.",
        "cuisines": [],
        "dishTypes": [
            "lunch",
            "main course",
            "main dish",
            "dinner"
        ],
        "ingredients": [
            "4 pork chops (loin or shoulder, bone-in)",
            "Salt and ground black pepper",
            "1 Tbs olive oil or sunflower oil",
            "2 Tbs unsalted butter",
            "1 large white onion, sliced",
            "3 cups apples (2 to 3 apples), cored and sliced",
            "1 cup white wine"
        ]
    }
}