{
    "version": "1.0",
    "lastUpdated": "2025-07-17",
    "recipe": {
        "title": "Warm Goat Cheese Salad",
        "readyInMinutes": 45,
        "servings": 2,
        "image": "https:\/\/img.spoonacular.com\/recipes\/664961-556x370.jpg",
        "sourceUrl": "https:\/\/www.foodista.com\/recipe\/78R2D43F\/warm-goat-cheese-salad",
        "instructions": "<ol><li>Whisk together 3 tablespoons of walnut oil with lemon juice, minced shallot, salt and pepper to make a vinaigrette. Coat each goat cheese round with walnut oil and then the bread crumbs, patting the crumbs to adhere.<\/li><li>Combine the greens and the walnuts in a large bowl. Add in enough of the vinaigrette and toss well. Adjust the seasoning and divide among two serving plates.<\/li><li>Heat a nonstick skillet over medium heat. Add in olive oil. When the oil is hot, add the goat cheese rounds. Cook until nicely browned, about 30 seconds. Turn and cook the other side. Do not allow it to burn or melt. Transfer the goat cheese to the plates, placing 2 or 3 atop each salad. Sprinkle the cheese with freshly ground pepper and garnish with grape wedges.<\/li><\/ol>",
        "summary": "If you want to add more <b>lacto ovo vegetarian<\/b> recipes to your recipe box, Warm Goat Cheese Salad might be a recipe you should try. This recipe serves 2 and costs $3.06 per serving. One serving contains <b>481 calories<\/b>, <b>14g of protein<\/b>, and <b>42g of fat<\/b>. 2 people were glad they tried this recipe. It is brought to you by Foodista. A mixture of olive oil, shallot, lemon juice, and a handful of other ingredients are all it takes to make this recipe so flavorful. Not a lot of people really liked this main course. From preparation to the plate, this recipe takes roughly <b>45 minutes<\/b>. Overall, this recipe earns a <b>pretty good spoonacular score of 75%<\/b>. Users who liked this recipe also liked <a href=\"https:\/\/spoonacular.com\/recipes\/warm-goats-cheese-salad-1091197\">Warm Goat's Cheese Salad<\/a>, <a href=\"https:\/\/spoonacular.com\/recipes\/salad-with-warm-goat-cheese-377474\">Salad with Warm Goat Cheese<\/a>, and <a href=\"https:\/\/spoonacular.com\/recipes\/warm-goat-cheese-salad-100001\">Warm Goat Cheese Salad<\/a>.",
        "cuisines": [],
        "dishTypes": [
            "side dish",
            "lunch",
            "main course",
            "salad",
            "main dish",
            "dinner"
        ],
        "ingredients": [
            "Some bread crumbs",
            "100 grams \/ 5 rounds Fresh goat cheese",
            "5 Grapes, cut into wedges",
            "2 tablespoons freshly squeezed lemon juice",
            "2 tablespoons olive oil",
            "Freshly ground pepper to taste",
            "60 grams Salad greens",
            "Salt and pepper",
            "1 Shallot, finely minced",
            "1 tablespoon Walnut oil",
            "30 grams Walnuts, toasted and coarsely chopped"
        ]
    }
}