{
    "version": "1.0",
    "lastUpdated": "2025-05-29",
    "recipe": {
        "title": "Dak Bulgogi - Korean BBQ Chicken",
        "readyInMinutes": 400,
        "servings": 4,
        "image": "https:\/\/img.spoonacular.com\/recipes\/641208-556x370.jpg",
        "sourceUrl": "http:\/\/www.foodista.com\/recipe\/QNLYWCMG\/dak-bulgogi-korean-bbq-chicken",
        "instructions": "<ol><li>Peel off thigh skins with a paring knife. Trim off excess fat. Cut into one single \"steak\" piece working around the bone. Save smaller pieces for cooking as well. Set aside in a large mixing bowl.<\/li><li>Pulse the marinade ingredients in a food processor until smooth.<\/li><li>Coat the chicken pieces with the marinade. Marinate overnight in the refrigerator or a minimum of 6-12 hours. With a skewer or toothpick, piercing the thighs for extra marinade absorption is optional.<\/li><li>Preheat a skillet or non stick pan over medium heat. Add the chicken thighs and cook for about 15-20 minutes or until cooked through. To ensure fully cooked thighs, use a meat thermometer and check for a reading of 165-170F.<\/li><li>Transfer to a serving plate and garnish with scallion. Serve with lettuce leaves. Enjoy!<\/li><\/ol>",
        "summary": "If you have around <b>6 hours and 40 minutes<\/b> to spend in the kitchen, Dak Bulgogi - Korean BBQ Chicken might be an amazing <b>gluten free and dairy free<\/b> recipe to try. This main course has <b>557 calories<\/b>, <b>40g of protein<\/b>, and <b>39g of fat<\/b> per serving. This recipe serves 4. For <b>$1.6 per serving<\/b>, this recipe <b>covers 20%<\/b> of your daily requirements of vitamins and minerals. 2 people have made this recipe and would make it again. Only a few people really liked this Korean dish. Head to the store and pick up chicken thighs, boston bibb lettuce, brown sugar, and a few other things to make it today. It is brought to you by Foodista. Overall, this recipe earns a <b>pretty good spoonacular score of 47%<\/b>. Users who liked this recipe also liked <a href=\"https:\/\/spoonacular.com\/recipes\/dak-bulgogi-korean-bbq-chicken-248907\">Dak Bulgogi (Korean BBQ Chicken)<\/a>, <a href=\"https:\/\/spoonacular.com\/recipes\/dak-bulgogi-korean-bbq-chicken-1248345\">Dak Bulgogi - Korean BBQ Chicken<\/a>, and <a href=\"https:\/\/spoonacular.com\/recipes\/dak-bulgogi-korean-bbq-chicken-1566187\">Dak Bulgogi (Korean BBQ Chicken)<\/a>.",
        "cuisines": [
            "Korean",
            "Asian"
        ],
        "dishTypes": [
            "lunch",
            "main course",
            "main dish",
            "dinner"
        ],
        "ingredients": [
            "•1\/2 apple or pear",
            "•1 bunch Boston bibb lettuce",
            "•1 tbsp brown sugar",
            "2 lbs chicken thighs",
            "•3 garlic cloves",
            "•1 tsp ginger",
            "•1 tsp red pepper flakes",
            "•scallions",
            "•1 tsp sesame oil",
            "•1 tsp sesame seeds (garnish)",
            "•1\/2 cup soy sauce"
        ]
    }
}