{
    "version": "1.0",
    "lastUpdated": "2025-05-18",
    "recipe": {
        "title": "Crock-Pot: Asian-Style Country Ribs with Black Bean Garlic Sauce",
        "readyInMinutes": 45,
        "servings": 4,
        "image": "https:\/\/img.spoonacular.com\/recipes\/735820-556x370.jpg",
        "sourceUrl": "http:\/\/oneperfectbite.blogspot.com\/2008\/10\/crock-pot-asian-style-country-ribs-with.html",
        "instructions": "This crock-pot entre is really, really good. It takes 10 minutes to prepare, is made from ingredients that are readily available and is a bargain when you consider the number of servings it provides.  One caution -  you'll have mush with  Asian flavor if you cook this for more than 5 to 6 hours. The recipe is adapted from \"Slow Cooker Recipes for All Occasions\",  a Rival Crock-Pot publication.  Served with rice and snow peas you have the makings of a minor feast that you'll repeat often. My family loves this dish. I think yours will, too. This, by the way, is a wonderful recipe for novice cooks. If you have a willing teen, let them have a go at it.Asian-Style Country Ribs with Black Bean Garlic SauceIngredients:3 to 4 pounds boneless country-style pork ribs, cross cut in 1-1\/2-inch pieces3 tablespoons prepared black bean garlic sauce from a jar (i.e. Lee Kum Kee)1\/4 cup low-sodium soy salt1\/4 cup mirin or chicken stock1 tablespoon honey1 tablespoon freshly grated ginger root1 tablespoon coarsely chopped fresh garlic1\/2 teaspoon coarsely cracked black pepper1 tablespoon cornstarch2 teaspoons dark sesame oil1\/4 cup + 2 tablespoons chopped scallions (white and tender green)Directions:1) Spray interior of slow cooker with nonstick cooking spray. Place pork cubes in slow cooker. Combine black bean garlic sauce, soy sauce, mirin, honey, ginger, garlic, pepper and cornstarch in a small bowl; stir to dissolve cornstarch. Pour over ribs.2) Cook, covered, on LOW setting for 5 to 6 hours until ribs are tender but still hold their shape. Transfer ribs to a rimmed serving platter; tent with foil to keep warm. Strain liquid into a small pan. Bring liquid to a boil over medium-high heat; cook until mixture begins to thicken and is reduced by half. Stir in sesame oil. Add sauce and 1\/4 cup scallions to pork cubes.  Mix well. Garnish with reserved 2 tablespoons scallions. Yield: 6 to 8 servings.",
        "summary": "Crock-Pot: Asian-Style Country Ribs with Black Bean Garlic Sauce could be just the <b>dairy free and ketogenic<\/b> recipe you've been looking for. One serving contains <b>732 calories<\/b>, <b>39g of protein<\/b>, and <b>58g of fat<\/b>. This recipe serves 4. For <b>$2.35 per serving<\/b>, this recipe <b>covers 25%<\/b> of your daily requirements of vitamins and minerals. Many people really liked this main course. If you have soy salt, country, ginger root, and a few other ingredients on hand, you can make it. 912 people have made this recipe and would make it again. It is a <b>rather inexpensive<\/b> recipe for fans of Asian food. It is brought to you by oneperfectbite.blogspot.com. From preparation to the plate, this recipe takes roughly <b>45 minutes<\/b>. Overall, this recipe earns a <b>good spoonacular score of 75%<\/b>. Users who liked this recipe also liked <a href=\"https:\/\/spoonacular.com\/recipes\/crock-pot-asian-style-country-ribs-with-black-bean-garlic-sauce-1242665\">Crock-Pot: Asian-Style Country Ribs with Black Bean Garlic Sauce<\/a>, <a href=\"https:\/\/spoonacular.com\/recipes\/crock-pot-indonesian-style-country-ribs-114372\">Crock Pot Indonesian Style Country Ribs<\/a>, and <a href=\"https:\/\/spoonacular.com\/recipes\/crock-pot-bbq-country-style-ribs-484544\">Crock Pot BBQ Country Style Ribs<\/a>.",
        "cuisines": [
            "Asian"
        ],
        "dishTypes": [
            "lunch",
            "main course",
            "main dish",
            "dinner"
        ],
        "ingredients": [
            "3 tablespoons prepared black bean garlic sauce from a jar (i.e. Lee Kum Kee)",
            "1\/4 cup mirin or chicken stock",
            "1 tablespoon cornstarch",
            "Asian-Style Country Ribs with Black Bean Garlic Sauce",
            "2 teaspoons dark sesame oil",
            "1 tablespoon coarsely chopped fresh garlic",
            "1 tablespoon freshly grated ginger root",
            "1 tablespoon honey",
            "1\/2 teaspoon coarsely cracked black pepper",
            "3 to 4 pounds boneless country-style pork ribs, cross cut in 1-1\/2-inch pieces",
            "1\/4 cup low-sodium soy salt",
            "1\/4 cup + 2 tablespoons chopped scallions (white and tender green)"
        ]
    }
}