{
    "version": "1.0",
    "lastUpdated": "2025-05-12",
    "recipe": {
        "title": "Herb and Cheddar Cordon Bleu",
        "readyInMinutes": 60,
        "servings": 2,
        "image": "https:\/\/img.spoonacular.com\/recipes\/149425-556x370.jpg",
        "sourceUrl": "http:\/\/spoonacular.com\/1376680601330",
        "instructions": "<ol><li>Pre-heat the oven to 350 degrees F (about 176 degrees C).<\/li><li>Put the chicken breasts between two slices of wax paper and flatten with a rolling pin or meat mallet until they are about a quarter of an inch thick. <\/li><li>Place a slice of ham and a slice of cheddar on each chicken breast.<\/li><li>Roll the chicken breast as tightly as possible. If necessary, secure the rolls with toothpicks or small skewers.<\/li><li>Beat an egg in a shallow baking dish. <\/li><li>Arrange two other \"stations\" using foil or other dishes, one for the flour and another for the dried herbs and breadcrumbs. <\/li><li>Cover the rolled chicken breasts in flour, then dip them into the egg mixture. <\/li><li>Finally, press them into the mixture of dried herbs and breadcrumbs until they are covered on all sides.<\/li><li>Place the chicken in an oiled (or buttered) baking dish and bake for about 30 minutes.<\/li><\/ol>",
        "summary": "You can never have too many main course recipes, so give Herb and Cheddar Cordon Bleu a try. This recipe serves 2 and costs $3.74 per serving. One portion of this dish contains about <b>68g of protein<\/b>, <b>21g of fat<\/b>, and a total of <b>661 calories<\/b>. A mixture of marjoram, parsley, egg, and a handful of other ingredients are all it takes to make this recipe so scrumptious. From preparation to the plate, this recipe takes around <b>1 hour<\/b>. It is brought to you by spoonacular user <a href=\"\/profile\/coffeebean\">coffeebean<\/a>. Similar recipes are <a href=\"https:\/\/spoonacular.com\/recipes\/baked-chicken-cordon-bleu-633523\">Baked Chicken Cordon Bleu<\/a>, <a href=\"https:\/\/spoonacular.com\/recipes\/chicken-cordon-bleu-638035\">Chicken Cordon Bleu<\/a>, and <a href=\"https:\/\/spoonacular.com\/recipes\/chicken-cordon-bleu-with-mushroom-sauce-638038\">Chicken Cordon Bleu With Mushroom Sauce<\/a>.",
        "cuisines": [],
        "dishTypes": [
            "lunch",
            "main course",
            "main dish",
            "dinner"
        ],
        "ingredients": [
            "1\/2 cup breadcrumbs",
            "2 slices of cheddar cheese",
            "2 chicken breasts",
            "2 slices of deli ham",
            "2 tablespoons dried marjoram",
            "2 tablespoons dried parsley",
            "1 tablespoon dried rosemary",
            "1 egg",
            "1\/2 cup flour",
            "salt and pepper"
        ]
    }
}