{
    "version": "1.0",
    "lastUpdated": "2025-05-16",
    "recipe": {
        "title": "Bibimbab (Korean Rice w Vegetables & Beef)",
        "readyInMinutes": 45,
        "servings": 4,
        "image": "https:\/\/img.spoonacular.com\/recipes\/634965-556x370.jpg",
        "sourceUrl": "https:\/\/www.foodista.com\/recipe\/7SFVMHXW\/bibimbab-korean-rice-w-vegetables-beef",
        "instructions": "<ol><li>1.Cook rice according to package directions.<\/li><li>2.Cut vegetables into matchstick pieces and set aside for sauteing.<\/li><li>3.In a large non-stick pan\/skillet, bring 2 cups water to a boil. Add spinach and cook, stirring constantly until wilted; drain. When cool enough to handle, squeeze spinach dry into a ball.<\/li><li>4.Wipe out skillet; heat 1 tsp olive oil over medium-high. Add carrots and cook until soft, 3 minutes. Add garlic and cook until fragrant or semi-browned, 1 minute. Add cucumber slices mixed with gochugaru (red pepper flakes). Combine spinach and soy sauce; set aside until serving.<\/li><li>5.Add thinly sliced beef to non-stick pan and heat until browned. Wipe down with napkin.<\/li><li>6.Heat 1 tsp olive oil in non-stick pan over medium-high. Add eggs and cook until whites are set and yolks are still runny, about 5 minutes.<\/li><li>7.Divide rice among four bowls; top with vegetables and eggs. Drizzle each with sesame oil, sprinkle with sesame seeds. Top with gochujang (red pepper paste) or Sriracha sauce as substitute.<\/li><li>*Bibimbab and its main ingredients (usually rice and vegetables) can be chosen at one's preference. This is the main reason why bibimbab is so appealing; it suits vegetarians, dieters, health-conscience eaters, and even meat-lovers, who are more than welcome to add beef to their liking. For us, since we usually have rice available to eat at all times, we simply slice up any available vegetables or lettuce leaf varieties in the fridge for an \"instant\" and very satisfying bibimbab meal. So feel free to deviate from the original recipe!<\/li><\/ol>",
        "summary": "Forget going out to eat or ordering takeout every time you crave Korean food. Try making Bibimbab (Korean Rice w Vegetables & Beef) at home. This gluten free and dairy free recipe serves 4 and costs <b>$4.8 per serving<\/b>. This main course has <b>680 calories<\/b>, <b>40g of protein<\/b>, and <b>32g of fat<\/b> per serving. If you have garlic clove, sesame oil, sesame seeds, and a few other ingredients on hand, you can make it. This recipe from Foodista has 2 fans. From preparation to the plate, this recipe takes roughly <b>45 minutes<\/b>. Taking all factors into account, this recipe <b>earns a spoonacular score of 83%<\/b>, which is great. <a href=\"https:\/\/spoonacular.com\/recipes\/bibimbab-korean-rice-w-vegetables-beef-1297907\">Bibimbab (Korean Rice w Vegetables & Beef)<\/a>, <a href=\"https:\/\/spoonacular.com\/recipes\/korean-bibimbab-rice-w-vegetables-beef-1507229\">Korean Bibimbab (Rice w Vegetables & Beef)<\/a>, and <a href=\"https:\/\/spoonacular.com\/recipes\/korean-bibimbab-rice-w-vegetables-beef-649031\">Korean Bibimbab (Rice w Vegetables & Beef)<\/a> are very similar to this recipe.",
        "cuisines": [
            "Korean",
            "Asian"
        ],
        "dishTypes": [
            "lunch",
            "main course",
            "main dish",
            "dinner"
        ],
        "ingredients": [
            "•2 carrots, cut into thin matchsticks",
            "•4 cups cooked white rice",
            "6 eggs",
            "•1 English cucumber, cut into thin matchsticks (mixed with gochugaru)",
            "•1 garlic clove, minced",
            "•sprinkle gochugaru (red chili flakes; garnish)",
            "•4 tbsp gochujang (Korean red pepper paste; Sriracha sauce okay too)",
            "1 tablespoon olive oil",
            "•4 tsp sesame oil",
            "•1 tsp sesame seeds (garnish)",
            "•1 tbsp soy sauce",
            "•1 bunch fresh spinach (or pre-packaged spinach)",
            "•1 lb sandwich steaks, thin cut (any thin cut will work though)"
        ]
    }
}