{
    "version": "1.0",
    "lastUpdated": "2026-02-03",
    "recipe": {
        "title": "Ahi Tuna Ceviche",
        "readyInMinutes": 45,
        "servings": 3,
        "image": "https:\/\/img.spoonacular.com\/recipes\/632021-556x370.jpg",
        "sourceUrl": "https:\/\/www.foodista.com\/recipe\/7FBJ3QLN\/ahi-tuna-ceviche",
        "instructions": "<ol><li>In medium bowl mix soy sauce, toasted sesame oil, rice vinegar, Serrano pepper, lime juice, mint, and sesame seeds. Then add diced tuna and toss to coat.<\/li><li>The tuna is ready to eat as soon as it's tossed and coated but you can marinate it for a few minutes if desired. The tuna will start to turn white almost immediately, a sign that it is cooking from the acidity of the lime juice. It is not necessary to cook the tuna. In fact, it is best served immediately while it is melt-in-your-mouth tender and moist.<\/li><li>Serve immediately by mounding atop crackers, chips, micro-greens, or even roasted sweet potato slices.<\/li><\/ol>",
        "summary": "If you want to add more <b>Latin American<\/b> recipes to your recipe box, Ahi Tuna Ceviche might be a recipe you should try. One serving contains <b>117 calories<\/b>, <b>16g of protein<\/b>, and <b>4g of fat<\/b>. For <b>$2.29 per serving<\/b>, you get a main course that serves 3. It is brought to you by Foodista. It is a good option if you're following a <b>gluten free, dairy free, and pescatarian<\/b> diet. Not a lot of people made this recipe, and 3 would say it hit the spot. A mixture of ahi tuna steak, sesame oil, serrano pepper, and a handful of other ingredients are all it takes to make this recipe so scrumptious. From preparation to the plate, this recipe takes roughly <b>45 minutes<\/b>. All things considered, we decided this recipe <b>deserves a spoonacular score of 63%<\/b>. This score is good. Similar recipes include <a href=\"https:\/\/spoonacular.com\/recipes\/margarita-ahi-tuna-ceviche-883481\">Margaritan Ahi Tuna Ceviche<\/a>, <a href=\"https:\/\/spoonacular.com\/recipes\/uncle-bills-ahi-ahi-tuna-85052\">Uncle Bill's Ahi Ahi Tuna<\/a>, and <a href=\"https:\/\/spoonacular.com\/recipes\/chili-crusted-ahi-tuna-avocado-salad-with-cilantro-garlic-dressing-gf-and-fave-five-friday-healthy-tuna-1259649\">Chili Crusted Ahi Tuna & Avocado Salad with Cilantro Garlic Dressing (GF!) … and Fave Five Friday: Healthy Tuna<\/a>.",
        "cuisines": [
            "South American",
            "Latin American"
        ],
        "dishTypes": [
            "lunch",
            "main course",
            "main dish",
            "dinner"
        ],
        "ingredients": [
            "1 ahi tuna steak (approx. less than a 1 lb.)",
            "5 small leaves of fresh mint",
            "1\/2 tablespoon rice vinegar (recommended: O Yuzu Rice Vinegar by O 1\/2 of a Serrano pepper, very thinly sliced1 Juice of lime5 small leaves of fresh mintsprinkle of black sesame seeds (optional)",
            "1 Juice of lime",
            "1\/2 of a Serrano pepper, very thinly sliced",
            "1 tsp. sesame oil",
            "1In medium bowl mix soy sauce, toasted sesame oil, rice vinegar, Serrano pepper, lime juice, mint, and sesame seeds. Then add diced tuna and toss to coat.",
            "5 tbsp. soy sauce",
            "3Serve immediately by mounding atop crackers, chips, micro-greens, or even roasted sweet potato slices."
        ]
    }
}